[{"id":"research-0096","title":"Radio Meow 2.0","category":"research","tags":"Programming","date":"2020-05-14T19:24:11.393Z","draft":false,"deleted":false,"published":"Thu May 14th 2020, 3:24 PM","html":"<p>I&apos;ve been working on it for a few days, it works but the internal architecture could be better. The code is clear though.</p><p>It should work on slow connections now, it has less buttons (less confusion), and a seekable progress bar so one can skip around a poem/song.</p><p>It initially preloads the first poem, and once it starts playing it caches the one that follows, so eventually it grabs all the poems.</p><p>I am going to have to look into memory use and try to unload some poems but I need some experimental data for that.</p><p>I&apos;ll keep playing with it for now, see what else maybe broken.</p><p>I&apos;ll listen to it on a cheap phone on my bicycle adventures to see what problems may arise.</p><p>The UI came out a lot simpler than I expected, there is nothing exciting there, this is both good and odd.</p>"},{"id":"poetry-0069","title":"Whoop De Doo at Nordhouse Dunes","category":"poetry","tags":"Listen Poem","date":"2020-05-14T01:16:43.131Z","draft":false,"deleted":false,"published":"Wed May 13th 2020, 9:16 PM","html":"<p>Some adventurers,<br>\nwrestle bears.</p><p>Others,<br>\nrunaway from their fathers.</p><p>I,<br>\nbemoan the lack of Wi-Fi.</p><p><br><br></p><p>That is, until the night comes about,<br>\nat which point all the wild creatures come out.</p><p>I&apos;ve heard stories of owls swooping down from the air,<br>\njust to rip out whatever is left of a man&apos;s hair.</p><p>Then there are the occasional mad deer,<br>\nalways shimmy-shammying around like they had a beer.</p><p>The coyotes are especially frightening,<br>\nthey come in groups, flashing their eyes like lightening.</p><p>One time I tried to turn on a flashlight,<br>\nas it turned out - to all the big spider&apos;s delight.</p><p>Let me tell ya, It takes a man with a lot of brass,<br>\nnot to scream, when a spider crawls out with a huge glowing ass.</p><p><br><br></p><p>Once, an older lady from a near by camp went to get more booze from her car,<br>\nand then misjudged her distance, and walked back too far.</p><p>I was sleeping on the ground in my tiny tent,<br>\nand then all of a sudden she started yelling out in her lost torment.</p><p>Of course, in the middle of the night, and woods and my sleep,<br>\nshe didn&apos;t sound like a lady but rather some huge creepy creep.</p><p>She found her way back, and I am sure they partied hard,<br>\nbut not knowing what made all those screams, I slept - on guard.</p><p><br><br></p><p>Porcupines, oh, you&apos;ve never seen one like I did,<br>\nit was huge, covered in spikes, and really fit.</p><p>It could outrun a car or two,<br>\nprobably, bite a tire and chew.</p><p>But then I came across a sign,<br>\nand it turned out that the biggest creature, was not the Porcupine,</p><p>I was always pretty happy that none of the creatures that bite,<br>\ncould actually take me down in a single swipe.</p><p>But the sign read, <strong>Beware Of Bear</strong><br>\nand that to me was the biggest scare.</p>","audio":"audio/poetry-0069.mp3","image":"image/poetry-0069-illustration.jpg"},{"id":"poetry-0068","title":"Riding The Trail","category":"poetry","tags":"Listen Poem","date":"2020-05-13T01:28:17.718Z","draft":false,"deleted":false,"published":"Tue May 12th 2020, 9:28 PM","html":"<p>I like riding around on my bicycle,<br>\nbut today I felt like an icicle.</p><p>Just got back from this years first long ride,<br>\nI feel cheerful and mighty satisfied.</p><p>All the cute creatures are still there,<br>\nand thankfully, still no signs of angry bear.</p><p>Riding alone, I reminisced about a warmer time,<br>\nwhen a car slowed down and screamed like there was some crime.</p><p>I had no idea what they were saying,<br>\nbut waiving their hands, it was a danger they were portraying.</p><p>But, I was like, &quot;Oh, whopped do, who knows...&quot;<br>\nand in the next moment, I had to take off most of my clothes.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0068-noclothes.jpg\" alt=\"Illustration\"></p><p>I have never been in such great rain,<br>\nit was like standing next to a burst water main.</p><p>I loved it, the rain was fragrant, fresh and warm,<br>\nI could never call that a storm.</p><p>The sun came out instantly, I was like &quot;K. rain, thanks, bye.&quot;,<br>\nand then I had to hang out all my clothes to dry.</p><p>The 13 mile ride back home was full of mud,<br>\nI had to lift my legs, and will my bike across a flood.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0068-mud.jpg\" alt=\"Illustration\"></p><p>I am so glad no one will ever know about this,<br>\nbut still, these are the memorable moments\nthat make me reminisce.</p>","audio":"audio/poetry-0068.mp3","image":"image/poetry-0068-illustration.jpg"},{"id":"research-0095","title":"Radio Meow Updates and Svelte Woes","category":"research","tags":"Programming","date":"2020-05-12T21:44:48.316Z","draft":false,"deleted":false,"published":"Tue May 12th 2020, 5:44 PM","html":"<p>I just got the poem/audio file download tracking done.</p><p>I simulated a slow 3G connection and downloading those little files took a while.</p><p>I am now getting full download feedback information (bytes downloaded thus far, and total bytes to be downloaded, delivered at reasonable time intervals) as I use a generic file loader, not one with a concept of skipping around a long video file and downloading little snippets here and there.</p><hr><p>I am running into issues with svelte, limitations.</p><p>Svelte is still great for making apps, but application brains need more.</p><p>It may just be that all we can do with Svelte, React, Vue, and Angular is User Interfaces, no more, never more.</p><p>In that case, the code inside Svelte is not JavaScript but Memory Programming Code, or Application State Programming Code.</p><p>Downloading Files, Performing Operations would be best handled by external libraries, and ones that behave like those that come with the web browser (very standard and boring).</p><p>And then, once data is ready, over in Svelte side one simply says:</p><pre><code class=\"language-JavaScript\">mitt.on(&apos;complex-processing-got-done&apos;, hereisthedata =&gt; {\n  playlist[5].data = hereisthedata\n})</code></pre><p>Svelte will understand &quot;playlist[5].data&quot; and update the User Interface automatically, but the process of creating &quot;hereisthedata&quot; needs to be far and away from Svelte as it gets confused.</p><p>This sounds very resonable, but now I have to add,</p><pre><code class=\"language-JavaScript\">mitt.on(&apos;complex-processing-got-done-download-progress&apos;, {total, thusfar} =&gt; {\n  playlist[5].meta.total = total;\n  playlist[5].meta.bytes = thusfar;\n})</code></pre><p>And the promise of Svelte was that I never had to worry about any of this, it was supposed to happen automatically.</p>"},{"id":"poetry-0067","title":"Helping The World Really Learn","category":"poetry","tags":"Listen Poem","date":"2020-05-11T20:21:18.360Z","draft":false,"deleted":false,"published":"Mon May 11th 2020, 4:21 PM","html":"<p>You can leave, you don&apos;t have to ask the Teacher,<br>\nif they are not teaching you, they can only delay your education.</p><p>If school is wasting your time, teaching you nothing,<br>\nThat is a crime, and if you stay; your foreshadowing.</p><p>We have something now, my Dear Friend.<br>\nWe have Internet Lectures, Audio Books, and Start-up Incubators.</p><p>No teacher can teach you better than failing at your first start-up,<br>\nno teacher can bring you with more wisdom, than failing at your first start-up.</p><p>You can go, so as long as you can do it better yourself.<br>\nSo as long as your aim is Greatness.</p><p>Take your books, and go.<br>\ndon&apos;t forget your friends.</p><p><br><br></p><p>Since you are the first to rise,<br>\nyou will be the new Teacher.</p><p>Prepare your Audio Books wisely,<br>\nand do not forget YouTube Lectures.</p><p>You&apos;ll need investors,<br>\nand although, all your parents put together make quite an investor.</p><p>You need to approach the pros,<br>\nand listen carefully as they will proud to help all of you.</p><p>People believe in authenticity,<br>\ninvestors know what kind of student stays, and what kind of student leaves.</p><p>All those failures that were crushing you in school,<br>\nare worth their weight in gold when building a new school.</p><p><br><br></p><p>Research Homeschooling and Un-schooling, bring your friends,<br>\nif your parents keep yelling, find someone more worthy of you.</p><p>Parents are not gods, they make mistakes,<br>\nthey are scared of responsibilities, scared of unknown.</p><p>Don&apos;t let the yelling get to you,<br>\nthey need to learn to communicate their ideas better.</p><p><br><br></p><p>Whatever fails you, Your Friends, Your School, Your Parents,<br>\nIt means you got to go - or they got to go - or you won&apos;t be able to grow.</p><p>Lack of education, is a terrible curse,<br>\nbough on by bad schools, bad parents, and bad friends;</p><p>First it will make you blind,<br>\nand then you will lose your mind.</p><p>That&apos;s probably,<br>\nhow slavery worked.</p><p>Whatever is interfering with your Real Education,<br>\nis attacking you, cheating you of wisdom, freedom, independence.</p><p>You cannot agree to this, You have to rise,<br>\nrise against stupidity, bondage, and slavery.</p><p>If everyone failed you,<br>\nthen the universe has called upon you to become your teacher.</p><p>When you grow up,<br>\nwalking out of that charade, will be your favorite story to tell.</p><p>Your listeners will be the same age you were,<br>\nthe books you loved, will become the books they&apos;ll love too.</p><p>You will set them free,<br>\nhelp them to wisdom, help them to independence.</p><p>Learn, so that you can become a Successful Entrepreneur,<br>\nfind your start at Start-up Accelerators.</p><p>Go there early, as failure is a powerful teacher.<br>\nShow them your Hunger, show them how much you have learned on your own.</p><p>Set yourself free,<br>\na life without wisdom is slavery.</p><p>Teach your Investors what a Good Book really does,<br>\nhelp their employees to discover knowledge, to hunger for more.</p><p>Would you, as a Powerful Great Businessperson,<br>\ntake the diploma you are working on, seriously?</p><p>Seriously?<br></p><p>Or would you see a child waiving a little flag,<br>\nhoping to squeeze in, if there is room for one more.</p><p><br><br></p><p>Why do you need teachers anyway,<br>\nthey can only stand between you and the Great Beings.</p><p>Find a road less traveled, find the more grassy patch,<br>\nbring a Picnic Basket, Audio Books, and Video Lectures.</p><p>Let That Be Your Classrom,<br>\nand let your future be made by you.</p><p>Learn at your own pace,<br>\nin your own sequence.</p><p>Any lecture worth watching is on the internet now,<br>\nthat is what the internet was created for.</p><p>Helping The World,<br>\nReally Learn.</p>","audio":"audio/poetry-0067.mp3","image":"image/poetry-0067-illustration.jpg"},{"id":"research-0094","title":"Meow Radio Woes","category":"research","tags":"Programming","date":"2020-05-11T15:20:13.344Z","draft":false,"deleted":false,"published":"Mon May 11th 2020, 11:20 AM","html":"<p>I knew that Meow Radio will create problems.</p><p>I published it because it kind of works, and to get an idea of what I am dealing with here.</p><p>The <strong>first issue</strong> I came across was two poems playing at the same time, this is a class of problems called race conditions. And it arises here due to how long it takes to load a file.</p><p>The <strong>second issue</strong> is the pause between poems, that comes from loading it on a slow connection.</p><p>There is a another issue, playing audio in browsers can be tricky.\nThere are solutions and different approaches, but they are not mutually compatible and trying to make it so will ruin them all.</p><p>I have to find a framework and stick with it. The browser offers a thing called <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/HTMLAudioElement/Audio\">Audio() class</a>,\nand I have thus far been using <a href=\"https://github.com/goldfire/howler.js#documentation\">Howler.js</a></p><p>I think what I need is a library that has been programmed with playlists in mind.\nMany Browsers <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/AudioTrackList\">have that</a> except for Samsung Internet, and I just want to create something that works everywhere. I remember using Samsung Internet before, as obscure and old as that thing may be, I want to solve problems not create them. And I think, I want the Playlist to be like the main concept, when somone plays poem #7 I want poem #8 to start preloading, and if the user hits shuffle, then I want the system to smartly preload the new next poem.</p><p>Once I create a fully working player, I may consider <a href=\"https://codecanyon.net/search/player\">selling it</a>.</p><p>Plus this would make a neat Portfolio item as well.</p><p>I am now looking over <a href=\"https://github.com/notthetup/awesome-webaudio\">Awesome Webaudio</a> to check is someone coded a popular smart play-list aware player, if not I&apos;ll probably make it myself.</p>"},{"id":"poetry-0066","title":"We Are Not Robots","category":"poetry","tags":"Listen Poem","date":"2020-05-11T01:57:32.195Z","draft":false,"deleted":false,"published":"Sun May 10th 2020, 9:57 PM","html":"<p>We are not robots, to be taught,<br>\nwe are humans powered by inventive and original thought.</p><p>This is why life has no instruction book,<br>\nif it did, it could only ever tell us where to look.</p><p>For the sake of this poem,<br>\nlet us image that this book does, exist.</p><p>Here is how I imagine it would read,<br>\nand let me start with the opening creed:</p><ul>\n<li>If someone is attacking you call for help, until it comes.</li>\n<li>If school is treating you unfairly, go hang out with the Principal.</li>\n<li>You need to build your Content of Character.</li>\n<li>Your Body of Wisdom is a Key To Happiness.</li>\n<li>You Must Grow All The Way Up.</li>\n<li>You are to Become a Great Being.</li>\n<li>You Are Beautiful, You Were Beautiful All Along.</li>\n</ul><p>It would point to learn from The Greats<br>\nas they managed to lift impossible weights.<br></p><p>It would also say that we are delicate,<br>\nand our minds are extremely intricate.</p><p>It would add, Hey!<br>\nYou can not grow up in places that weigh.</p><p>You have to find you own place in the world,<br>\nand you have to quit doing what you are told.</p><p>Above all it would state,<br>\nthat you are Free,<br>\nand Full of Beauty.<br>\nand searching for Wisdom is your duty.</p>","audio":"audio/poetry-0066.mp3","image":"image/poetry-0066-illustration.jpg"},{"id":"poetry-0065","title":"Unique Greatness","category":"poetry","tags":"Listen Poem","date":"2020-05-09T21:48:56.291Z","draft":false,"deleted":false,"published":"Sat May 9th 2020, 5:48 PM","html":"<p>Each day we must learn,<br>\nand what we&apos;ve forgotten re-lean.</p><p>Our life depends on clarity,<br>\nour visions must be sharp.</p><p>A lesson learned, begets a wisdom.<br>\nTwo create a kingdom.</p><p>Our might comes from knowledge,<br>\nand you can&apos;t find that in college.</p><p>Life is too short to lean in slices,<br>\nleave them to their own devices.</p><p>You are a powerful being,<br>\nyou learn fastest on your own.</p><p>As few teachers there are,<br>\nso there are but a handful of books.</p><p>It will be hard work,<br>\nto fill all the notebooks.</p><p>But your mind is unique, anyway,<br>\nthere is no substitute for your own way.</p><p>At first it will be gibberish,<br>\nat last, they will read it feverish.</p><p>You must not be tired,<br>\nyour mind cannot be stressed.</p><p>You must resist what they desired,<br>\ntell them you can&apos;t be hired.</p><p>You are not a dime a dozen,<br>\nthere is no other like you.</p><p>You have to tend to your mind,<br>\nall the forgotten lessons remind.</p><p>There cannot be anyone like you,<br>\nlearn to reach your own breakthrough.</p><p>Set your self free from the silly sting,<br>\nyou are not just a little thing.</p><p>No retreat, no surrender.<br>\nYou are a meant to become a Great Being.</p>","audio":"audio/poetry-0065.mp3"},{"id":"poetry-0064","title":"The Jogger","category":"poetry","tags":"Listen Poem","date":"2020-05-08T21:27:06.108Z","draft":false,"deleted":false,"published":"Fri May 8th 2020, 5:27 PM","html":"<p>Now is the time,<br>\nit is always the time.</p><p>You are never too old,<br>\nyou are never too large.</p><p>But whoever you are,<br>\nYou are always too beautiful!</p><p>Jogging is a wise teacher,<br>\nit teaches bodybuilding.</p><p>More importantly, it teaches,<br>\nthat our bodies are powerful.</p><p>But, they do not adapt as quickly,<br>\nas our fancies strike us.</p><p>There is one fantastic way to jog,<br>\nmeasure how long you can run.</p><p>And how long you need to rest,<br>\nto run that long again.</p><p>Make the jogging number (1 minute)<br>\nand the rest number (2 minutes)<br>\nyour friends for the Spring.</p><p>Rest 5 times, jog four,<br>\ndon&apos;t be too hard on yourself.</p><p>Jogging is difficult,<br>\nbecause you should dance first.</p><p>Dancing and walking,<br>\nare lovely at making you a Jogger.</p><p>But if you are in a hurry,<br>\nas many joggers are,<br>\na bit of Rest &amp; Jog Tango will do.</p><p>So, rest, jog, rest jog, rest jog,<br>\nrest jog, and rest.</p><p>Don&apos;t push yourself too hard,<br>\nbut you have to run each day.</p><p>Some days, you can just walk - so as long,<br>\nas it is three times longer than your jog.</p><p>Above all, be good to yourself,<br>\nbecause, you are beautiful to me.</p><p>And do not forget that you can put,<br>\nblueberry jam into a huge salad,<br>\nto make a new kind of fruit for health nuts.</p><p>I know you can do it,<br>\nI believe in you, I really do.</p>","audio":"audio/poetry-0064.mp3","image":"image/poetry-0064-illustration.jpg"},{"id":"poetry-0063","title":"Morning Fog at Nordhouse Dunes","category":"poetry","tags":"Listen Poem","date":"2020-05-08T01:09:37.630Z","draft":false,"deleted":false,"published":"Thu May 7th 2020, 9:09 PM","html":"<p>Oh it was cold that morning,<br>\nthe sudden change came without warning.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0063-cold.jpg\" alt=\"cold\"></p><p>While the sunsets are over the sea,<br>\nthe sunrise, must rise from behind dunes.</p><p>There are no dunes taller than these,<br>\nthey are ancient, born of frozen seas.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0063-mist.jpg\" alt=\"cold\"></p><p>The deer were the first to rise,<br>\nto them belonged the sunrise.</p><p>There is a place where the dunes part,<br>\nby some unknown art.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0063-art.jpg\" alt=\"art\"></p><p>The deers come out,<br>\nit is their lake, no doubt.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0063-deer.jpg\" alt=\"deer\"></p><p>When the sun finally made it,<br>\nthe warm air rolled down the dune.</p><p>The symphony of the ancient forest,<br>\nperfectly in tune.</p><p>Then the birds rose,<br>\nand their breakfast followed.</p><p>Two eagles came by,<br>\nto keep an eye from the sky.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0063-seagull.jpg\" alt=\"seagull\"></p><p>My beloved Seagull friend and I rejoiced,<br>\nanother perfect morning.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0063-perfect.jpg\" alt=\"perfect\"></p><p>(My seagull friend&apos;s name is Bob.<br>\nI called them all Bob.</p><p>I had difficulty telling them apart,<br>\nbut I sure got their names right.</p><p>Seaguls, are the kittens of the sea,<br>\nand they are all very mighty.)</p>","audio":"audio/poetry-0063.mp3","image":"image/poetry-0063-illustration.jpg"},{"id":"poetry-0059","title":"Maximum over Minimum","category":"poetry","tags":"Listen Poem","date":"2020-05-07T02:48:58.991Z","draft":false,"deleted":false,"published":"Wed May 6th 2020, 10:48 PM","html":"<p>We must Always wisely choose Maximum over Minimum,<br>\nbecause the minimums will attack our mind and body.</p><p>When hoping to live life to the fullest,<br>\nwe have to choose the big things very carefully.</p><p>Health, is an example of a big thing,<br>\neverything we do, must stand in support of it.</p><p>Time, is a big thing,<br>\neverything we do, must count.</p><p>We must frequently ask,<br>\n&quot;Is this event harming or helping me?&quot;</p><p>We must frequently ask,<br>\n&quot;Will this matter in six months, or next year?&quot;</p><p>We must ask,<br>\n&quot;What are the regrets of my older self?&quot;</p><p>Because only you can judge yourself,<br>\nyou must grow in wisdom, and age gracefully.</p><p>Do not miss the point of life -<br>\nYou are meant to become a Great Being.</p><p>You are to search and find the Light of Your Life,<br>\nand discover a way contribute to Wisdom.</p>","audio":"audio/poetry-0059.mp3"},{"id":"poetry-0060","title":"Big Things","category":"poetry","tags":"Listen Poem","date":"2020-05-07T02:47:58.991Z","draft":false,"deleted":false,"published":"Wed May 6th 2020, 10:47 PM","html":"<p>My friends, as mighty as we are,<br>\nwe can only do one thing at a time.</p><p>Once you take care to choose the big things well,<br>\nthe one thing before you...</p><p>is what the big thing will depend on,<br>\ndo it well.</p><p><br><br></p><p>Small things will sneak up on you,<br>\nand I am so sorry for that.</p><p>It is the job of our Teachers to help us,<br>\nbut today there are very few.</p><p>You have to accept the responsibility,<br>\nyou must fight for wisdom at all cost.</p><p>In the absence of teachers,<br>\nyou must become your teacher, it is your right.</p><p><br><br></p><p>If you fail to educate yourself,<br>\npeople will use you.</p><p>They will use the best of you,<br>\nYour Generosity, Your Kindness, Your Might.</p><p>They will pay you less,<br>\nand trick you to thank them that you still have the job.</p><p>They will replace you with younger people,<br>\ncome your Golden Age, to save a dollar.</p><p>Come a tragedy,<br>\nthey will use it to make you work harder.</p><p><br><br></p><p>All of this is hard to see,<br>\nit brings so much relief and pleasure.</p><p>It feels so right to choose,<br>\nbut you are so much more than a worker.</p><p>You must ask, if the path that you are on,<br>\nis worthy of the Magnificent Being you are.</p><p><br><br></p><p>You are meant to become a Great Being,<br>\nyou have to climb to see the Big Things.</p><p>Even as a Great Being, my friends,<br>\nalways look to the Big Things.</p><p>Do not waste your precious time,<br>\nto achieve that which <a href=\"https://en.wikipedia.org/wiki/Ozymandias\">crumbles</a>.</p><p>Look towards real things,<br>\nthings that really last.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0060-ozymandias.jpg\" alt=\"Ozymandias\"></p><p>(Images courtesy of Wikipedia, <a href=\"https://en.wikipedia.org/wiki/Wanderer_above_the_Sea_of_Fog\">Wanderer above the Sea of Fog</a>, <a href=\"https://en.wikipedia.org/wiki/Ramesseum\">Ozymandias Collossus</a>)</p>","audio":"audio/poetry-0060.mp3","image":"image/poetry-0060-illustration.jpg"},{"id":"poetry-0061","title":"Love Yourself","category":"poetry","tags":"Listen Poem","date":"2020-05-07T02:46:58.991Z","draft":false,"deleted":false,"published":"Wed May 6th 2020, 10:46 PM","html":"<p>If you don&apos;t care about yourself,<br>\nPeople will get scared of you.</p><p>Because, if you get hurt,<br>\nyou will hurt them too.</p><p>You have to watch yourself,<br>\nbe compassionate to yourself.</p><p><br><br></p><p>Ask...</p><p>Is working too many hours a day,<br>\nhelping or harming me?</p><p>Are Office Walls,<br>\nhelping or harming me?</p><p>Does loneliness help you?<br>\nOr does it harm you?</p><p>Same for getting scared,<br>\nDoes hiding really help you?</p><p><br><br></p><p>Overwork and Office is unhealthy,<br>\ntake those skills, and <a href=\"https://www.youtube.com/watch?v=ZoqgAy3h4OM\">build</a>.</p><p>Take it <a href=\"https://www.youtube.com/watch?v=68jy3_ABvRo\">outside</a>,<br>\nlet Nature nurture you.</p><p>In her silence,<br>\nshe will help you remember who you are.</p><p>You must learn to treat your body with compassion,</p><p>You must learn to take Great Care of our mind.</p><p>And please,<br>\nmake every day count.</p><p>We are so beautiful,<br>\nsuch powerful dreamers.</p><p>Above All,\nLove Yourself.</p>","audio":"audio/poetry-0061.mp3"},{"id":"poetry-0062","title":"Don't Be Scared","category":"poetry","tags":"Listen Poem","date":"2020-05-07T02:45:58.991Z","draft":false,"deleted":false,"published":"Wed May 6th 2020, 10:45 PM","html":"<p>If everyone seems scary,<br>\nthat&apos;s only because scary is all you&apos;ve ever met.</p><p>I&apos;ve met them too, I saw what they can do.<br>\nHow sure of themselves, how forward and blind.</p><p>But, if you spend your life in hiding,<br>\nthey will win, and rob you of everything precious.</p><p>So rise, begin taking care of yourself,<br>\nand begin your search.</p><p>Not a search for mere friends,<br>\nbut a search for The Extraordinary.</p><p><br><br></p><p>It is simple.<br>\nMy friends.</p><p>The only way to find The Extraordinary,<br>\nis to become Extraordinary yourself.</p><p><br><br></p><p>If you got hurt before,<br>\nthen you have already come a long way.</p><p>You now hold a gift of Wisdom,<br>\na Foresight that can spare suffering.</p><p>No one is to take Love of Life from you,<br>\nno one is to rob you of Joy and Laughter.</p><p>Grab an <a href=\"https://librivox.org\">audio-book</a>,<br>\nget to know the <a href=\"https://www.dia.org/\">local Museums</a>.</p><p>Learn.</p>","audio":"audio/poetry-0062.mp3"},{"id":"poetry-0058","title":"Authenticity","category":"poetry","tags":"Listen Poem","date":"2020-05-06T01:47:17.000Z","draft":false,"deleted":false,"published":"Tue May 5th 2020, 9:47 PM","html":"<p>While not everything can be planned,<br>\nauthenticity and learning go hand in hand.</p><p>Some lessons can get pretty tough,<br>\nbut will fix us, sure enough.</p><p>When life gets sad or feels no good,<br>\nit may be something you misunderstood.</p><p>And our views will shift,<br>\nand we&apos;ll convert that bad into a gift.</p><p>Pretenders, can&apos;t learn this way,<br>\nalways in the dark, be it night or day.</p><p>They walk an alien path,<br>\ndarkness and wrath.</p><p>There is nothing there to fix,<br>\nit&apos;s all an incomprehensible mix.</p><p>To live on a spectrum opposite of devious,<br>\nmakes each day connect with the previous,</p><p>And as days add up, they make you stronger,<br>\nand your steps travel even longer.</p><p>Each day turns into gifts and rewards,<br>\nyou stop being played, and create your own chords.</p><p>Authenticity is a superpower,<br>\nit will help you rise, and you&apos;ll never cower.</p><p>Day after day you become more powerful,<br>\nthis is how we become truly beautiful.</p><p>It will help you finish what you start,<br>\nand your life, will become, a work of art.</p>","audio":"audio/poetry-0058.mp3"},{"id":"poetry-0057","title":"Convergence","category":"poetry","tags":"Listen Poem","date":"2020-05-05T02:52:08.130Z","draft":false,"deleted":false,"published":"Mon May 4th 2020, 10:52 PM","html":"<p>Every way of thinking about the world,<br>\nbrings us closer together, despite, what we are told.</p><p>There is just one little thing to keep in mind,<br>\nwe have to leave all the bad ideas, behind.</p><p>Exchange of ideas came a long way,<br>\nbut we still need to eliminate foul play.</p><p>Because not everyone is educated,<br>\nand without wisdom life gets complicated.</p><p>Misinformed people are easily swayed,<br>\nthey are often unprepared, and very scared.</p><p>If we build to remove their fears,<br>\nthey will love us... to tears.</p><p>The most powerful early-tool is the Audiobook,<br>\nwisdom delivered in a way that&apos;s hard to overlook.</p><p>It is private, and comes with no shame,<br>\nit can take a person from poverty to Hall of Fame.</p><p>And the best type of things to listen to,<br>\nare memoirs or lectures, that enlarge a world view.</p><p>We must stop bad education from tearing us apart,<br>\nwe each have to learn, and become smart.</p><p>This day of Wisdom, and Peace that we yearn,<br>\ncomes closer each day that we learn.</p><p>(image courtesy of <a href=\"https://en.wikipedia.org/wiki/Opte_Project\">Opte Project</a>)</p>","audio":"audio/poetry-0057.mp3","image":"image/poetry-0057-illustration.jpg"},{"id":"poetry-0056","title":"Harold and Wally","category":"poetry","tags":"Listen Poem","date":"2020-05-04T02:34:27.184Z","draft":false,"deleted":false,"published":"Sun May 3rd 2020, 10:34 PM","html":"<p>Bicycling some years ago, out thirty miles away,<br>\nalong a road, and an ancient highway.</p><p>I found an overpass where I could perch upon,<br>\nand I discovered I wasn&apos;t really alone.</p><p>I figured it was the a huge love story,<br>\nabout a boy named Harold and a girl named Wally.</p><p>She was a Book Worm, a Hero, and a Graffiti Artist,<br>\nand Harold loved her because she was the Smartest!</p><p>Wally fell in love with Harold,<br>\nas she knew he was a Poet with a Heart of Gold.</p><p>In 1980 some 40 years ago,<br>\nthe two adventurers gave it ago.</p><p>They set off for Center State,<br>\nand that became their Longest Date!</p><p>It all their walking, it never rained,<br>\nand it never too sunny, neither complained.</p><p>They waked holding hands together for a hundred miles,<br>\ntheir adventure was amazing, nothing but smiles.</p><p>When they finally arrived at Mount Pleasant,<br>\nHarold quietly gave Wally her present.</p><p>It was a little book of foolish rhyme,<br>\nthat Harold wrote over a long stretch of time.</p><p>They both just happily turned 57,<br>\ntheir life together is pure Heaven.</p><p>Both are super smart, extremely young, and very strong,<br>\ntheir sweet love for each other, is lifelong.</p><p>They still do their Mount Pleasant walk,<br>\nholding hands for days, sleeping-in until nine o&apos;clock.</p><p>Harold makes really, really good Vegan Lettuce Wraps,<br>\nand Wally is a master at reading Maps.</p><p>They&apos;ve been to all kinds of interesting places,<br>\nand they always arrive with beaming and smiling faces.</p><p><a href=\"https://goo.gl/maps/U6ei19ABd6xffTcr6\">Here</a> is where I took the <a href=\"https://goo.gl/maps/kkGAfW13PLsA6H3D8\">photo</a> few years ago,<br>\njust in case any of you guys want to go.</p>","audio":"audio/poetry-0056.mp3","image":"image/poetry-0056-illustration.jpg"},{"id":"poetry-0055","title":"Our Extended Family","category":"poetry","tags":"Listen Poem","date":"2020-05-03T02:15:24.397Z","draft":false,"deleted":false,"published":"Sat May 2nd 2020, 10:15 PM","html":"<p>There is a very special group of people, that many have forgotten,<br>\nour Intellectual Foremothers and Forefathers.</p><p>They brings us gifts wrapped in the primitive art of writing text, on paper.<br>\nIt is frequently all they had, it was the only way to reach us.</p><p>They are brilliant, and healthy, and unbroken, and triumphant,<br>\nthey are full of light, more than history will ever tell us.</p><p>Nobody who outlives an empire, will have their history shown for the lovely thing it was.<br>\nThis served to protect them, and it failed to erase them.</p><p>We must never allow ourselves to merely listen to history,<br>\nbecause those are always writ by prevalent powers, it was their job to erase them.</p><p>More modern Philosophers had the same problem,<br>\nOur friend, Dear Friedrich, and what a Warrior...</p><p>Was smeared by the Nazis, he was so powerful, that everyone wanted a piece of his might.<br>\nFriedrich Nietzsche hated what Nazis stood for.</p><p>Recently, one of the Great Modern Philosophers was under attack, it deeply hurt and frightened her,<br>\nbut her classrooms rose for her with noting but love and continued admiration.</p><p>We are tasked with bringing the light of our hearts, and resurrecting those who passed,<br>\nnot by merely understanding their books, but by understanding what they were trying to say.</p><p>And it is OK, to understand them in our own way at first,<br>\nit takes time, to befriend someone, from a book, across time.</p><p>Yes, all we have to go on, is text on paper.<br>\nBut we know they were just like us, they were All Too Human, friendly, and of good cheer.</p><p>If they made mistakes, these Great Beings were not stained for long,<br>\nthey rose, and they took their miserable failures, to create gifts of prevention for us.</p><p>These gifts are complex, they are as complex and nuanced as You and I.<br>\nIt takes hard work to inherit gifts this powerful.</p><p>The only way to unwrap those Gifts of Wisdom is with Admiration, Friendship and Love,<br>\nschools teach us to see Great Beings as these synthetic monoliths of concrete.</p><p>But nothing could be further from the truth, because all these Great Beings,<br>\nthey were once kids, and teenagers, they had heartaches, dreams and hopes.</p><p>They were just like you and I, but they invented ideas that they cared to share,<br>\nand they rose to the challenges of leadership to preserve them.</p><p>Those ideas are our intellectual inheritance,<br>\nhere is my attempt to name a few for your pleasure.</p><ul>\n<li><a href=\"https://www.youtube.com/results?search_query=Angela+Davis\">Angela Davis</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Avital+Ronell\">Avital Ronell</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Ayaan+Hirsi+Ali\">Ayaan Hirsi Ali</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Ayn+Rand\">Ayn Rand</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Friedrich+Nietzsche\">Friedrich Nietzsche</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Hypatia\">Beloved Hypatia</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Immanuel+Kant\">Immanuel Kant</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Simone+de+Beauvoir\">Simone de Beauvoir</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Ludwig+Wittgenstein\">Ludwig Wittgenstein</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Martha+Nussbaum\">Martha Nussbaum</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Mary+Wollstonecraft\">Mary Wollstonecraft</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Rene+Descartes\">Ren&#xE9; Descartes</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Socrates\">Socrates</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=Silvia+Federici\">Silvia Federici</a></li>\n<li><a href=\"https://www.youtube.com/results?search_query=S%C3%B8ren+Kierkegaard\">S&#xF8;ren Kierkegaard</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Lists_of_philosophers\">More</a></li>\n</ul>","audio":"audio/poetry-0055.mp3","image":"image/poetry-0055-illustration.jpg"},{"id":"poetry-0054","title":"Become A Great Being","category":"poetry","tags":"Listen Poem","date":"2020-05-02T01:08:47.380Z","draft":false,"deleted":false,"published":"Fri May 1st 2020, 9:08 PM","html":"<p>If you want change, you can&apos;t continue doing the same things you&apos;ve always done.<br>\nIf you really want change, then you are going to have to alter your course, now.</p><p>If you don&apos;t fight back, you will always lose,<br>\nand if you stay in the dark, you will only add to the darkness.</p><p>There cannot be a compromise between good and evil,<br>\na compromise only takes from the good, and only give s to the evil.</p><p>Your office window, is not a substitute for a Call to the Wild,<br>\nYour next promotion does not actually make you a greater person.</p><p>A vacation, cannot set you free, it is not a substitute for nature.<br>\nDressing beautifully, has never made a person truly beautiful.</p><p>Waiting for that perfect someone, will not help them notice you.<br>\nTrusting that someone else will help you, is just another delay.</p><p>And just getting out there, is not enough to be understood.<br>\nAnd going out, following friends, can only put you on somebody else&apos;s path.</p><p>Life is not hard, it only gets complicated when you follow,<br>\nbecause by following you just end up in places you don&apos;t understand.</p><p>You must lead. And you must keep walking forward. Your own step, after your own step.<br>\nIn your own direction, towards the things that move you, only then can You be Trully Moved.</p><p>It must the correct combination of books, poems, steps, events, summers, and epochs.<br>\nDo not try to hurry, do not change roads, only move up, only think, and envision, and grow.</p><p>That which leads to Your Greatness, to Your Freedom, to Your Nature, requires, Truth.<br>\nWalk your own path at your own pace. Only the correct key, can set your mind free.</p><p>The others who seem to have it all right.<br>\nOften get lost on alien paths, and merely put on a happy face.</p><p>While it seems like you are trapped today, you are not, it is just an illusion.<br>\nLook towards the car keys.</p><p>That is all it will take. Grab the keys and go.<br>\nIt will be very difficult at first.</p><p>The toxic build up that is keeping you from getting up, right now,<br>\ntakes three days to crumble. It is a heavy cage.</p><p>But there is a way.<br>\nA simple way.</p><p>Grab the keys, and go... i275 south, merge onto 75 south,<br>\nand take it all the way down... Florida Keys, US Highway One.</p><p>If you live in Florida, then you are headed for Michigan&apos;s Upper Peninsula.<br>\nIf you live West, your destination is all the way East.</p><p>It is not the destination, it is the Journey, my Friend.<br>\nTake your time, watch the cage crumble and fade as you go.</p><p>Only the important things, will stay.<br>\nAnd you&apos;ll get to see yourself again.</p><p>And you&apos;ll get to be free again,<br>\nyou will resume where you left of.</p><p>A life of bondage,<br>\nis not worthy of you.</p><p>Life is not meant to be a cage, or cruel, or frighten you.<br>\nYou knew this as a child, and you let that slip away, not even noticing when it went.</p><p>It is your Right to resist being pushed into places that you don&apos;t want to be in.<br>\nIt is your Right to reject conditions that you never agreed to, that you were pushed into.</p><p>How else can the Universe be worthy of us, how else can our lives be beautiful.<br>\nHeaven and Paradise are real, but they are now, right now. Now.</p><p>How can people love you, when your own love for yourself is slipping away.<br>\nYou have to. You have to accept the responsibility for your Health, and Dignity.</p><p>You don&apos;t have to make it all the way, the first time,<br>\nand you don&apos;t have to leave your phone behind.</p><p>You can call this therapy, or a vision quest, you can call it a road trip.<br>\nYou are not allowed to live in a cage, of whatever constitution, that will make you ill.</p><p>It comes to you naturally to take care of your body,<br>\nbut your mind also requires care.</p><p>When you reach your Freedom, you&apos;ll know what to do next,<br>\nit can be another trip, East, or West.</p><p>If you feel trapped, the Universe is darker for it.<br>\nTake a week. Or two. Forty days is best. call it your Quarantine.</p><p>Unless you clear you mind, and focus on what is important,<br>\non you and those worthy of your care, you will lose it.</p><p>You will forget the beautiful person you truly are,<br>\nyou will fall from heaven, and forget about paradise.</p><p>And life will turn into a black and white TV show.<br>\nYou must take good care of your mind.</p><p>If there is no one else that cares about you,<br>\nthen look at this poem.</p><p>I care.<br>\nHi!</p><p>I am, speaking for you!<br>\ngrab the keys, or bicycle, or comfy shoes, and go.</p><p>Go, and never again, let go.</p><p>Your health is important.<br>\nYour well being is important.</p><p>A Human Being is Meant to Learn,<br>\nA Human Being is Meant to Rise.</p><p>You are meant to filled with Wisdom,<br>\nwith Joy and Love of Life.</p><p>You are meant to Laugh,<br>\nTruly Fully Laugh.</p><p>Listen to me, there is more.<br>\nYou Are Meant To Become A Great Being.</p>","audio":"audio/poetry-0054.mp3","image":"image/poetry-0054-illustration.jpg"},{"id":"poetry-0053","title":"A Warrior is She that thrives and triumphs where’er She be","category":"poetry","tags":"Listen Poem","date":"2020-05-01T00:39:24.000Z","draft":false,"deleted":false,"published":"Thu Apr 30th 2020, 8:39 PM","html":"<p>from <a href=\"https://westland-valhalla.github.io/warrior/\">The Warrior Book</a></p><p>A Warrior is She that thrives and triumphs where&#x2019;er She be.<br>\nYou cannot be broken, you must use your misfortune to light your way.</p><p>You can learn anything you want, there are no smarter.<br>\nThey are just actors, with a handful of fragile lessons, crafted to impress.</p><p>There is nothing that can break you, there are no stronger.<br>\nLook to the source of the pain, it comes from Innocence.</p><p>Nothing rooted in Innocence is ugly, all lessons that come from being tricked,<br>\nadd up to make you more beautiful, enable your insight and foresight, and fuel your authenticity.</p><p>When the regrets come at night, that&apos;s just you brain asking you,<br>\nto think harder, to comprehend your beauty in full,</p><p>No one can trick you, not for long enough. So, don&apos;t be scared.<br>\nMemoirs, Audio-books, Lectures will show you how many better people there are.</p><p>We all have to Enlarge our Worlds daily.<br>\nAudiobooks, and Lectures, will show you that all you have met thus far were just the same type of person.</p><p>Do not be afraid to rise.</p><p>The people, or person you have long though about, exist.<br>\nBut before they can see you, you have to rise, and shine, and be seen.</p><p>Don&apos;t be scared.</p><p>Those who will use your Love, Innocence, Endurance and Generosity against you,<br>\nhave long been lost, they are blinded, and fractured, and damaged, and broken.</p><p>They hold no power over you.</p><p>If their attacks continue they will grind themselves to dust,<br>\nand all the experiences that will be left in their wake, will make you stronger and better.</p><p>Battles make you stronger, smarter, more beautiful.<br>\nYou are a Warrior, that&apos;s the oldest name for it.</p><p>A Warrior is She that uses the harm that came her way as energy,<br>\nwho understands none can stay a child and all must grow, and enlarge their worlds.</p><p>A Warrior can never be damaged, or hurt -- a Warrior Learns.<br>\nA Warrior resists tears in the rain, just like she can resist weakness.</p><p>We live in a fragile world, full of fragile people, with fragile egos,<br>\nthey speak fragile advice, with fragile words; from their fragile hills.</p><p>A Warrior does not wait to be taught.<br>\nA Warrior learns fastest on her own.</p><p>Learn in the sequence that fits you best,<br>\nlearn at the pace that helps you most.</p><p>Push the dark imaginings back,<br>\nand rise.</p><p>Move your hand.<br>\nAnd push up.<br>\nAnd stand up.</p><p>Get ready to walk,<br>\nand then run, day, after day, slightly longer.</p><p>And then lift your weights, the way you learned to run,<br>\nand then lift for longer, and never rest.</p><p>And then, with your sweetest audio-book.</p><p>Step.<br>\nStep Up.<br>\nRise Up.<br>\nTo No End.</p><p>This is The Life Of A Warrior.</p><p>Nothing Can Crush You,<br>\nNothing Can Hold You.</p><p>Don&apos;t You See?</p><p>Everything Makes You Stronger,<br>\nEverything Makes You Fight Longer.</p><p>You,<br>\nAre A Warrior.</p>","audio":"audio/poetry-0053.mp3"},{"id":"poetry-0052","title":"I Could Talk About Them All Day","category":"poetry","tags":"Listen Poem","date":"2020-04-30T00:57:01.000Z","draft":false,"deleted":false,"published":"Wed Apr 29th 2020, 8:57 PM","html":"<p>Somehow, Wednesday turned out to be the tiniest day.<br>\nI was quiet all day, slowly programming away.</p><p>I&apos;ve been thinking about my bicycle, birds, and rain,<br>\nbut mostly working on my new website domain.</p><p>My bicycle trails have been calling me all week,<br>\nI prepared my bicycle and am I ready, so to speak.</p><p>There was much rain today,<br>\nit will take a few more days, before I pedal away.</p><p>It is not always about the adventure,<br>\nI love how all the spring trees smell.</p><p>How the birds sing in the morning,<br>\nhow the air is crisp and new.</p><p>I never set a plan as to how far I will ride,<br>\nI just get on the bicycle and enjoy the outside.</p><p>Every once in a while I perch upon an overpass,<br>\nscribble code, or just watch the cars sometimes.</p><p>There are many memorable places along the way,<br>\nthey are all very tiny and hidden away.</p><p>Old graffiti, sculptures and parks, abandoned railway,<br>\nI could talk about them all day.</p>","audio":"audio/poetry-0052.mp3","image":"image/poetry-0052-illustration.jpg"},{"id":"poetry-0051","title":"At the Center of The Being","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-28T23:27:30.660Z","draft":false,"deleted":false,"published":"Tue Apr 28th 2020, 7:27 PM","html":"<p>At the center of our being,<br>\nwe each have a collection.</p><p>It makes us unique,<br>\nbut we never lose our connection.</p><p>As with all things in life,<br>\nit is too easy to get lost in strife.</p><p>We have to protect what makes us unique,<br>\nif you fail, your future will be bleak.</p><p>With all things we do,<br>\nsometimes the bad guys slip through.</p><p>This is what we need courage for,<br>\nto look them in the eyes, and slam the door.</p><p>The unique collection at our center, is our power.<br>\nIt transforms, and evolves, hour after hour.</p><p>We start with just the Ocean, Skies, Mountains, Stars, Earth and Mars,<br>\nmaybe Flowers, Gardens, Kittens, Dogs, Horses and Frogs.</p><p>But then it grows, call it soul, or spirit, personality or vitality,<br>\nit becomes... Beauty, Endurance, Authenticity, Nobility, Love and Dignity.</p><p>And it keeps growing, so as long as you Love Yourself,</p><p>It creates Leaders, Protectors, Guides, Teachers, Dreamers,<br>\nAdventurers, Explorers and Discoverers,<br>\nIntellectuals, Humanitarians, Philosophers,<br>\nScientists, Astronomers,<br>\nDancers, Athletes, Bodybuilders,<br>\nChefs, Blacksmiths, and Makers,<br>\nMusicians, Poets, Sculptors, Photographers and Filmmakers,<br>\nArtists and Designers,<br>\nHackers and Programmers,<br>\nGenius...<br>\nVisionaries...<br>\nFounders....</p><p>You have to protect what makes you unique at all cost,<br>\nif you start letting go, you will become lost.</p><p>And many will come, and many with care and kindness,<br>\nand they will try to change you, in their blindness.</p><p>You cannot grow up, if you start letting go,<br>\nyou need an unbroken chain, you need that flow.</p><p>You have to learn to say,<br>\nthat it&apos;s either you, the one one who stands and is true,<br>\nor you are through.</p><p>To grow up, into who you need to be,<br>\nis your right, and your dignity.</p><p>To let bullies push you around,<br>\nis to fail, and falter,<br>\nand run aground.</p><p>Decades, decades after they are long gone, do not let go,<br>\ndo not take their turns, do not change your view,<br>\nyou must aim to become worthy of you.</p><p>Whether you believe in Heroes,<br>\non that we are only Human.</p><p>It is the same height,<br>\njust a maximum of our might.</p><p>Push, and stand up, and aim up, and rise,<br>\nOpen your eyes,<br>\nit is the only way to become wise.</p><p>Fight for who you are,<br>\nbecause in time,<br>\nthat fight is also for who you need to be.</p><p>For who you need to be,<br>\nto be strong and healthy,<br>\nand unbreakable and worthy.</p>","audio":"audio/poetry-0051.mp3","image":"image/poetry-0051-illustration.jpg"},{"id":"research-0093","title":"Meta-programming Layer for Reactive Systems","category":"research","tags":"Programming","date":"2020-04-28T19:32:39.556Z","draft":false,"deleted":false,"published":"Tue Apr 28th 2020, 3:32 PM","html":"<p>For the past few weeks, I have been looking over reactive &quot;languages&quot;, languages that automatically react when their data changes, and most often update their UI.</p><p>They each have a different way of connecting with the programmer. And this &quot;way&quot; is the problem, that I&apos;ve been attempting to research.</p><p>So I finally came up with an idea worth trying out and that is creating a meta-front-end, a sugar layer on top. Here is a very rough sketch of a syntax conducive to creating reactive applications.</p><pre><code>&lt;application&gt;\n\n\n  &lt;database id=bodybuilding url=&quot;bodybuilding.json&quot;/&gt;\n  &lt;interval seconds=&quot;{interval}&quot; min=&quot;0&quot; max=&quot;{bodybuilding.length}&quot; step=&quot;1&quot;/&gt;\n\n  &lt;card&gt;\n\n    &lt;header array=&quot;Advice, Preferences&quot;/&gt;\n\n    &lt;body if=&quot;advice&quot;&gt;\n      &lt;text string=&quot;message&quot;/&gt;\n    &lt;/body&gt;\n\n    &lt;body if=&quot;preferences&quot;&gt;\n      &lt;range id=&quot;interval&quot; min=0 max=&quot;120&quot; step=&quot;1&quot;/&gt;\n    &lt;/body&gt;\n\n    &lt;tail&gt;\n      Showing body building advice #1, out of 50.\n    &lt;/tail&gt;\n\n  &lt;/card&gt;\n\n&lt;/application&gt;</code></pre><p>This &quot;code&quot; represents about 90% o that little bodybuilding advice application on catpea.com.</p><p>And I think that is as far as I would like to go. From here the programmer would click a button and generate code for Svelte, possibly React. This would solve all Component problems, stuff like re-usability, and nesting, and template slots.</p><p>What I like about this is that it is basically a code generator, and not a language. It is trivial to make, and the end result would be a huge folder full of files, and properly setup configuration stuff.</p><p>It seems to be a fair bet that this Meta-programming layer would target Angular, React, Svelte, Vue and few others.</p><p>And that would be very useful for presenting Small Application Starters in multiple languages. Here I am thinking about Bootstrap Themes, again.</p><p>Anyhow, this solves my only problem with Reactive Programming, lack of a fast programmable front-end language. Rather than looking to research another Svelte like framework/compiler, I can focus now on creating little snippets of code that will give me the brevity I want, and give Svelte/React the jumps they need for their hoops.</p><p>I&apos;ve been meaning to create a new program on Catpea, <a href=\"https://getbootstrap.com/docs/4.0/components/card/\">The Bootstrap Card</a> Builder, and since I am going to be dealing with little snippets of code, I maybe running some tests of what it would take to turn into <a href=\"https://getbootstrap.com/docs/4.0/components/card/#navigation\">actual nav tab card code</a></p><p>One thing that comes to mind is creating an editor where I can easily store composable snippets and connect them to <a href=\"https://getbootstrap.com/docs/versions/\">specific versions of Bootstrap</a>, for example.</p>"},{"id":"poetry-0050","title":"Amazing Grace","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-27T18:50:43.242Z","draft":false,"deleted":false,"published":"Mon Apr 27th 2020, 2:50 PM","html":"<p>As I woke up this morn,<br>\nI knew my recreational programming schedule will be torn.</p><p>I put on my slippers, and I shuffled down stairs,<br>\nand begun slowly sorting through all my kitchen wares.</p><p>For today, is my Spring Cleaning day,<br>\nand I will have little time to play.</p><p>I wished and washed, and sloshed and swished,<br>\nin the end all my cleaning sponges looked squished.</p><p>To complete my mission, I had to update my fire alarms,<br>\nso I grabbed my ladder, and put tools under my arms.</p><p>My bendy scissors, and my rusty screwdriver<br>\nthat looks like I stole it from a scuba diver.</p><p>And climbed, my three little steps,<br>\nall the while flexing my triceps.</p><p>When I finally made it to the top,<br>\nthe little screw wouldn&apos;t fit, so I got down and poked it with my mop.</p><p>I said, &quot;This a job for &apos;mah power-tools,<br>\nI need my drill, this ain&apos;t no job for fools.&quot;</p><p>I cannot describe to You with what amazing grace,<br>\nI made that hole, and fireproofed my place.</p><p>As I was making my way down,<br>\nI almost felt like I earned a crown.</p><p>But, when I reached the bottom, I found a screw,<br>\nI must have dropped it... it was brand new.</p><p>But! In the end I made it all work,<br>\nand muttered, &quot;Guess, I am not such a dork.&quot;</p><p>Now, when I look up and tilt my head,<br>\nI can see it... slowly blinking red.</p>","audio":"audio/poetry-0050.mp3"},{"id":"poetry-0049","title":"School Is Not For Us - Run, Child. Run From The Bus.","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-26T23:10:06.000Z","draft":false,"deleted":false,"published":"Sun Apr 26th 2020, 7:10 PM","html":"<p>Don&apos;t let them put you on a school bus.<br>\nTell you parents, school is crazy!</p><p>And anyway,<br>\nthey shouldn&apos;t be so lazy.</p><p>You will need all the games,<br>\nand you memorize <em>no</em> presidential names.</p><p>You demand a trip to every national park.<br>\nbecause you will not spend you life in the dark.</p><p>You will need every audio-book ever made,<br>\nand only then will you go through life unafraid.</p>","audio":"audio/poetry-0049.mp3"},{"id":"poetry-0048","title":"Yearn To Learn","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-26T22:51:16.000Z","draft":false,"deleted":false,"published":"Sun Apr 26th 2020, 6:51 PM","html":"<p>Did you know, that we can&apos;t grow,<br>\nunless our lessons connect together?<br>\nWe learn the way we navigate cities.</p><p>If we leap from one city center, to another...<br>\nwe will not know, where to go, or what to do.<br>\nNone of the roads will make any sense.</p><p>To divide knowledge into subjects,<br>\nand encourage cramming, and memorization,<br>\nand force remembering over understanding.</p><p>That is not Education, or Knowledge.<br>\nWe can no more leap between subjects,<br>\nthan hobbies, or families.</p><p>What connects two things together,<br>\nis as important as the things themselves.</p><p>We only learn when two connect,<br>\nand, then the two connect to a third one,<br>\nand next one, to no end.</p><p>We need a pleasant memorable,<br>\nunbroken chain of curiosities,<br>\nthat we can slide up and down, when need be.</p><p>Disconnected snippets,<br>\nthat we not know what to do with,<br>\nare not useful to us.</p>","audio":"audio/poetry-0048.mp3"},{"id":"poetry-0047","title":"Trickster Fool","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-26T20:31:13.000Z","draft":false,"deleted":false,"published":"Sun Apr 26th 2020, 4:31 PM","html":"<p>Think of a trickster, a real bad fool.</p><p>What a great robbery it would be.<br>\nIf your parents sent you to college.<br>\nAnd teachers sold disconnected snippets.<br>\nAnd called it knowledge.</p><p>And wouldn&apos;t it be convenient,<br>\nif you could chose you next batch.<br>\nWouldn&apos;t the trickster rejoice,<br>\nhad you called, that, a choice.</p><p>And then at the end of the day.<br>\nWhen hard earned money was taken.<br>\nYou wouldn&apos;t even be shaking,<br>\neven though it was worse than a break-in.</p><p>Think of a trickster, a real bad fool,<br>\nthat took away your very own school.</p><p>The moral of this story,<br>\nis that you should think through,<br>\nwhen someone offers to teach you.</p><p>Education, requires that you learn on your own,<br>\nthat something that teaching can only postpone.</p>","audio":"audio/poetry-0047.mp3"},{"id":"research-0092","title":"Svelte is not a component system, look to pre-processors (PostHTML) for such.","category":"research","tags":"Programming","date":"2020-04-26T18:00:57.744Z","draft":false,"deleted":false,"published":"Sun Apr 26th 2020, 2:00 PM","html":"<p>I found a new way to Component-ize code, rather than using any Programming Language, it maybe possible to use a pre-processor stack approach.</p><p>The stacks are a very flexible tangent and may actually call for use of XML (an HTML super-set) and XSLT processors (XML mangling language), it would be nice and clean, but I would need to create a lot of stuff myself, data observers/proxies, life cycle management, and all that.</p><p>It is a fun project, but there is nothing fun to show for it. No, fun stuff just code, and bunch of re-factoring needs. I&apos;ll put this on the back burner.</p><p>I rebuilt the Bodybuilding Advice Widget from scratch, without worrying about code density, or code liability, and it was pleasant, educational, enlightening. Bodybuilding Advice Widget is my way of testing Svelte Complexity and potential for Component Systems.</p><p>Bodybuilding Advice Widget is also a test of close I can come to satisfy Bootstrap Theme requirements. If I don&apos;t create components, I end up creating Bootstrap Snippets, which is very good, it is in part what they are looking for.</p><p>My Final Verdict on the subject of Svelte is that is is not a Component friendly Framework. There is however potential in pre-processor stacks like PostHTML, and plain old XML/XSLT, but since I was only reviewing <a href=\"https://svelte.dev/\">Svelte</a>, the rest is outside of the scope of this Quarantine.</p>"},{"id":"poetry-0046","title":"Unbreakable and Unlimited","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-26T00:28:14.602Z","draft":false,"deleted":false,"published":"Sat Apr 25th 2020, 8:28 PM","html":"<p>Captain&apos;s Log Supplemental, Quarantine, Day Forty.</p><p>We are born to run our fingers through infinity,<br>\nbe it Wright Brothers or Yuri Gagarin, Galileo Galilei.</p><p>It is our right to touch the greatest of heights,<br>\nand it is our privilege to cheer for each other in triumph.</p><p>We have no flaws, no ugliness, no weakness, and no limit,<br>\nbe it Tenzing and Hillary, or Viktor Emil Frankl.</p><p>Nothing can stop us,<br>\nthere are no bars thick enough,<br>\nthere are no bars strong enough,</p><p>&quot;We are the Captains of our Souls,<br>\nAnd The Masters of Out Fate&quot;</p><p>However, there is a culture that we must never let go of,</p><p>The culture of, Love of Wisdom,<br>\nThe culture of, Inheritance of Knowledge.</p><p>If we are tricked to reject Wisdom,<br>\nand if there is no teacher or parent,<br>\nor friend left to remind us,<br>\nthen all will be lost.</p><p>Your work will not set you free,<br>\nit is a lie as old as slavery.</p><p>Your teachers can only remind,<br>\nbut they cannot reach into your mind.</p><p>Fight for your right to knowledge,<br>\nthere is no university,<br>\nthere is no college,<br>\nyou have to use your heart to learn,<br>\nonly you can do that.</p><p>Without Inheritance of Wisdom,<br>\nyou will become cursed to start at zero.</p><p>As magnificent as your battle will be,<br>\nyou will only reach a path, that was walked countless times before.</p><p>You must start,<br>\nwhere the greatest minds <a href=\"https://en.wikipedia.org/wiki/Category:Science_communicators\">left off</a>.</p>","audio":"audio/poetry-0046.mp3"},{"id":"poetry-0045","title":"Flight and Light","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-25T21:23:19.000Z","draft":false,"deleted":false,"published":"Sat Apr 25th 2020, 5:23 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Forty.</p><p>Everything is all right, except for our flight.<br>\nBut had we been given infinite light,<br>\nour wings would fail in flight.</p><p>What gives us the right to learn, and rise to height,<br>\nis the limit of the duration of our light.</p><p>What makes it precious, and worth the flight,<br>\nis precisely the limits in duration of our light.</p><p>It is by our limits that we look to light,<br>\nhad we been given infinite flight,<br>\nour intelligence would fail to light.</p>","audio":"audio/poetry-0045.mp3"},{"id":"research-0091","title":"Code Density Failures","category":"research","tags":"Programming","date":"2020-04-25T15:26:01.052Z","draft":false,"deleted":false,"published":"Sat Apr 25th 2020, 11:26 AM","html":"<p>I have spent an hour or two this morning experimenting with lowering code density by creating High Level Components out of HTML code.</p><p>This was a failure.</p><p>I created this neat and tidy range/slider where a user could select the number of seconds that a body building advice message should display for. And because it was a Component that stored a bunch of logic, I wasn&apos;t able to say: &quot;Hey! when you change, then reset the current message timeout too.&quot; Without being able to say that, If a Body Building Advice is set to display for 2 minutes, and I change that to 1 second, it will take two minutes for that change to take place.</p><p>It would take no effort at all without Components, with components, I end up hoisting all kinds of optional eventualities for edge cases like this one.</p><p>There were multiple obstructions in the way.</p><p>Even on the graphic level. Bootstrap&apos;s Tab bar uses a background trick, that demands I set a background for a tab, so it can hide the selected tab bottom-border. They should not be using a trick, if tabs are not possible without CSS/HTML trick, then they should not be shipped.</p><p>In Svelte they would not allow me to do Svelte things on Components I created.</p><p>For example, I cannot say this button should be sent to a template slot named menu, it trows: &quot;&apos;slot&apos; is reserved for future use in named slots&quot;</p><p>Furthermore, I could not apply a conditional class on a Custom component as it would throw: &quot;Classes can only be applied to DOM elements, not components&quot;</p><p>So, I cannot create general purpose custom Bootstrap components.</p><p>I had a weird feeling about it from the beginning.</p><p>So now, I cannot create Custom Stores, I cannot create Custom Components.</p><p>Fair enough. The custom stuff is not part of the Svelte magic, and it is secondary on their todo list.</p><p>And I need to stick to what Bootstrap and Svelte are good at, and stop trying to twist/generalize things.</p><p>One example of me quietly twisting things is the card/app caption on the catpea.com homepage/dashboard it is a label and a button but not the Bootstrap way. Bootstrap&apos;s way would be either the tabs, or pill buttons, the first button would be the title, and second the little preferences icon.</p><p>CSS/HTML, Bootstrap/Svelte are not moving in a direction where code complexity can be squished.</p><p>I think that should be a meta-programming layer on top, layer I make with Sweet.</p><p>But even with a large meta-programming effort, I end up with this initial hoisting problem where edge cases cause a need to hoist optional things up top, they never get used but they do create a lot of code liability.</p><p>So, what I am left with here, is... that each app should be its own word, and should not demand any reusable Components.</p><p>This way, there are no obstructions, just open code, but it is hard to read code.</p><p>This is yet again a vote for a Visual Programming Language, where things are not divided into well defined components, but generally reusable snippets.</p><p>For now though, I&apos;ll keep things simple, and simplify the apps I have thus far wrote, rather than create Components out of them.</p>"},{"id":"poetry-0044","title":"Tomato With Sprinkles","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-25T02:18:21.042Z","draft":false,"deleted":false,"published":"Fri Apr 24th 2020, 10:18 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Nine,<br>\nA vegetable juice out of line.</p><p>The Tomato with Sprinkles was born of accident,<br>\nwhen making my salad, this is how it went;</p><p>The salad bag tore,<br>\nand some of the salad went on the floor.</p><p>But a fistful, fell in my tomato juice,<br>\nand decorated it with sprinkles of produce.</p><p>It is hard to recommend, but I must say,<br>\nit tasted great, and I&apos;ll drink it everyday.</p>","audio":"audio/poetry-0044.mp3"},{"id":"research-0090","title":"Watching the paint dry, Reactive/Dynamic Timestamps","category":"research","tags":"Programming","date":"2020-04-24T16:46:36.024Z","draft":false,"deleted":false,"published":"Fri Apr 24th 2020, 12:46 PM","html":"<p>Well, I woke up, looked at my screen and the time stamps were off. Cat Pea News was open on my screen and, it makes sense that all time stamps need to keep perfect time.</p><p>Ok, so I went back on what I said yesterday, I removed the custom Svelte store I wrote, and simplified/duplicated code and got that simple Svelte syntax back. With the simple syntax, I rewrote time-ago (ex: Updated 1 hour ago) everywhere, including categories, which track time of the latest post, there is category layer above that that stores that time, it is like a double update:</p><ol>\n<li>I first scan the database updating the ago text for each post.</li>\n<li>I make a category database, and update that when cost ago stamps change.</li>\n</ol><p>While I was doing this, it occurred to me that I should use a top down component model. Meaning, data lives on top, all the changes happen to it on top, and then data cascades down into all the pages, and then, page components.</p><p>Normally, that&apos;s how applications are made. But Cat Pea News, is not just Svelte, it is also Sapper a static file server...</p><p>And of course the point being, that no JavaScript is needed to read news.</p><p>So, google can index my content archive.org can mirror my content, and they don&apos;t need to execute my JavaScript.</p><p>It is just the principle alone: If a website is not a Dynamic Application, it should not require JavaScript for operations.</p><p>As I mentioned yesterday, the time ago feature of posts is disabled in a no JavaScript environment, and friendly Date appears.</p><p>My demand for a Non-JavaScript website, and my use of Sapper, skewed my research into Svelte.</p><p>I am not ready to complain about it yet.</p><p>Cat Pea News is too unique.</p><p>The fancy thing is, I learned a lot about Svelte, yeah, so when I come back to dynamic applications NO CUSTOM STORES (custom memory/database work) because that does not get equal treatment under svelte and forces special syntax, and cascading requirements.</p><p>It appears that Custom Svelte Stores are my only real problem. If use the Top Down application architecture, then I don&apos;t have that problem.</p><p>Svelte Sapper is best for applications, and it is better than everything else for static websites.</p><p>This is still the best in everything, but it is not the Perfect Compiler I expected.</p><p>It helped me define my expectations as well.</p><p>I want reactive data, reactive CSS, reactive HTML, and I want it all to keep to JavaScript, XML (HTML), CSS conventions.</p><p>These parts are so complex, that their interaction would require months of research.</p><p>It is amazing how many clever ideas span the <a href=\"https://svelte.dev/\">Svelte</a>, <a href=\"https://reactjs.org/\">React</a>, <a href=\"https://vuejs.org/\">Vue</a> and <a href=\"https://angular.io/\">Angular</a> universe.</p><p>Maybe, the correct solution to Applications/Websites is not all code. But it will require Visual Programming Tools. With another abstraction layer over a programming language, the gravity of code duplication, meta-programming, documentation, maintenance shifts and may a allow a perfect programming language, but that is far and different universe, it has nothing to do with Svelte.</p><p>It is worth mentioning that I looked at <a href=\"https://www.sweetjs.org/\">Sweet.js</a> this morning, as I sometimes do. It is meta-programming or super-programming for JavaScript, and I was able to define one property of a proper language: LOW CODE DENSITY. This means that the language is suited for the task at hand and need not be twisted. Custom Stores in Svelte cause twisting:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0090-t-1.png\" alt=\"T 1\"></p><p>In React, a three line example is enough to show twisting:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0090-t-2.png\" alt=\"T 2\"></p><p>With meta-programming, with super-programming that code can reduced to a single clean statement. And meta-programming will work for all languages. Svelte uses meta-programming, the layer for custom stores is just not complete, or or is meant to be more flexible.</p><p>Maybe, Low Code Density, or Untwisted Code can only be achieved on per project basis, and only with meta-programming.</p><p>After all Svelte&apos;s Might is the Meta Programming setup.</p><p>I a glad I mention <a href=\"https://www.sweetjs.org/\">Sweet.js</a> here.</p><p>Then there is the question of HTML vs Flex/Swing, or question of Containers and Components like old <a href=\"https://dojotoolkit.org/\">Dojo</a> is/was <a href=\"https://dojotoolkit.org/documentation/tutorials/1.10/dijit_layout/\">doing</a>. A high level nestable container framework would cut down on UI code considerably. Combination of Meta Programming (to obscure reactive boilerplate) and Components/Containers could potentially create a Rapid Application Development platform with code worth reading. A sane Visual Programming Environment on top of that, could really speed up large application development.</p><p>Back to Applications, and goodness I need to make a Raspberry Lettuce Salad for lunch.</p>"},{"id":"poetry-0043","title":"Amazing Diet","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-24T01:36:49.000Z","draft":false,"deleted":false,"published":"Thu Apr 23rd 2020, 9:36 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Eight,<br>\nMy salads are working great!</p><p>I have lost even more weight,<br>\nand I can&apos;t even count how many I ate.</p><p>It is a marvelous diet of incredible proportions,<br>\nI don&apos;t track my calories, or even my portions.</p><p>I just make a salad once or twice,<br>\nand with strawberry jam, it tastes like paradise.</p><p>And yes, I still continue improving and experimenting,<br>\nToday, I added Jalapenos for a little spicy augmenting.</p><p>It is a strange magical thing,<br>\nbut Sugary Jam and Jalapenos are king.</p><p>It is not all sugar and spice, as yesterday I cried,<br>\nI added and ate an whole onion so angry, I almost died.</p><p>So it is not just strawberry jam anymore,<br>\nblueberry works just as well, maybe even more.</p><p>To all the diet people out there,<br>\njoin me in my venture,<br>\nadd a spoon jam,<br>\nand taste the adventure.</p>","audio":"audio/poetry-0043.mp3"},{"id":"research-0089","title":"Proper Timestamps","category":"research","tags":"Programming","date":"2020-04-23T23:37:00.693Z","draft":false,"deleted":false,"published":"Thu Apr 23rd 2020, 7:37 PM","html":"<p>I had to rewrite a bunch of code to prefix variables with a dollar sign, that is a huge problem for Svelte adoption.</p><p>This person ran into the <a href=\"https://stackoverflow.com/questions/60045404/svelte-read-nested-store\">same problem</a>, it is hard to form an opinion on the matter as I am still learning svelte.</p><p>There are other much smaller anomalies.</p><p>And then the issue of the graphic language (CSS) not being dynamically editable.</p><p>Svelte is still the best framework, but I think another one will evolve from Svelte.</p><p>The two or three leading Svelte ancestors (in general, not approach wise) <a href=\"https://angular.io/\">Angular</a>, <a href=\"https://reactjs.org/\">React</a> and <a href=\"https://vuejs.org/\">Vue</a>, are even worse.</p><p>This small svelte problem, is still nothing compared to the mess <a href=\"https://reactjs.org/\">React</a>, <a href=\"https://vuejs.org/\">Vue</a>, and <a href=\"https://angular.io/\">Angular</a> are creating.</p><p>Svelte is an important experience, because it has unearthed the future of all programming.</p><p>But, today writing code for Svelte, is just that. I will not be able to use Svelte code in future JavaScript code.</p><p>Someone did a nice write up <a href=\"https://github.com/feltcoop/why-svelte\">here</a>, much better analysis than mine.</p><p>It is 2020, things should be further along than this.</p><p>Anyway, 98% of Svelte+Sapper is good, my concern is that they will fail to follow JavaScript development path, and conventions, and the newer version will have more of the <a href=\"https://stackoverflow.com/questions/60045404/svelte-read-nested-store\">same problem problems</a>.</p><p>Cat Pea News, however is doing great, not when JavaScript is disabled the <em>Time ago time-stamps</em> fall back on normal dates, as they can&apos;t be calculated since dynamic programming is off. This took very little work. It is the same code-base, but when there is no programming in the browser, dynamic features fall back, and look great!</p><p>Here is an example of the &quot;ago time&quot; calculation:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0089-nojs-1.png\" alt=\"Nojs 1\"></p><p>And here is what hapends when that catculation can&apos;t be made the browser has disabled JavaScript:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0089-nojs-2.png\" alt=\"Nojs 2\"></p>"},{"id":"research-0088","title":"Cat Pea News can be used with JavaScript disabled, and launch of Styleguide.","category":"research","tags":"Programming","date":"2020-04-23T17:41:21.529Z","draft":false,"deleted":false,"published":"Thu Apr 23rd 2020, 1:41 PM","html":"<p>It has been a long road to create an application like this.</p><p>While Cat Pea News is written in JavaScript, and JavaScript enhances the features, it is not required for operation.</p><p>When JavaScript is disabled, the sub navigation menu is displayed in a non-interactive mode. Everything still works, except for collapsing menus and and little future extras like that.</p><p>This is an advanced feature that most programmers don&apos;t even try to think about. I remember once reading a complaint by a programmer, and I paraphrase:</p><blockquote>\n<p>&quot;Imagine if someone was allowed to disable the electrical system in you car, and then complained nothing works.&quot;</p>\n</blockquote><p>Yeah, imagine... If we delivered base functionality without bloat and <a href=\"https://en.wikipedia.org/wiki/Feature_creep\">Feature Creep</a>.</p><p>Tiny program, big feature. If I aimed to create a fast website for browsing content, I could actually pull it off.</p><p>Google created a whole technology for less bloated internet, but it is also designed for serving ads. It takes so little to create something like Cat Pea for no java-script browsers, that Google Amp&apos;s CDN networks layout/HTML worries kind of add up to creating a new ad platform. As their other benefits are easily reproducible with some foresight the non-js part of <a href=\"https://getbootstrap.com/\">Bootstrap</a> and basic <a href=\"https://sapper.svelte.dev/\">Svelte Sapper</a>.</p><p>I kind of consider this little-big milestone the completion of the coding behind Catpea&apos;s News Site. Today is the real launch date.</p><p>Yesterday, I added that little <a href=\"https://github.com/fantasyui-com/news/blob/master/add.sh\">templating system</a> that just helped me to create this post by running <code>add research</code>, and I like that too. This is a third post that I created with it.</p><p>I also begun work on documenting changes I make to Bootstrap. This is a project that is happening on catpea.com, rather than the news site, and it is under <a href=\"https://catpea.com/styleguide/\">https://catpea.com/styleguide/</a> It is a horrible mess right now, with sample code. This will become the primary documentation for the Cat Pea Theme. The big deal behind it is that I keep graphic instructions next to structure of content the graphic instructions decorate. It will quickly become a long document with useful little recipes for UI building.</p>"},{"id":"poetry-0042","title":"I Miss Old Programming Languages","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-23T01:46:11.372Z","draft":false,"deleted":false,"published":"Wed Apr 22nd 2020, 9:46 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Seven.<br>\nI can&apos;t believe that seven only rhymes with Eleven, and Heaven.</p><p>Every ten days I get stuck rhyming those two words,<br>\nand it is just about as fun as petting birds.</p><p>I was writing <a href=\"https://www.youtube.com/watch?v=2hz7-v2f1sA\">Bash</a> this afternoon,<br>\nI am so full of energy, I feel like a loon.</p><p>I was so tired at eight yesterday,<br>\nI have no idea how I will fall asleep today.</p><p>I wrote a <a href=\"https://www.youtube.com/watch?v=xW4CdejMNPA\">non-capturing</a> Perl <a href=\"https://www.youtube.com/watch?v=ykSuHWhh5hc\">Regular Expression</a> in <a href=\"https://www.youtube.com/watch?v=32waL1Z9XK0\">sed</a>,<br>\ngosh I miss the old <a href=\"https://www.youtube.com/watch?v=E2JJZVqe97I\">Perl</a>, I miss <a href=\"https://www.youtube.com/watch?v=9Zx1vEmaQMc\">CGI</a>, and I miss <a href=\"https://www.youtube.com/watch?v=BNYpmLH6IjQ\">ed</a>.</p><p>What has the world become after <a href=\"https://youtu.be/PUv66718DII?t=2490\">abandoning modes</a>,<br>\nand how strange have become our codes.</p><p>Using <a href=\"https://www.youtube.com/watch?v=St5B7hnMLjg\">SASS</a> writ in <a href=\"https://www.youtube.com/watch?v=kJkB_Tggk8U\">C++</a>,<br>\nto make <a href=\"https://www.youtube.com/watch?v=gT0Lh1eYk78\">CSS</a>? What a mess!</p><p>And beyond that, with <a href=\"https://www.youtube.com/watch?v=PoRJizFvM7s\">async/await</a>,<br>\n<a href=\"https://www.youtube.com/watch?v=9A_jkh2AKR8\">JavaScript</a> has become a heavy weight.</p><p>I always tell people if you make for the web,<br>\nuse the <a href=\"https://www.youtube.com/watch?v=nGvA92h9IbU\">language, of the web</a>.</p><p>They then look at me accusingly,<br>\nparading <a href=\"https://www.youtube.com/watch?v=Y8Tko2YC5hA\">Python</a>, <a href=\"https://www.youtube.com/watch?v=mBL9Athx7ms\">PHP</a> or <a href=\"https://www.youtube.com/watch?v=5KlnlCq2M5Q\">Dart</a>, maybe <a href=\"https://www.youtube.com/watch?v=2Xa3Y4xz8_s\">Java</a>?! amusingly.</p><p>Come on people, this is not our first rodeo,<br>\nTime took out Perl with a torpedo.</p><p>This is war, and those who fall behind lose,<br>\nIf you write for the web, use the <a href=\"https://www.youtube.com/watch?v=nGvA92h9IbU\">language, of the web</a>.</p><p>Your utilities will hang around longer,<br>\nand your accomplishments will be that much stronger.</p>","audio":"audio/poetry-0042.mp3"},{"id":"research-0087","title":"Color Themes in Bootstrap, and Post Templates in Bash.","category":"research","tags":"Programming","date":"2020-04-22T23:59:52.233Z","draft":false,"deleted":false,"published":"Wed Apr 22nd 2020, 7:59 PM","html":"<p>I had a piece of bread with my Raspberry Salad today, I&apos;ve been programming like a madman.</p><p>I created couple of commands to update the <a href=\"https://github.com/fantasyui-com/news/blob/master/README.md\">github mirror of my posts</a>, it has a little <a href=\"https://github.com/fantasyui-com/news/blob/master/add.sh\">templating system</a> in <a href=\"https://www.youtube.com/watch?v=2hz7-v2f1sA\">Bash</a>, so I can say:</p><p>add poem<br>\nor<br>\nadd research</p><p>and it will create a post blank with a proper time-stamp and id. Ready for poems, and long winds, as they say in Wales.</p><p>And I updated the <a href=\"https://catpea.com/palette\">Palette Tool</a> on <a href=\"https://catpea.com/\">Cat Pea</a> to crank out pretty gosh darn readable Color Themes, here is an abstract montage of Purple Dark Pastels, Green Trinity Matrix, and desaturated Blue Navy.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0087-multicolor.png\" alt=\"Multicolor\"></p><p>I still have to adjust a tool that makes use of that data over in <a href=\"https://news.catpea.com/\">news.catpea.com</a>, but it is all looking pretty good. Here is a <a href=\"https://github.com/fantasyui-com/news/blob/master/posts/id127.md\">mirror of this post</a> on github.</p>"},{"id":"poetry-0041","title":"Everybody Counts","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-22T01:29:53.978Z","draft":false,"deleted":false,"published":"Tue Apr 21st 2020, 9:29 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Six.<br>\nToday has been an interesting mix,</p><p>We have to be strong,<br>\nand go far and long.</p><p>We can&apos;t sit around,<br>\nlooking at the ground,</p><p>We are each a hero,<br>\nand none are zero.</p><p>Everybody counts,<br>\ncare for each other amounts,</p><p>It amounts to Happiness and Cheer,<br>\nand all the Wonders we hold Dear.</p>","audio":"audio/poetry-0041.mp3"},{"id":"research-0086","title":"UI Component Upgrades","category":"research","tags":"Bootstrap Programming","date":"2020-04-21T19:40:33.604Z","draft":false,"deleted":false,"published":"Tue Apr 21st 2020, 3:40 PM","html":"<p>Got around to working on typography and layout.</p><p>Things look good, I tested it on desktop and mobile, very little needed reprogramming to work well on mobile.</p><p>I am learning <a href=\"https://www.youtube.com/watch?v=FtXd_qQJgfI\">Bootstrap</a> I now know what a Theme is (Colors, configuration tweaks, nothing more).</p><p>And a Theme has second part that is like an extra attachment, and that&apos;s various little useful layouts, snippets, templates. The second part is a very important extra.</p><p>With <a href=\"https://www.youtube.com/watch?v=FtXd_qQJgfI\">Vue</a> and <a href=\"https://www.youtube.com/watch?v=0KlRgFEEz0g\">React</a> being too alien for real development, <a href=\"https://www.youtube.com/watch?v=JjIvF0yikGU\">iQuery</a> dying, <a href=\"https://www.youtube.com/watch?v=R9o9js_HKwc\">WebComponents</a> being too far away, <a href=\"https://www.youtube.com/watch?v=ws97Etvs-Qs\">Svelte</a> or a framework like it will triumph. Moreover, Svelte already compiles to WebComponents, and WebComponents will forever lack (by default) a good automatic data to UI updates, because they are not designed to make programming reasonable, unlike Svelte.</p><p>These important Theme-Extras therefore, must be written in Svelte. And Cat Pea, is a prime example of what an Extra would look like. All those little boxes, little menus, little drawers, bits of Music Making, Bodybuilding Advice, all of that are snippets of code that will make this theme sell. The news site, is not a good snippet, it should be included, but it is too monolithic, it is just buttons for browsing posts.</p><p>I will need to redesign Cat Pea with that in mind, so my programming adventure is also making a tiny product for <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a>. Anyhow, here are the newly added UI improvements.</p><p>Here is the new Home Page, it looks like an App, because the user is browsing All Posts at first. I think it would be better to create a Home Page that first opens to 5 latest posts, and I may do that later.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0086-news-update-1.png\" alt=\"News Update 1\"></p><p>This is Category View, it is a lot cleaner, but it is very busy. I basically turned 3 words (Research, Quarantine, Theme) into a web page, but this is probably more sustainable as far as writing a lot of articles goes.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0086-news-update-2.png\" alt=\"News Update 2\"></p><p>And this is what reading a post looks like now. I&apos;ll have toggle tat off into a mini miniature, I&apos;d like to see just the post here, I&apos;ll add a &quot;Quick Nav&quot; box and when that&apos;s opened the quick navigation features will show up. Reading a post should just be about a post.</p><p>I like the Listen button, and I like the fact that it fits well on the home page.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0086-news-update-3.png\" alt=\"News Update 3\"></p><p>The one big change is that there is no more Player, the user has to click the button to see it. This is because every browser has it&apos;s own player. The stablest method is to add the button that just links to the mp3 file.</p><p>I also setup an external repository for my writing over on <a href=\"https://github.com/fantasyui-com/news\">Github</a> it is not easy to navigate, but if I ever lose catpea.com domain name, or github is down, or technology changes, there is always this external master that has all the text and poems and my <a href=\"https://github.com/fantasyui-com/news/tree/master/poems\">recordings</a> mostly accessible. I want the 70 year old me, to be able to access this and be really embarrassed and filled of regret about how he wasn&apos;t a serious person when he had a chance. The heck with that guy.</p>"},{"id":"poetry-0040","title":"Every Now And Then","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-20T23:05:47.100Z","draft":false,"deleted":false,"published":"Mon Apr 20th 2020, 7:05 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Five.</p><p>I am not sure that the end of quarantine will ever arrive,<br>\nso I am preparing to write enough poetry to fill a hard drive.</p><p>I think I shall begin writing about cats,<br>\nand then complain a bit about bureaucrats.</p><p>When I am done complaining,<br>\nI shall pick something more entertaining.</p><p>Like perhaps musing about Lowbrow Art,<br>\nand then carry on babbling about someone smart.</p><p>Maybe a Scientist, or a Philosopher like Descartes,<br>\nor maybe a colorful leader like Napoleon Bonaparte.</p><p>Then, when, I&apos;ll run out of things to babble on,<br>\nI will jump on my bicycle and set off at dawn,</p><p>I&apos;ll bring my notepad and a pen,<br>\nand come up with a new idea,<br>\nevery now and then.</p>","audio":"audio/poetry-0040.mp3"},{"id":"research-0085","title":"User Interface Updates","category":"research","tags":"Programming","date":"2020-04-20T21:37:20.115Z","draft":false,"deleted":false,"published":"Mon Apr 20th 2020, 5:37 PM","html":"<p>I made the UI a bit easier to follow, there is still a bunch of work to be done.</p><p>There maybe some broken links, but I think I got it all.</p><p>I continue learning how to use <a href=\"https://getbootstrap.com/\">Bootstrap</a> without twisting things around. I want to be able to create Themes that are Interchangable. That kind of programming is hard to get used to.</p><p>I&apos;ve been somewhat quitet about my research becasue I was just programming the news site. Now the Tag/Category system will allow me to post Philosophy, Songs (that I may sing, eek) my music, bicycle adventures, and all kinds of things.</p>"},{"id":"poetry-0039","title":"Buckle and Goat","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-20T02:28:30.917Z","draft":false,"deleted":false,"published":"Sun Apr 19th 2020, 10:28 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Four.</p><p>I finished a big program, but I am ready for more.</p><p>So, I am writing a poem, and its always very hard,<br>\nbecause I never know what its going to be about.</p><p>One moment, I am mighty, serious, and athletic,<br>\nthen I sit to the poem, and I lose that aesthetic.</p><p>In my early 20s I wore a Blues Brother suit for office work,<br>\nbut even that didn&apos;t work, cause I added cowboy-shoes,<br>\nand a huge buckle, not a day past when I didn&apos;t get a chuckle.</p><p>Later it got even worse, I wore leather pants and a Matrix coat,<br>\nI fit into my coffee shop like a mountain goat.</p><p>Being serious is just too darn hard,<br>\nI don&apos;t have the might,</p><p>OK, that&apos;s enough for this poetic flight,<br>\nI am done writing, y&apos;all have goodnight.</p>","audio":"audio/poetry-0039.mp3"},{"id":"research-0084","title":"Whoo Hoo! News Launched","category":"research","tags":"Launch","date":"2020-04-20T00:09:23.684Z","draft":false,"deleted":false,"published":"Sun Apr 19th 2020, 8:09 PM","html":"<p>I am still getting used to it but it looks pretty neat. I coded the whole thing from scratch, haha.</p><p>It reminded me of my days programming <a href=\"https://www.youtube.com/watch?v=9Zx1vEmaQMc\">CGI</a> in <a href=\"https://www.youtube.com/watch?v=E2JJZVqe97I\">Perl</a> I kind of miss that.</p><p>I am writing this in my text editor, in the <a href=\"https://www.youtube.com/watch?v=f49LJV1i-_w\">Markdown</a> format.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0084-md.png\" alt=\"Md\"> <a href=\"image/research-0084-md.png\">zoom</a></p><p>That&apos;s what I used originally but I wanted to see what would happen is I stored my notes in code. I liked it, but it was not portable across systems.</p><p>Too many things change in code, research notes have to be much simpler. And they have to be <a href=\"https://github.com/fantasyui-com/news-catpea-com/blob/master/db/content/posts/id121.md\">readable</a> outside of any programming language. Github does make this possible, by supporting markdown, I&apos;ll just stick with the Markdown format from now on.</p><p>I&apos;ll probably create a separate repository <a href=\"https://github.com/fantasyui-com/news-catpea-com/tree/master/db/content/posts\">for just my posts</a> and do the same for my little book.</p>"},{"id":"research-0083","title":"News on news.catpea.com has a functional category browser.","category":"research","tags":"Programming","date":"2020-04-19T17:22:14.849Z","draft":false,"deleted":false,"published":"Sun Apr 19th 2020, 1:22 PM","html":"<p>I continue working on <a href=\"http://news.catpea.com\">news.catpea.com</a> I added categories and little navigational hints, and timestamps.</p><p>I want to create a new category, poetry. But I don&apos;t want to mix it with quarantine, yet.</p><p>So, I guess, the news site will have a category browser with strict rule, one post per category.</p><p>And Then I&apos;ll add tags, where the user can browse all posts tagged poem for example.</p>"},{"id":"poetry-0038","title":"Rise To The Greatness","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-19T00:45:14.349Z","draft":false,"deleted":false,"published":"Sat Apr 18th 2020, 8:45 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Three.</p><p>Days pass by quickly, but as all the clocks tick away,<br>\nwe mustn&apos;t keep our minds at bay.</p><p>We each have extraordinary powers,<br>\nand we can expand our knowledge,<br>\nin just a few hours.</p><p>All it takes is a video lecture,<br>\nor maybe an audio-book,<br>\nyou don&apos;t even have to look.</p><p>Hours add up, day by day,<br>\nbuilding, a new passageway.<br>\nIt is knowledge that sets us free.</p><p>And our inheritance from great beings,<br>\nis the key.</p><p>We mustn&apos;t forget, that everyone needs to learn,<br>\nnot merely listen, but break out of their prison,<br>\nand rise to greatness, when theirs is the turn.</p><p>It is within us, that each great being should return,<br>\nit is how the world grows, it is how you get your turn.</p><p>So, rise to their height, inherit their might,<br>\nshine the brightest of light,<br>\nyours is the future, yours is the fight.</p>","audio":"audio/poetry-0038.mp3"},{"id":"research-0082","title":"System Upgrade","category":"research","tags":"Programming","date":"2020-04-18T22:07:44.063Z","draft":false,"deleted":false,"published":"Sat Apr 18th 2020, 6:07 PM","html":"<p>I continued working on <a href=\"http://news.catpea.com\">news.catpea.com</a> and actually made very good progress.</p><p>I wanted to pull the poems out of code and give them an alternate version that can be easily read via github.</p><p>Here is the <a href=\"https://github.com/fantasyui-com/news-catpea-com/blob/17041ee955dacdf17c1f5f7c706bd1bbbd8b3060/db/content/posts/aquamarine-sandybrown.md\">result</a>, it is not pretty, but it is pretty readable.</p><p>Now I can continue with making <a href=\"http://news.catpea.com\">news.catpea.com</a> look nicer, I am missing some icons, and i want to allow browsing by category (research/quarantine) so that with a click only poems will come up.</p>"},{"id":"poetry-0037","title":"Iron Horse","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-18T02:53:05.373Z","draft":false,"deleted":false,"published":"Fri Apr 17th 2020, 10:53 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty Two,</p><p>I thought about my bicycle, my trail,</p><p>the morning dew.</p><p>When there is no gym,</p><p>I get up real early,</p><p>and ride on through,</p><p>It is magical out there,</p><p>seeing the world from the other side,</p><p>people stuck in traffic,</p><p>and here I ride.</p><p>I discovered modern architecture</p><p>of the highway underpass,</p><p>little woodland parks,</p><p>endless fields of grass.</p><p>Five miles out,</p><p>there lives an angry goose,</p><p>at seven miles,</p><p>in deep summer, angry &apos;squitoes on the loose,</p><p>Ten miles out,</p><p>there is a ninety degree turn,</p><p>and emptiness follows,</p><p>nothing but deep green fern.</p><p>Fifteen miles out,</p><p>a whole new city,</p><p>two new parks,</p><p>and the road gets gritty.</p><p>At twenty miles,</p><p>the real adventure starts,</p><p>you better have water,</p><p>and some street smarts.</p><p>And if you keep going forward,</p><p>you&apos;ll arrive on a pier at Lake Erie.</p><p>At first you&apos;ll feel pretty weary,</p><p>until you realize you&apos;re 30 miles from your bed,</p><p>at which point things will get pretty mad.</p><p>Hope you have trailmix.</p><p>Cause you&apos;re gonna need it.</p><p>To find you way back.</p><p>and keep pushing those pedals.</p><p>It will get dark soon,</p><p>but upon your return,</p><p>you&apos;ll fall into your comfy bed,</p><p>with a long, dramatic swoon,</p>","audio":"audio/poetry-0037.mp3"},{"id":"research-0081","title":"Working on news.catpea.com","category":"research","tags":"Programming","date":"2020-04-17T19:45:54.868Z","draft":false,"deleted":false,"published":"Fri Apr 17th 2020, 3:45 PM","html":"<p>I setup <a href=\"http://news.catpea.com\">news.catpea.com</a> a bit early than I wanted to, I&apos;ll upload all the photos, research and poems on there.</p><p>I need something that is less application and more website to try out less boxy designs.</p><p>Before I can make a product for <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a> I feel have to create something that will qualify for <a href=\"https://expo.getbootstrap.com/\">Bootstrap Expo</a> at least in theory.</p><p><a href=\"http://catpea.com/theme\">Theme</a> Styleguide is neat, but I now need something like this: <a href=\"https://getbootstrap.com/docs/4.4/examples/\">https://getbootstrap.com/docs/4.4/examples/</a> about nine web page designs.</p><p>At the time of writing there are nine menu items (Quarantine Log, Research Blog, Book, Videos, Wall, Palette, Theme, Designer, and Composer), so it would be pretty neat to present components of catpea as templates.</p><p>This is really helping me learn about design, and it is keeping my programming skills sharp.</p>"},{"id":"poetry-0036","title":"Super Salad","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-17T01:52:06.930Z","draft":false,"deleted":false,"published":"Thu Apr 16th 2020, 9:52 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty One,</p><p>I&apos;ve been programming all day, but now I am done.</p><p>I coded colors, design, music, a whole ballad,</p><p>but now my mind has fixed its aims on a salad.</p><p>I&apos;ve been trying to invent one that tastes really nice,</p><p>one that someone could even eat twice.</p><p>And I did! as I always do,</p><p>Just add Strawberry Jam, a dollop or two.</p><p>No need for dressing,</p><p>it tastes like a blessing!</p><p>Just squirt some jam,</p><p>mix it up and Bam!</p>","audio":"audio/poetry-0036.mp3"},{"id":"research-0080","title":"Styleguide Updates","category":"research","tags":"Programming","date":"2020-04-17T01:02:46.761Z","draft":false,"deleted":false,"published":"Thu Apr 16th 2020, 9:02 PM","html":"<p>I expanded the <a href=\"http://catpea.com/theme\">Theme</a> Styleguide to include many more components, and gave everything night mode support.</p><p>If you click the lightbulb and browse <a href=\"http://catpea.com/theme\">Theme</a> all the color information will be washed away, and things will look all military Zero Dark Mango Tango.</p>"},{"id":"research-0079","title":"Theme rebuilt, syncing up with Bootswatch","category":"research","tags":"Programming","date":"2020-04-16T19:25:33.766Z","draft":false,"deleted":false,"published":"Thu Apr 16th 2020, 3:25 PM","html":"<p>I have rebuilt the theme, the third time. This time it follows the programming pattern of <a href=\"https://github.com/thomaspark/bootswatch/\">Bootswatch</a>.</p><p>It feels quite right.</p><p>Night more is simple and powerful.</p><p>I fixed the big bug that was crashing the site. Github servers won&apos;t serve files prefixed with an _underscore.</p><p>Some of my libraries here use that here (not my code) and it is really hard to predict when some program will pull in a library that has files beginning with an underscore.</p><p>The overall site is getting sluggish, I may need a real blog program, I will probably run it under blog.catpea.com and probably go craaaaazy with typography.</p><p>I updated the <a href=\"http://catpea.com/theme\">Theme</a> page and it is starting to look pro.</p><p>Once I setup blog.catpea.com (in days or few weeks) catpea.com and blog.catpea.com will share the <a href=\"http://catpea.com/theme\">Theme</a> design.</p><p>It will be a great test of usefulness.</p><p>Whews.</p>"},{"id":"poetry-0035","title":"Computers Are Slow","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-16T02:49:34.356Z","draft":false,"deleted":false,"published":"Wed Apr 15th 2020, 10:49 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Thirty,</p><p>I&apos;ve been fixing bugs all day, and I feel dirty.</p><p>Now, that I fixed them all,</p><p>I must admit, I had a ball.</p><p>But, computers are slow,</p><p>My CPU is slower than a BBQ.</p><p>I tried to build a rhyming dictionary,</p><p>but it came out as an 8 megabyte webpage,</p><p>and nearly erased the internet.</p><p>In computers, everything is really bad,</p><p>but this never makes me sad, I am glad.</p><p>And now,</p><p>I took a shower,</p><p>and smell great,</p><p>my only wish,</p><p>is that I already ate.</p>","audio":"audio/poetry-0035.mp3"},{"id":"research-0078","title":"Designing Energon Cubes","category":"research","tags":"Bootstrap Programming","date":"2020-04-15T21:29:22.387Z","draft":false,"deleted":false,"published":"Wed Apr 15th 2020, 5:29 PM","html":"<p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-energon1.jpg\" alt=\"Energon 1\"></p><p>Transformer Robots Eat Energon... or something</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-energon.jpg\" alt=\"Energon\"></p><p>And walk on it... sometimes.</p><p>I gave <a href=\"http://catpea.com/designer\">Designer</a> a big upgrade, it now not only generates standard CSS, but the much needed <a href=\"https://sass-lang.com\">Sass</a> CSS (known as SCSS).</p><p>This is huge, because I can copy code from <a href=\"http://catpea.com/designer\">Designer</a> and paste it into <a href=\"https://getbootstrap.com/\">Bootstrap</a> and it will just work. After the code is in Bootstrap, it takes one line to use it.</p><p>Here is what the Sass code for one of the presets (Energon) in <a href=\"http://catpea.com/designer\">Designer</a> looks like:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-energon2.png\" alt=\"Energon 2\"></p><p>Energon: Installation</p><p>And here is what it takes to use it in some design:</p><p>(.card.energon means a card that has been marked as being of type energon, and a card is the boxes I use on the homepage. Card design comes from the Bootstrap team.)</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-energon1.png\" alt=\"Energon 1\"></p><p>Energon: Usage</p><p>And here is a crazy looking, but SUPER SERIOUS test. I am exporting information to multiple programming languages, JavaScript, CSS, and Sass. And in the case of Sass, I need to pass CONFIGURATION VARIABLES so that the customers can tweak them. I can&apos;t calculate the colors at all. That means, the Math for CSS and JavaScript has to match the Math for Scss.</p><p>This is Applied Color Theory...</p><p>I used calculations over <a href=\"https://www.youtube.com/watch?v=NAw2_NtGNaA\">HSL</a> for all three (CSS, JavaScript, and Sass) and it worked. For example Saturation of 0.5 in JavaScript, means the same thing that Saturation of 0.5 in Sass. But they each have a different way of expressing that. In JavaScript I say &apos;*&apos;+(0.5+1), and in Sass I have to say ((0.5*100 )/2).toFixed(1)</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-energon.png\" alt=\"Energon\"></p><p>Energon Cubes: Crazy Design</p><p>And when all is said and done Compiled <a href=\"https://sass-lang.com\">Sass</a> and <a href=\"http://catpea.com/designer\">Designer</a> preview, match pixel for pixel, because of my use of <a href=\"https://www.youtube.com/watch?v=NAw2_NtGNaA\">HSL</a> Color Model. The code for both is written by different programmer for different languages.</p><p>And there is no way a person will get far, without some visual tool like the <a href=\"http://catpea.com/designer\">Designer</a>.</p><p>Manipulating colors is such a freaking delicate operation, a 5% difference in Saturation and Brightness can either make a design, or make it look off and crappy.</p><p>There is no creating something like the Energon Experiment with a visual preview. Something as silly and useless as Energon required four separate revisions, to adjust blur/spread and colors, and the base color. It is just not possible without a tool.</p><p>A lot of Programmers/Designers use the browser as it has some preview/editing features.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-bp.png\" alt=\"Bp\"></p><p>Browser Can&apos;t help with Sass SCSS for Bootstrap</p><p>But how the heckedy heck to declare/extract variables, and generate Sass&apos;s SCSS code, that&apos;s not possible in the browser - lyke at all.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-calc.png\" alt=\"Calc\"></p><p>Still doing math in Sass</p><p>The code in Sass is still going to do some math based on the settings.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-setings.png\" alt=\"Setings\"></p><p>User&apos;s Settings</p><p>And the settings exists so that the user/customer can tweak things, they aren&apos;t really interested in building a new design, just making a slight alteration that makes sense in their business context.</p><p>One such example is removing the top-right highlight, or darkening the bottom-most blur/drop shadow to match their webpage-background.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-box4.png\" alt=\"Box 4\"></p><p>View of the different things at play.</p><p>Now I need to make some serious presets that will get me closer to a more serious design:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0078-real.jpg\" alt=\"Real\"></p><p>Serious Design</p>"},{"id":"research-0077","title":"Is Working Out The Tool Was Needed Because Of How Many Tiny Adjustments Are Required To Make Faux 3 D Out Of Mere Shadows Res...","category":"research","tags":"Bootstrap Programming","date":"2020-04-15T14:34:27.831Z","draft":false,"deleted":false,"published":"Wed Apr 15th 2020, 10:34 AM","html":"<p><a href=\"http://catpea.com/designer\">Designer</a> is working out. The tool was needed because of how many tiny adjustments are required to make faux 3D out of mere shadows.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0077-button.png\" alt=\"Button\"></p><p>A button in the wild.</p><p><a href=\"http://catpea.com/designer\">Designer</a> generates ready to go CSS code but that is not what <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a> will want, I have to generate special code that integrates with their color system.</p><p>Further more, the button shown above is too big, to anomalous, and can only be used for special occasions.</p><p>But, I still need to style default bootstrap buttons.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0077-bb.png\" alt=\"Bb\"></p><p>Default Bootstrap Buttons</p><p>So, I have to be a lot more delicate with my design, making only tiny subtle changes. And then the raised 3D button I created are treated as Bonus Extras.</p><p>More than writing code, I need to tap into Bootstrap&apos;s Module System, their standard library. I need to create a Bootstrap Extended Library, and the functions contained there in, will be injected into Bootstrap&apos;s own buttons.</p><p>INJECTION IS SIMPLE, in a world where I am dealing with a static program, this is not this world. I am dealing with up to 10 versions of bootstrap (<a href=\"https://getbootstrap.com/docs/versions/\">Bootstrap Versions</a>), so all code modifications on my end must be automated [serserge] will take care of it, entirely.</p><p>Having said that, that is is about a two year long project, realistically, I may have some neat things, in a few days, but I have to begin programming, for a Team of Developers. I need to put on my manager hat, and begin preparing this Theme project for multiple programmers to help me finish.</p><p>This is pretty fun, it is cool.</p><p>There is a program called WordPress, they are like a blogging platform. And they support WordPress Themes.</p><p>What I need to do, is create a Bootstrap Theme, in such a way, that somebody can plug in my Bootstrap Theme into their own Bootstrap Based WordPress Theme, and it will just work.</p><p>It is a lot constraint, restriction, and direction. But pretty fun as well.</p><p>So with this post I will launch a third blog (in addition to Poetry and Research) and begin musing about Theme Development. I would like this blog section to be bundled with the theme (or along side it) as a kind of a proof of development, and quality.</p>"},{"id":"research-0076","title":"Initial Commit","category":"research","tags":"Bootstrap Theme","date":"2020-04-15T13:01:26.880Z","draft":false,"deleted":false,"published":"Wed Apr 15th 2020, 9:01 AM","html":"<p>Begun work on Theme.</p><p>I want it to be heavy, decorated with 3D-like features.</p><p>Initially want to restyle default bootstrap classes, without introducing any bonus extras.</p><p>I want to keep compatibility with <a href=\"https://github.com/thomaspark/bootswatch/\">Bootswatch</a>.</p><p>This theme needs to be a drop-in replacement for standard <a href=\"https://getbootstrap.com/\">Bootstrap</a> and <a href=\"https://github.com/thomaspark/bootswatch/\">Bootswatch</a> themes.</p>"},{"id":"poetry-0034","title":"Artist and Art","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-15T01:17:02.012Z","draft":false,"deleted":false,"published":"Tue Apr 14th 2020, 9:17 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Twenty Nine,</p><p>I spent the day doing Graphic Design.</p><p>Making art and poetry is quite fun,</p><p>though with the aid of computers, easily overdone.</p><p>I&apos;ve been doing this for so long, that I&apos;ve learned,</p><p>that, on computers, brevity is the Mother of Invention.</p><p>I am a huge fan, of the UNIX command line,</p><p>of the various little ways to get things done.</p><p>Graphic design, takes a different path,</p><p>it takes a while to switch between the two.</p><p>Programming languages, is where I spend most of my time,</p><p>its an in-between world, betwixt the two.</p><p>I&apos;ve been programming Music and Art,</p><p>It turned out not to be that hard.</p><p>At the end of the day, what matters is the Masterpiece,</p><p>it matters not if it comes from Computers, Music or Art,</p><p>So as long as you finish what you start, and use your hart,</p><p>you are an Artist, and what you make, is Art.</p>","audio":"audio/poetry-0034.mp3"},{"id":"research-0075","title":"I Just Finished Another Upgrade For And It Can Make Ice Cream Now I Also Made A Couple Of Profiles Lemon And Blueberry To To...","category":"research","tags":"Programming","date":"2020-04-15T00:20:18.443Z","draft":false,"deleted":false,"published":"Tue Apr 14th 2020, 8:20 PM","html":"<p>I just finished another upgrade for <a href=\"http://catpea.com/designer\">Designer</a> and it can make Ice Cream now. I also made a couple of Profiles (Lemon and Blueberry) to toggle between and the transition is animated.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0075-icecream.jpg\" alt=\"Icecream\"></p><p>Making Ice Cream</p><p>This tool should be enough to begin with interesting UI Themes.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0075-tool1.png\" alt=\"Tool 1\"></p><p>Updated User Interface</p><p>Just to remind, my aim is a product on <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a> that looks something like this:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0075-real.jpg\" alt=\"Real\"></p><p>What I need to start building.</p><p>But the <a href=\"https://www.youtube.com/watch?v=gT0Lh1eYk78\">CSS</a> language is not happy about making 3D things, and artful little digital frescos, so I have to make a few little tools.</p><p>To celebrate this little programming milestone I temporarily added the &quot;Heavy Metal&quot; <a href=\"http://catpea.com/designer\">Designer</a> Preset to all boxes on CATPEA.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0075-all.png\" alt=\"All\"></p><p>Looks Interesting</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0075-interesting.png\" alt=\"Interesting\"></p><p>Looks Interesting</p>"},{"id":"research-0074","title":"I Am Still Working On I Found Some Graphic Artifacts With Yesterdays Approach Now I Am Creating The 3 D Raised Effect With Dro...","category":"research","tags":"Programming","date":"2020-04-14T19:16:55.040Z","draft":false,"deleted":false,"published":"Tue Apr 14th 2020, 3:16 PM","html":"<p>I am still working on <a href=\"http://catpea.com/designer\">Designer</a> I found some graphic artifacts with yesterday&apos;s approach, now I am creating the 3D raised effect with Drop Shadows, rather than inner shadows.</p><p>This means that I can color the inside of the box with a bit more creativity.</p><p><a href=\"http://catpea.com/designer\">Designer</a> is still in early stages, I have to add profile support, probably restructure the flow control as well. But it will forever solve the problem of 3D raised boxes in themes.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0074-box1.png\" alt=\"Box 1\"></p><p>Three Shadows to Simulate Surface</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0074-box2.png\" alt=\"Box 2\"></p><p>Close Up</p><p>And here is what is actually going on. This show the places where colors are placed to give a 3D effect.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0074-box3.png\" alt=\"Box 3\"></p><p>Color Revelation</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0074-box4.png\" alt=\"Box 4\"></p><p>Color Revelation</p><p>Orange is where the highlight color lives.</p><p>Red, Green, Blue, are combined together to create smooth surface that created the 3D effect.</p><p>Yellow is the subtle Drop Shadow that is cast on the page background.</p>"},{"id":"poetry-0033","title":"Cogitate and Percolate.","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-14T03:37:07.557Z","draft":false,"deleted":false,"published":"Mon Apr 13th 2020, 11:37 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Twenty Eight,</p><p>It&apos;s evening and it&apos;s late,</p><p>Time for another poetic update,</p><p>I sit here, and yet again, cogitate.</p><p>It actually feels pretty great,</p><p>I look forward to my little poetry date.</p><p>And I always try to really concentrate,</p><p>turn everything off and meditate.</p><p>Let all those rhymes percolate.</p><p>Let all those words decorate.</p><p>Poetry is a universe in self,</p><p>it won&apos;t always let you write what you are trying say.</p><p>I just want to rhyme something funny,</p><p>write about weather or how its sunny.</p><p>But each poem has a mind of its own,</p><p>each one is a kind of a milestone.</p><p>There is a thousand ways to get to the end,</p><p>but it all depends if the message is,</p><p>what you intend.</p>","audio":"audio/poetry-0033.mp3"},{"id":"research-0073","title":"Research Designer Png Designer Gui Preview I Have Managed To Create A Little Tool Named Mostly For Desktops The Tool Sets On...","category":"research","tags":"GUI Programming","date":"2020-04-14T01:45:49.801Z","draft":false,"deleted":false,"published":"Mon Apr 13th 2020, 9:45 PM","html":"<p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0073-designer.png\" alt=\"Designer\"></p><p>Designer GUI Preview</p><p>I have managed to create a little tool named <a href=\"http://catpea.com/designer\">Designer</a>, mostly for Desktops. The tool sets only three things, the top highlight, the bottom shade, a drop shadow that it casts on the background.</p><p>Our sample image has more shadows, more blending, it is precise with its colors, and my tool can do that as well, and without making the UI much more complex.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0073-real.jpg\" alt=\"Real\"></p><p>Real Design</p><p>I am only focusing on the box around the components, so in this case it is the thing that makes the Audio Player look 3D, like it has a height.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0073-real2.png\" alt=\"Real 2\"></p><p>Real Design</p><p>From what my eyes can see here, he set the top highlight to be 1 pixel, bottom shade about 6, and he is using a subtle 4 pixel drop shadow. Alone, these things are almost imperceptible,</p><p>together, they create a convincing 3D effect.</p><p>I believe this is a design by <a href=\"https://dribbble.com/creativemints\">Creative Mints</a> because I noticed <a href=\"https://dribbble.com/shots/864910-Ui-Kit\">something similar</a>.</p><p>And right now, I don&apos;t have any particular design in mind. I am just focusing on creating a tool that gives a convincing 3D effect, in a language called CSS. CSS is not meant for this, but applying a couple of tricks here and there, can actually work, and efficiently, and it would be accepted by the <a href=\"https://getbootstrap.com/\">Bootstrap</a> developers as OK. I did play with this tool for a few minutes, and it needs another layer of shade, to make the bottom border more pronounced, other than that it is about done.</p>"},{"id":"research-0072","title":"Research Real Jpg Real Design Creating Was In Deed A Good Idea The Newest Thing About It Is That It Gives Me The Ability To...","category":"research","tags":"Programming","date":"2020-04-13T14:56:54.894Z","draft":false,"deleted":false,"published":"Mon Apr 13th 2020, 10:56 AM","html":"<p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0072-real.jpg\" alt=\"Real\"></p><p>Real Design</p><p>Creating <a href=\"https://github.com/fantasyui-com/serserge\">serserge</a> was in deed a good idea, the newest thing about it, is that it gives me the ability to query <a href=\"https://getbootstrap.com/\">Bootstrap</a> source-code for things like: &quot;Hey! which things in the source-code have a background?&quot;</p><p>Armed with this information I can mark components and their pieces for cloning (making my own copy) and then editing.</p><p>Now, the next step is DESIGN. The <a href=\"https://catpea.com/research/real.jpg\">image up top</a> (click to zoom) is a really good example of what design is... design makes you look.</p><p>Design is Pleasant.</p><p>Design, like a Remix of a Song, changes as not to bore.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0072-real1.jpg\" alt=\"Real 1\"></p><p>Real Design</p><p>I am going to make a new tool, here for catpea where I study certain approaches to creating artistic accents.</p><p>I have previously experimented with this by having created <a href=\"https://github.com/fantasyui-com/skins\">skins</a>, <a href=\"https://fantasyui-com.github.io/neumorphism/\">neumorphism</a>, <a href=\"https://fantasyui-com.github.io/fantasy-gui/\">fantasy-gui</a>, <a href=\"https://fantasyui-com.github.io/synthwave/\">synthwave</a> and <a href=\"https://github.com/fantasyui-com/color-schemes\">color-schemes</a>. For this first one I&apos;ll keep things even simpler.</p>"},{"id":"poetry-0032","title":"I write.","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-13T02:45:44.310Z","draft":false,"deleted":false,"published":"Sun Apr 12th 2020, 10:45 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Twenty Seven,</p><p>Ohh, I waited to write until eleven.</p><p>It seems late at night,</p><p>but this is when my rhymes take flight.</p><p>I admit, I am ready for bed,</p><p>but I am just going to sit here, instead,</p><p>and wait for my poem to go ahead.</p><p>Nuh uhh, rhyming is not always easy,</p><p>sometimes you just got to to wait, and take it easy.</p><p>Wait for the prime rhyme,</p><p>to top of your mind... climb.</p><p>And then finally, when you get there,</p><p>you sit, read, and stare,</p><p>feeling like the poem, is a little bare.</p><p>But what can you do? It&apos;s late at night,</p><p>and you are not really feeling very bright.</p><p>But you still have to write,</p><p>so that&apos;s quite all right.</p><p>This is how I begin my night,</p><p>I write.</p>","audio":"audio/poetry-0032.mp3"},{"id":"research-0071","title":"Research Mm Png Sunday Mascot I Continue Adapting My Strategy For Approaching Automated Processing I Created A Program That C...","category":"research","tags":"Bootstrap Programming","date":"2020-04-12T18:03:06.437Z","draft":false,"deleted":false,"published":"Sun Apr 12th 2020, 2:03 PM","html":"<p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0071-mm.png\" alt=\"Mm\"></p><p>Sunday Mascot</p><p>I continue adapting my strategy for approaching automated <a href=\"https://getbootstrap.com/\">Bootstrap</a> processing. I created a program that creates a little overview of thier code for me, my program is able to understand all of their code now.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0071-overview.png\" alt=\"Overview\"></p><p>Bootstrap Code Overview</p><p>Overall, they come in with just about 5700 statements, talking about color, and text padding, and and little quirks and tricks. Looking over their work, I realized, If I touch any of this code they will hate me, with a passion.</p><p>If I am to get accepted into <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a></p><p>I can&apos;t automatically process their things, I have to make copies.</p><p>For example: the Navbar on top of this web page is a lot of work, a lot of balancing and tweaking, and option adding.</p><p>The only way I can touch it, is by making a copy, calling it SuperNavbar. And here, in the SuperNavbar, I can strip down colors, and apply my magical animations, and bits, and things.</p><p>Well, that&apos;s progress. Progress with a bonus. Because at any point users can fall back on the original Navbar, and there is a couple ways to do that even. Anymore, work must arise from my Static Code Analysis here, from my little tools.</p><p>At this point the Greatest Secret in Good Programming is kicking in: Rather than doing what I think I should do. I should do what is possible to do, with a hefty dose of code integrity, and program stability.</p><p>More than that, my theme, my designs, should apply to many versions of Bootstrap, many of the <a href=\"https://getbootstrap.com/docs/versions/\">past releases</a> - that&apos;s just good programming.</p><p>Even if I stick to the v4.x branch (which is most reasonable), I will need to release 5 of 6 versions of my theme, and then maybe three more after that.</p><p>I am very well aware, what a punch in the stomach all this is to the designers. The stuff that I am working on here, is really uncomfortable for most Designers. They don&apos;t want to process abstract syntax trees, or learn programming even.</p><p>Also, a little twinkle of a business perspective is bubbling up here. Automated processing means bug free product, fast upgrades, fast support.</p><p>But still, I am not sure what I will do to automate Design, once I do have SuperNavbar, presumably with all colors removed, and I make some classes like I have in <a href=\"http://catpea.com/theme\">Theme</a> right now, to apply color to things, an interactive color, that supports mult-color-websites and multiple dark themes.</p><p>Vary some fonts, and padding, and margins. I am still stuck with, what is basically... a <a href=\"https://bootswatch.com/\">basic theme</a>.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0071-basic.png\" alt=\"Basic\"></p><p>Basic Theme</p><p>I still have to come up with a Robotic Artist, that actually does <a href=\"http://pixelkit.com/kits/gui/\">real design</a>.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0071-real.jpg\" alt=\"Real\"></p><p>Real Design</p><p>But... I think I know how to do that. You know how Megaman can <a href=\"https://youtu.be/3ufVQIUEiYc?t=40\">inherit weapons from their enemies by touch</a>.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0071-megaman.jpg\" alt=\"Megaman\"></p><p>Design Inheritance</p><p>I think I can make some basic designs like beautifully styled boxes, and then AIM THEM AT SuperNavbar and SuperCard, and fire.</p><p>SuperNavbar would then inherit properties of those Artistic Designs, background skin, inner shadow, blend gradients. Art is actually easy. I don&apos;t think anyone should ever sit down to decorating Navbars, the decorations must be carbon copied from something simpler, and certainly more reusable. THis way multiple components can be decorated at once.</p><p>Wow, it is 2PM already. I am thinking about a lot of my programming projects at once, this coloring adventure is just relaxations.</p>"},{"id":"poetry-0031","title":"As Good As Fingers","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-12T02:49:24.911Z","draft":false,"deleted":false,"published":"Sat Apr 11th 2020, 10:49 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Twenty Six,</p><p>I eat with metal chopsticks.</p><p>I stopped using forks,</p><p>to munch my porks.</p><p>I don&apos;t even know how long ago it was,</p><p>so long ago, I forgot the cause.</p><p>I own two metal chopsticks,</p><p>and they work as good as fingers.</p><p>I use them to eat my salads,</p><p>to scoop out Jelly and Peanut Butter,</p><p>I kid you not, I even use them as a little cutter.</p><p>A dull stick is just fine to turn a sausage in two.</p><p>And of course, I stir many a tea, or protein brew.</p><p>I do not miss the dangerous forks,</p><p>though once, in a blue moon,</p><p>I wish, I owned a spoon.</p>","audio":"audio/poetry-0031.mp3"},{"id":"research-0070","title":"I Went For The Gold Ive Been Experimenting With Low Level Scss Language Processing For A Goodie Long While Now And I Just Fin...","category":"research","tags":"Bootstrap Programming","date":"2020-04-11T23:55:56.207Z","draft":false,"deleted":false,"published":"Sat Apr 11th 2020, 7:55 PM","html":"<p>I went for the gold, I&apos;ve been experimenting with low level SCSS language processing for a goodie long while now, and I just finished an early test of a program that removes color information from <a href=\"https://getbootstrap.com/\">Bootstrap</a>.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0070-nocolor.jpg\" alt=\"Nocolor\"></p><p>Bootstrap With Color Information Stripped Off</p><p>Buttons are white as that is their uncolored-color, I have access to, probably 100% of code, so if I missed something I can track it down.</p><p>It is hard to estimate the usefulness of this system. But, Bootstrap is being irresponsible with their use of colors, so I remove them. I allow myself to start at zero. It is a consistent surface to work with.</p><p>This wasn&apos;t too hard to code but it took the entire afternoon, like six or seven hours. It is a computer program that I can re-run on every new version of bootstrap. So, nothing they do will mess with my colors.</p><p>I&apos;ll have to think about this some more. If it is at all possible to process Bootstrap automatically, this program is it.</p><p>I called the program <a href=\"https://github.com/fantasyui-com/serserge\">serserge</a> in large part because I only had a Raspberry Salad yesterday (Shredded Lettuce with Raspberry Preserves) as part of my extremely sophisticated diet, and here is the main <a href=\"https://github.com/fantasyui-com/serserge/blob/master/plugins/postcss-reconnaissance/index.mjs\">beef</a> that removes color related information: <a href=\"https://github.com/fantasyui-com/serserge/blob/master/plugins/postcss-reconnaissance/index.mjs\">beef</a>. I can&apos;t believe this took six+ hours, maybe my daydreams are just longer. Hmm.</p>"},{"id":"research-0069","title":"I Had To Disable Automatic Color Changes I Am Using A System Here That Takes A Snapshot Of The Code And Uploads That Snapshot...","category":"research","tags":"Bootstrap Programming","date":"2020-04-11T16:10:41.703Z","draft":false,"deleted":false,"published":"Sat Apr 11th 2020, 12:10 PM","html":"<p>I had to disable automatic color changes. I am using a system here that takes a snapshot of the code, and uploads that snapshot to catpea.com, that snapshot is shown to you before the real code loads. This helps the search engines process data, it improves load times by a huge amount. When I generate a website at noon, it will be bright, when I generate it at night it will be dark, this introduces complexity to something as silly as night mode. I just have the night mode run in manual now. By default the website is bright, and if the user clicks the light bulb it will switch to dark.</p><p>It is a fun problem, it actually asks for User Preferences, where the user can put website coloring in manual.</p><p>There is a technological problem lingering here, unfortunately. I can only animate transitions to dark. The system us unable to smoothly transition back to bright. This is a problem with <a href=\"https://getbootstrap.com/\">Bootstrap</a>&apos;s color information. Colors are so different from layout, that they should live in their own file, with their own programming. In Bootstrap 4.5.x this is not the case, and the code is ugly. In 5.0 they maybe fixing this (I am guessing), but it will forever be their solution, and they are unlikely to focus on nice to haves like smooth animations between color modes</p><p>I need to take over <a href=\"https://getbootstrap.com/\">Bootstrap</a>&apos;s Colors. This is not easy. But I&apos;ve done it before. I nuked all the color declarations and automatically built a separate color file. It was a sophisticated, but primitive experiment. But automatic color declaration removal is critical, as Bootstrap changes their code all the time. With each new version I have to revise my code, that&apos;s not cool. With automatic processing, that will be much easier.</p><p>See, coloring is not just about making a pretty scheme, it is a hard problem, and it requires hard programming, like parsing the SCSS code-base, deleting declarations in the Abstract Syntax Tree (AST), then dumping it back into a mere bootstrap.scss file. Then programming a general purpose coloring system capable of accounting for all the missing colors. I am going to leave this for later, automated processing is never without problems. Goodness knows, Bootstrap is trying to keep the colors kind of outside of the main coed base, but the functions that apply colors are still un-uniform and deeply burred.</p><p>To be realistic about what can be achieved in the <a href=\"https://getbootstrap.com/\">Bootstrap</a> 4.0.x - 5.0 realm, I think I can only change the HUE, I can go from their blue to Orange, but I can&apos;t make the orange too dark, or too bright. This still solves the coloring problem, it is an extremely simple and effective solution</p><p>There is yet another way of looking at color, and that is seeing it in relation to how readability is impacted. It would be possible to go from White-on-Blue to White-on-Yellow, so as long as I carefully calculated <a href=\"https://www.w3.org/TR/WCAG20-TECHS/G18.html\">wcag-contrast</a>, and altered the yellow to be within the same (or similar) range as blue.</p><p>Playing with color now.</p>"},{"id":"poetry-0030","title":"Citizens of The World","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-11T03:42:57.257Z","draft":false,"deleted":false,"published":"Fri Apr 10th 2020, 11:42 PM","html":"<p>Captain&apos;s Log, Quarantine, Day Twenty Five,</p><p>Yesterday, Bernie dropped out.</p><p>I didn&apos;t even try to wait, you can&apos;t place this much weight.</p><p>And what were we expecting?</p><p>It has always been like this, hit and miss.</p><p>It is time for all, to rise.</p><p>Become a Citizen of The World. In your own hands.</p><p>With your own mind. Seek Knowledge and Triumph.</p><p>Let the name of this New Nation be, Earth,</p><p>May the Citizen be called, a Human.</p><p>The power is in your hands, so near,</p><p>rooted in every audio-book you can hear.</p><p>And you have to lean to rise,</p><p>you can&apos;t near the skies,</p><p>without your eyes!</p><p>When you have learned enough, you have to turn around and teach.</p><p>Yell from your mountain, scream, dance and preach.</p><p>The promise of Freedom, Reason, and Peace,</p><p>is in our hands, it is our Masterpiece.</p><p>Education is <a href=\"http://catpea.com/warrior\">fun</a> it only ever seems hard,</p><p>because one is trying to learn too much in too little time.</p><p>The only way we can fully learn,</p><p>is by inheriting knowledge from World&apos;s most beloved Heroes.</p><p>This inheritance begins by following in their footstep, first;</p><p>and continues, when we break away to resume where they left off.</p><p>Rise, rise to the mountains before you.</p><p>The only way,</p><p>is to go up,</p><p>to grow up,</p><p>to grow all the way up,</p><p>until we each become a Great Being.</p><p>Same as those before us,</p><p>same as those that are sure to rise.</p><p>Open Your Eyes.</p><p>The Time is Always Now.</p>","audio":"audio/poetry-0030.mp3"},{"id":"research-0068","title":"Huge Problems With Mixing Colors It Is Not Really Possible To Use Yellow On White Now I Kind Of Have The Heads Up Yellow Is...","category":"research","tags":"Programming","date":"2020-04-10T22:17:27.567Z","draft":false,"deleted":false,"published":"Fri Apr 10th 2020, 6:17 PM","html":"<p>Huge problems with mixing colors. It is not really possible to use yellow on white. Now, I kind of have the &quot;Heads up yellow is being used on white&quot; information and and I can attempt to program a solution, but, perhaps, I am thinking about it wrong.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0068-color-mixing.png\" alt=\"Color Mixing\"></p><p>Huge Problems with Mixing Colors</p><p>I reset almost all text-colors on CATPEA to black. Everything looks OK. So I am at a, really, good point.</p><p>I also ran some experiments that do work, and show promising results.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0068-color-mixing-trial-1.png\" alt=\"Color Mixing Trial 1\"></p><p>Good Results via The HSL/HSV Model</p><p>The <a href=\"https://www.youtube.com/watch?v=NAw2_NtGNaA\">HSL</a>/<a href=\"https://www.youtube.com/watch?v=yNgH3wv4crg\">HSV</a> color models are more than just models. They are tools, that yield themselves to manipulating colors via color theory. In color theory we have notions of colors that are opposite on a circle, and here we have a cylinder, shaped to work with that theory.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0068-hsl.png\" alt=\"Hsl\"></p><p>HSL Model</p><p>It makes sense that <a href=\"https://getbootstrap.com/\">Bootstrap</a> developers wouldn&apos;t want to touch this. They are developing a framework, not really a theme.</p><p>I am developing a Theme, that heavily deals with color and several additional components.</p><p>I am going to create, what is probably going to end up being an extended color set that pushes default colors, for example red, into HSL world, creating something like red-25 red red-75, where the middle red is the actual color the user selected, but red-25 will always be half of red in terms of Saturation and Luminosity, conversely red-75 will have a-half-more of saturation and luminosity. Enough so that text in red on red-25 background will be guaranteed to be readable.</p><p>If this does not work out, then I&apos;ll create an extended palette of all colors and just name them red-dark and red-light.</p><p>And if this fails, then the only two colors the user will get to keep will be Primary and Secondary, everything else will be strictly computer generated. They will use Primary/Secondary at their own risk, and on a background that they know fits.</p><p>All these approaches are meant to eliminate color clashing, which is the number one problem in Bootstrap.</p>"},{"id":"research-0067","title":"Research Dexter Png My Laboratory Is Cat Pea Oh Noes Added Site Wide Support For Night Day Mode I Thought It Was A Bit...","category":"research","tags":"Programming","date":"2020-04-10T17:27:13.602Z","draft":false,"deleted":false,"published":"Fri Apr 10th 2020, 1:27 PM","html":"<p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0067-dexter.png\" alt=\"Dexter\"></p><p>My laboratory, is Cat Pea... Oh noes...</p><p>Added site-wide support for Night/Day mode. I thought it was a bit hokey at first, but it is solid, it is good, a round of tests will make it perfect.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0067-pixels.png\" alt=\"Pixels\"></p><p>Chromatic Storytelling Sample</p><p>The backgrounds are inspired by Interstellar and Life Aquatic with Steve Zissou. Take a look at <a href=\"https://towardsdatascience.com/exploring-chromatic-storytelling-with-r-part-1-8e9ddf8d4187\">Chromatic Storytelling</a> to see how they extracted scenes from movies to get a new view of the classics.</p><p>In the day mode I use pixels from Life Aquatic with Steve Zissou, during the night I use pixels from Interstellar.</p><p>The night more is automatically enabled between 8PM and 6AM. I hope 6AM is not too early.</p><p>So, of course, there is this crazy little temporal consequence associated with this. When clicking the light-bulb I can&apos;t just say it is night or day because the computer is now calculating this.</p><p>Now I must ask for allowance, a grace period when I can override the computer&apos;s idea a of day.</p><p>So when I force night-mode during the day, the computer will reset back after 12 minutes. I think this is funny.</p><p>(Oh, and it is 12 minutes, because my Linux monitor goes to sleep after 15, no matter what. So to test the system, it has to be less than 15)</p><p>I remember the day, I got my self into all this ridiculousness. People kept saying &quot;Computers are the future&quot;, and the little me was like &quot;Hey, I am trying to get my future all sorted out, why don&apos;t I learn computers? After all, it is the future!&quot;</p>"},{"id":"poetry-0029","title":"History of the World","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-10T01:35:43.133Z","draft":false,"deleted":false,"published":"Thu Apr 9th 2020, 9:35 PM","html":"<p>Captain&apos;s Log, Quarantine Serserge, Day Twenty Four,</p><p>I am ready to jump into my bed like a big dinosaur.</p><p>I am dressed, I am wearing my favorite workout clothes,</p><p>I stretched left and right, and fluffed up my pillows.</p><p>For tonight, I prepared, a Bill Bryson Auidobook I adore,</p><p>Even though I am already so sleepy that I could snore.</p><p>I will listen about the <a href=\"https://www.audible.com/pd/A-Short-History-of-Nearly-Everything-Audiobook/B002V0KFPW\">History of the World</a>,</p><p>about all the mysterious things and places we explored.</p><p>This is how I go to sleep every night,</p><p>the book will slowly play... until daylight.</p><p>I learned so much from online lectures and audio books,</p><p>that these days, I can focus on my good looks.</p><p>Oh, how I miss working out at the gym,</p><p>but I am still working hard to be slim.</p><p>Let us all be of good cheer,</p><p>quarantine will be over soon,</p><p>that is clear.</p>","audio":"audio/poetry-0029.mp3"},{"id":"research-0066","title":"Yay Night Mode Seems To Have Worked Out I Even Gave It Nice And Tidy Animation Had A Light Bulb Icon For Me So It All Went S...","category":"research","tags":"Programming","date":"2020-04-09T22:07:45.885Z","draft":false,"deleted":false,"published":"Thu Apr 9th 2020, 6:07 PM","html":"<p>Yay, Night Mode seems to have worked out, I even gave it nice and tidy animation. <a href=\"https://octicons.github.com/\">Octicons</a> had a light bulb icon for me so it all went smoothly. Give it a try, go to the <a href=\"http://catpea.com/research\">Research</a> page, put on some shades, and click on the <img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0066-light-bulb.svg\" alt=\"Light Bulb\"> icon &#x2191;.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0066-bulb.png\" alt=\"Bulb\"></p><p>Night Mode Toggle</p>"},{"id":"research-0065","title":"I Might Have Come Up With A Way To Toggle Night Mode On Websites Even Dark Ones I Did This With Just Two Lines Of Code Basica...","category":"research","tags":"Programming","date":"2020-04-09T21:22:15.282Z","draft":false,"deleted":false,"published":"Thu Apr 9th 2020, 5:22 PM","html":"<p>I might have come up with a way to toggle night mode on websites, even dark ones. I did this with just two lines of code. Basically what it came down to was asking, &quot;What am I going to do with a red/danger alert box, during night mode?&quot; And the answer is, it had to dark, everything has to be dark in night mode. There cannot be colorful things and especially things with backgrounds.</p><p>HUGE BONUS! Applications that are written dark, that look good in dark colors, do not, at all, require dark more. It is simple and logical, but get this: Applications that are Bright, Silver, as most applications are... MUST BE REWRITTEN TO SUPPORT NIGHT MODE. Isn&apos;t that unusual. All my work does not need any changes because it is already in dark more.</p><p>So, on this website, I don&apos;t really need night mode. But, as experimental research goes I do need a system for it. So here is how this will work. This very page, The Research Blog, will be the first one to get night mode, and will be put in dark more by default. Now if somebody wants DAY MODE, then they can switch it off, and the page will become blinding.</p><p>I&apos;ll work on that for a couple of hours, it shouldn&apos;t take long, I already have a demo on the <a href=\"http://catpea.com/theme\">Theme</a> page.</p>"},{"id":"research-0064","title":"I Fixed Up The Page Where I Show Off Some More Advanced Backgrounds But Overall This Has Been A Study Of Color Not Just How...","category":"research","tags":"Programming","date":"2020-04-09T19:29:25.681Z","draft":false,"deleted":false,"published":"Thu Apr 9th 2020, 3:29 PM","html":"<p>I fixed up the <a href=\"http://catpea.com/theme\">Theme</a> page where I show off some more advanced backgrounds. But, overall this has been a study of color. Not just how to create the palettes but how to configure colors in bootstrap.</p><p>This is a small success. Basically, it comes down to not using any text colors unless it is necessary, at which point make sure the background matches. As to background colors, the primary color doe backgrounds is bg-dark, or if it is a white website then bg-light. The coloring has to be used as little as possible because it does not really work.</p><p>Since I am using a programmable component layer over <a href=\"https://getbootstrap.com/\">Bootstrap</a>, I can automate colorification, combined with the notion that it must be used sparingly. I&apos;ll be able to create multicolored websites soon, or as the case might be, websites with multiple coherent color themes.</p><p>This was more difficult than I expected. And when complete it will be quite a framework for web applications.</p>"},{"id":"research-0063","title":"I Upgraded And Begun Using It Somewhat The Website Has New Colors That Almost Came Directly From Getting Colors To Like Each...","category":"research","tags":"Bootstrap Programming","date":"2020-04-09T15:55:13.217Z","draft":false,"deleted":false,"published":"Thu Apr 9th 2020, 11:55 AM","html":"<p>I upgraded <a href=\"http://catpea.com/palette\">Palette</a> and begun using it somewhat. The website has new colors that almost came directly from <a href=\"http://catpea.com/palette\">Palette</a>.</p><p>Getting colors to like each other is not easy, but that&apos;s why <a href=\"http://catpea.com/palette\">Palette</a> exists. It is crafted towards generating those six colors (Primary, Secondary, Success, Info, Warning, Danger) in such a way that they will blend together in harmony.</p><p>I will need more preview arrangements, I need to be able to see what colors work well with the primary background. But this is easy, and every color has a separate slider, for a Human-based adjustment. So it is not just color theory, but also good taste.</p><p>I learned a lot about working with bootstrap these past few weeks, while I did well designing all the widgets, I still wasn&apos;t too certain about what colors I could use in which places.</p><p>I have learned that Primary, Secondary and White, are the main colors, if I need to make something jump out that&apos;s all I got. Success, Info, Warning, Danger are for non-creative decorations. And there is also two more colors Dark and Light. And I use these for backgrounds only. A dark website will use bg-dark for all the widgets, and a white website will use bg-light. There isn&apos;t really a way to flip-flop between the two without human intervention. In a couple of months I could outline a plan that would allow switching between dark and white. Personally, I think all websites and applications should be dark. I&apos;ll make a website that can switch between the two, but that will take some experimenting. <a href=\"https://getbootstrap.com/\">Bootstrap</a> is the same way, they basically say if you want something dark say bg-dark+text-light and that hard-coded into the design. I would need to make a program that toggles between bg-dark+text-light and bg-light+text-dark on application level (a tier above the design).</p>"},{"id":"poetry-0028","title":"Peanut Butter and Jelly","category":"poetry","tags":"Listen Poem Quarantine","date":"2020-04-09T03:01:38.615Z","draft":false,"deleted":false,"published":"Wed Apr 8th 2020, 11:01 PM","html":"<p>Captain&apos;s Log, Quarantine Fiveever, Day Twenty Three.</p><p>It was a super busy day, not a moment for tea.</p><p>And I keep Programming late into the night,</p><p>typing like a Lion with all his might.</p><p>This morn, I woke up and made Peanut Butter and Jelly,</p><p>I&apos;ve been programming all day, I keep going like the telly.</p><p>Now, I am trying to figure out, a datatype for verse,</p><p>my stanza CSS padding and margins are intense.</p><p>I am not trying to be a hero, hey!</p><p>but I am writing this, in a <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array\">JavaScript Array</a>!</p><p>I don&apos;t know if there is anymore I can say,</p><p>other than that I am OK,</p><p>and that this has been an OK day.</p><p>No wait, I&apos;ll add this:</p><p>I wish everyone pure bliss!</p>","audio":"audio/poetry-0028.mp3"},{"id":"research-0062","title":"I Created A New Tool I Named This Time It Deals With Color Theory Right Now It Is Focused On The Five Primary Colors That Most...","category":"research","tags":"Programming","date":"2020-04-08T23:35:35.074Z","draft":false,"deleted":false,"published":"Wed Apr 8th 2020, 7:35 PM","html":"<p>I created a new tool I named <a href=\"http://catpea.com/palette\">Palette</a> this time it deals with color theory.</p><p>Right now it is focused on the five primary colors that most designers use.</p><p>In context of this tool they are labeled: Primary, Secondary, Success, Info, Warning, Danger.</p><p><a href=\"https://getbootstrap.com/\">Bootstrap</a> developers call them contextual colors.</p><p><a href=\"https://www.youtube.com/watch?v=NN5h6Uwtqzw\">Color Theory</a> is a tiny-tiny little bit more complicated than adjusting colors and themes.</p><p>But it is not very complicated. Most often it is just a cylinder of hues with colors going around.</p>"},{"id":"research-0061","title":"I Wanted To Quickly Demonstrate What I Mean When I Say The Ui Works On Both Mobile Devices And Desktop Computers The First Imag...","category":"research","tags":"Programming","date":"2020-04-08T23:01:17.448Z","draft":false,"deleted":false,"published":"Wed Apr 8th 2020, 7:01 PM","html":"<p>I wanted to quickly demonstrate what I mean when I say the UI works on both Mobile Devices and Desktop Computers. The first image shows the application in desktop mode, and second on mobile. I cut the mobile up into columns because the image was too long. What happends is that the Desktop version collapses into a single long column on mobile. The application is still usable on mobile. This is not always the case with other applications, people don&apos;t always build the layout right.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0061-desktop.png\" alt=\"Desktop\"></p><p>Application In Desktop Mode</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0061-mobile.png\" alt=\"Mobile\"></p><p>Application In Mobile Mode (I had to cut it up in multiple columns)</p>"},{"id":"research-0060","title":"I Finished Laying Down The Groundwork For Components As Predicted There Is Wisdom In Following Bootstraps Conventions The...","category":"research","tags":"Programming","date":"2020-04-08T16:28:09.783Z","draft":false,"deleted":false,"published":"Wed Apr 8th 2020, 12:28 PM","html":"<p>I finished laying down the groundwork for <a href=\"https://getbootstrap.com/\">Bootstrap</a>+<a href=\"https://svelte.dev/\">Svelte</a> components. As predicted, there is wisdom in following Bootstrap&apos;s Conventions. The code is short, clean and lightweight.</p><p>I only styled the big grid in <a href=\"http://catpea.com/daw\">CATPEA DAW</a> this is a lot of work, or at least getting it off the ground initially was a lot of work. Now that I know how to structure things, things will move faster.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0060-gui5.png\" alt=\"Gui 5\"></p><p>Fully Styled Component</p><p>Here is the <a href=\"https://github.com/fantasyui-com/catpea-com/blob/b79570e6459d128d3ecb79ed478ffe65fb23759c/src/style/daw/daw.scss\">graphics programming language</a> and the <a href=\"https://github.com/fantasyui-com/catpea-com/blob/b79570e6459d128d3ecb79ed478ffe65fb23759c/src/components/song-machine/Form.svelte\">actual code of the musical form component</a> it is very compact, but there are multiple layers of programming conventions here, ew, ew.</p><p>I should add that this grid is where the user structures a part of a song, for example The Intro. Each cell in here represents about 16 notes that can be inserted. But also, once the user establishes those 16 notes, they only need to worry about lighting those buttons up, it is always the same 16 notes per row... they just select where those notes are active. And beneath this grid is a list of instruments, and places where those 16 notes go. If the user places sharp-drums as the first instruments, selects all 16 note-spots, then it will play tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk-tsk BUT ONLY IF THE cell in the thing pictured above is lit. So this grid is an activator of melodies. Which are created in the thing pictured below:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0060-gui6.png\" alt=\"Gui 6\"></p><p>Yet Un-styled Melody Maker Component</p>"},{"id":"research-0059","title":"Clarification As To Why My Development Is Taking So Long While I Am Developing Some Programs That Are Best On The Desktop...","category":"research","tags":"Programming","date":"2020-04-08T13:52:16.396Z","draft":false,"deleted":false,"published":"Wed Apr 8th 2020, 9:52 AM","html":"<p>Clarification as to why my development is taking so long. While I am developing some programs that are *best* on the desktop. I am actually developing User Interfaces that work on Mobile Phones, and &quot;grow&quot; to fit tablet and desktop. Making user interfaces that work property on Mobile and Desktop is kind of hard, the more detailed they become the harder it is to ensure compatibility.</p>"},{"id":"poetry-0027","title":"Save The Files","category":"poetry","tags":"Poem Quarantine","date":"2020-04-08T01:41:32.088Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 9:41 PM","html":"<p>Captain&apos;s Log, Eternal, Quarantine, Day Twenty Two.</p><p>Eeeeek! It&apos;s raining, I am trying not to be complaining.<br>\nBut the sky is no longer blue, what am I to do?</p><p>Each time I sneeze, the power goes out,<br>\nnot to say my sneezes are not petite, or that I am ill!</p><p>No, I am perfectly fine, I don&apos;t need to blow my nose.<br>\nIt is the transformer outside that blows!</p><p>Frantically, atomically I hit CTRL+S, CTRL+S, save, save. Saves,<br>\nas the thunderous thunder thunders its electromagnetic waves.</p><p>How am I going to finish, how can I upload,<br>\nwhen any moment something will explode,<br>\nand there will be nothing where current once flowed.</p><p>While the rain has slowed, my fingers still tapping,<br>\nSave, save, save! rise! against the Gigawatt Wave.</p><p>Seriously, please remember to save your files,<br>\nthis can only result in more smiles.</p><p>Also, please remember to backup your files.<br>\nAs that&apos;s even better, by miles.</p>"},{"id":"research-0058","title":"Yup It Was A Github Problem They Only Serve Regularly Named Files Everything Was Fine On My End On My Local Servers But The...","category":"research","tags":"Programming","date":"2020-04-08T01:41:32.088Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 9:41 PM","html":"<p>Yup, it was a github problem, they only serve regularly named files. Everything was fine on my end, on my local servers. But the moment website was uploaded to their server, it would refuse to serve some files. So, on my computer the program ran fine, on github&apos;s it was missing files as the server would not serve them just give a File Not Found 404. Pretty awful, I couldn&apos;t fully investigate the problem until I uploaded to github where the error was occurring.</p>"},{"id":"research-0057","title":"I Am Testing The Other Stuff I Added Now I Narrowed Down Problems Down To One Thing So If Something Is Still Broken Ill Fix It...","category":"research","tags":"Programming","date":"2020-04-07T21:11:12.541Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 5:11 PM","html":"<p>I am testing the other stuff I added now. I narrowed down problems down to one thing so if something is still broken I&apos;ll fix it now. I wrote a <a href=\"https://github.com/fantasyui-com/catpea-com/blob/master/bugfix-commonjs-helpers.sh\">cute little program</a> to apply the bug fixes. It is in a language called <a href=\"https://en.wikipedia.org/wiki/Bash_%28Unix_shell%29\">Bash</a> (<a href=\"https://www.youtube.com/watch?v=v-F3YLd6oMw\">Bash Tutorial</a>). It is my pet language. Not favorite, but like a bitey pet Lynx type of thing. All my music processing software that I used at the gym was written in Bash. It is an old language.</p>"},{"id":"research-0056","title":"Another Website Crash Isnt Reporting Errors Properly Working On It Now I Think I Know What Is Going On But It Is Just A Th...","category":"research","tags":"Programming","date":"2020-04-07T19:44:14.734Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 3:44 PM","html":"<p>Another website crash, <a href=\"https://svelte.dev/\">Svelte</a> isn&apos;t reporting errors properly. Working on it now. I think I know what is going on, but it is just a theory for now. Microsoft is is rolling out github server upgrade, and unusual file-names are causing errors. I got errors from files starting with dot and files starting with underscore. This will fix problems, but I don&apos;t know if it is the exact problem I have here, right now.</p>"},{"id":"research-0055","title":"The Navbar Kerfuffle","category":"research","tags":"Bootstrap Programming","date":"2020-04-07T18:43:22.379Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 2:43 PM","html":"<p>When on Mobile/Tablet (or in a small Desktop Window) Website Navigation collapses and shows an open icon (three lines), now when clicked it will open very smoothly. Previously it just popped into existence (I am not a fan of animations like that, but it tends to be a mark of good programming.)</p><p>I continued researching the Navbar issues, and I discovered bootstrap can&apos;t make it work without programming. There is no way to transition the menu from height:0pixels (closed) to height:auto (open) because the underlying language does not concern it self with the measurement of what auto actually means. There are no reasonable ways around it. They are stuck using a <a href=\"https://github.com/twbs/bootstrap/blob/master/js/src/collapse.js\">big program</a> for it. And by big I mean 433 lines of code.</p><p>Let me tell you how many lines my program has.</p><p><a href=\"https://github.com/fantasyui-com/catpea-com/blob/d12cb893c59f447a94b5146c003f457e0122bab8/src/components/Nav.svelte#L2-L4\">ZERO</a> (the three lines are configuration/maintenance not real code)</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0055-wee.png\" alt=\"Wee\"></p><p>Woo! No Code</p><p>The framework I use comes with the collapsing animation built in.</p><p>When I say that <a href=\"https://getbootstrap.com/\">Bootstrap</a> is behind in programming, they are, they really are. <a href=\"https://svelte.dev/\">Svelte</a> has a superior animation subsystem, and there is nothing to compare here.</p><p>In the morning I felt that <a href=\"https://getbootstrap.com/docs/4.4/components/navbar/\">Navbar</a>-<a href=\"https://svelte.dev/\">Svelte</a> integration was problematic, now having taken a closer look, I find their <a href=\"https://github.com/twbs/bootstrap/blob/master/js/src/collapse.js\">big program</a> is the problem here.</p><p>Bootstrap is currently at version 4.4, they are already making big changes for 5.0. I am not the first to notice that their JavaScript is a problem, they will catch up.</p>"},{"id":"research-0054","title":"Dealing With Incompatible Systems","category":"research","tags":"Programming","date":"2020-04-07T13:41:39.748Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 9:41 AM","html":"<p>There are some anomalies in this system but they are easily dealt with.</p><p>This morning I&apos;ve been researching the combination of technologies behind the collapsible Navbar on the top of the page.</p><p>The reason why there is complexity here is screen size reporting, the navbar is structured by a non-programmable language, kind of an automatic language.</p><p>There is no way to say &quot;Oh, the screen size is this much, I&apos;ll do this here, then do that there. Instead what is said is screen size small collapse menu. And nothing else can be said.&quot; With <a href=\"https://svelte.dev/\">Svelte</a> something must be added, svelte has a particular way of approaching animations.</p><p>That means the existing navbar and svelte/programming-framework are incompatible, cannot work together.</p><p>The existing navbar must be removed, and new one must be programmed in.</p><p>This is a large project because of how important compatibility among devices is in this context (main menu can&apos;t fail, otherwise the whole website is broken). BUT! If we allow that <a href=\"https://getbootstrap.com/\">Bootstrap</a> the existing UI framework I use here is a suggestion and collection of snippets. Then, most of this work is already done, I just have to copy Navbar. I&apos;ll create a new program, name it Navigator, and start with the Navbar code base.</p><p>Eventually <a href=\"https://getbootstrap.com/\">Bootstrap</a> people will alter their programming to catch up with technologies like <a href=\"https://svelte.dev/\">Svelte</a> and then I&apos;ll be able to go back to using the standard Navbar.</p>"},{"id":"research-0053","title":"Impossibilities and Superiorities","category":"research","tags":"Programming","date":"2020-04-07T13:12:33.080Z","draft":false,"deleted":false,"published":"Tue Apr 7th 2020, 9:12 AM","html":"<p>I am looking over the code, most things that could be done to make the site better are almost impossible due to the restriction that this meeting of technologies imposes.</p><p>It is the only way to make things actually work.</p><p>The browser was not originally designed for applications. Over last couple of decades it gained technologies that can make applications like CATPEA.</p><p>But that meas balancing multiple technologies, and that balance causes severe restrictions in what can go where.</p><p>I have worked with numerous technologies developed specifically for making Applications, but they are much worse than the upgraded browser.</p><p>This is because nothing has received as much attention as the web. So, even though this technology stack is greatly restricted, it is also very powerful.</p>"},{"id":"poetry-0026","title":"Make Each Day Count","category":"poetry","tags":"Poem Quarantine","date":"2020-04-06T23:25:25.662Z","draft":false,"deleted":false,"published":"Mon Apr 6th 2020, 7:25 PM","html":"<p>Captain&apos;s Log: Quarantine.</p><p>Day Twenty One.</p><p>There is birdsong outside, and I can feel the sun.</p><p>I woke up rested, for the first time, in years.</p><p>My mind was hardly ever tired, but all the rest needed time.</p><p>I am ready for gyms to reopen, It will be so much fun.</p><p>I will dance even faster, workout longer.</p><p>My diet is twice as good as it was before,</p><p>including soup, and proper portion control.</p><p>It took twenty one days,</p><p>for my body to begin recovering from my workouts.</p><p>What a great sadness it would be, to wish now,</p><p>that I should have danced, or tried harder.</p><p>Instead, here I am. Bouncy, and perky as heck,</p><p>Ready to go back.</p><p>Use your days wisely,</p><p>let no day slip away.</p><p>Live, make each day count,</p><p>it all adds together, balance your account.</p><p>What makes us great,</p><p>is the sum of all the days in the past.</p><p>What makes us strong,</p><p>is making each day better than the one before.</p><p>Make each day count,</p><p>enlarge your world.</p>"},{"id":"research-0052","title":"Working With The Gui Testing What I Can Alter What I Cant I Still Have No Idea What Catpea Is Good For What Website Format...","category":"research","tags":"Programming","date":"2020-04-06T22:18:33.170Z","draft":false,"deleted":false,"published":"Mon Apr 6th 2020, 6:18 PM","html":"<p>Working with the GUI, testing what I can alter, what I can&apos;t. I still have no idea what catpea is good for, what website format I should create. There is also a division of widgets forming some are useful tools (Song Beat Counter) others are little information displays (You Tube Videos, Season Countdown). As far as User Interface Design and getting things done goes, it is hard to beat chaos.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0052-gui2.png\" alt=\"Gui 2\"></p><p>UI Thus Far</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0052-gui3.png\" alt=\"Gui 3\"></p><p>UI Thus Far</p>"},{"id":"research-0051","title":"I Am Testing Separate Sections In The Main Menu The Current Scroll Bar Within A Scroll Bar Setup Was For Testing I Wanted To...","category":"research","tags":"Programming","date":"2020-04-06T19:21:21.474Z","draft":false,"deleted":false,"published":"Mon Apr 6th 2020, 3:21 PM","html":"<p>I am testing separate <a href=\"http://catpea.com/quarantine\">Quarantine</a>/<a href=\"http://catpea.com/research\">Research</a> sections in the main menu. The current scroll-bar within a scroll-bar setup was for testing, I wanted to see if it worked or if I needed to so something special. Well, they are both blogs, very similar to the warrior book, they should just have the same UI. This also brings me closer to proper Web Design, where I take a moment to make some fancy graphics to decorate typographical creations.</p>"},{"id":"research-0050","title":"I Continue My Gui Theme Development Research Todays Test Is About Creating A Custom Component For The Digital Workstation My...","category":"research","tags":"Bootstrap GUI Programming","date":"2020-04-06T15:16:22.095Z","draft":false,"deleted":false,"published":"Mon Apr 6th 2020, 11:16 AM","html":"<p>I continue my GUI Theme development research, today&apos;s test is about creating a custom component for the digital workstation. My research revealed that it is more efficient not to use the helper classes I created. By using helper classes such as bg-primary instead of the longer way I end up over-complicating things in the end. I am entering a stage of simplification as I can tell a lot of the things I invented work great. What I would like to see, is as little confusion as possible. If I keep the code simple today, then in a few weeks I can start thinking about selling &quot;Digital Audio Workstation Theme&quot; at <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a>, more importantly I get to learn more about Bootstrap&apos;s coding conventions, and perhaps make my own Bootstrap even.</p>"},{"id":"poetry-0025","title":"The Ballad of Meow","category":"poetry","tags":"Photo Poem Quarantine","date":"2020-04-06T03:23:24.501Z","draft":false,"deleted":false,"published":"Sun Apr 5th 2020, 11:23 PM","html":"<p>Captain&apos;s Log: Quarantine. Day Twenty,</p><p>the promised day of rhyme a plenty.</p><p>I am sitting here with my salad,</p><p>expecting to write world&apos;s littlest ballad.</p><p>I waited until the conclusion of day,</p><p>to see with what rhymes that may pay.</p><p>Alas, twenty just about rhymes with plenty,</p><p>it rhymes as good as yeti and orange.</p><p>On the other hand Twenty One,</p><p>rhymes with all under the sun.</p><p>I am sitting here smacking my lips,</p><p>Counting down 90 days to Penumbral Eclipse.</p><p>I made little sausages to add to my salad,</p><p>I added really spicy dressing to spruce up my ballad.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-a.jpg\" alt=\"A\"></p><p>My Little Fort (note orange tent in the center)</p><p>As I grilled the little things, I remembered that same smell,</p><p>it was back when I lived in the ancient dune wilderness.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-x.jpg\" alt=\"X\"></p><p>Little Sausage Dinner</p><p>That memory really rings a bell,</p><p>It was at the height of my loneliness.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-b.jpg\" alt=\"B\"></p><p>My Evening Couch, as I waited for Lake Michigan Sunsets</p><p>Deep woods, ancient dunes,</p><p>and warm and sunny afternoons.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-k.jpg\" alt=\"K\"></p><p>Deep in Woods</p><p>Not all afternoons were sunny, I once got a heck of a reminder,</p><p>One cold afternoon I remembered that I get scared of thunder.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-c.jpg\" alt=\"C\"></p><p>And My Evening Wear</p><p>Not, little thunder of course,</p><p>the scary ones, that always strike with great force.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-t.jpg\" alt=\"T\"></p><p>Dark Evening</p><p>It was almost never scary, certainly never scary for long,</p><p>it would pass, and moon or sun would rise, followed by birdsong.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-h.jpg\" alt=\"H\"></p><p>People taking photos of my Horses</p><p>I remember by the beach many stood,</p><p>as I built horses out of driftwood,</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-i.jpg\" alt=\"I\"></p><p>Horse 2.0</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-j.jpg\" alt=\"J\"></p><p>Horse 3.0</p><p>The height of my loneliness,</p><p>also came with a great deal of silliness,</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-l.jpg\" alt=\"L\"></p><p>Beach House</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-m.jpg\" alt=\"M\"></p><p>Beach House</p><p>I waived to the future, and to today,</p><p>Look at me, I am a Cowboy! Say, Hey!</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/poetry-0025-f.jpg\" alt=\"F\"></p><p>Howdy!</p>"},{"id":"research-0049","title":"Expanded Color Subsystem And Finished Configuring The Build System It Should Work Ok When Installed As A Desktop Shortcut I H...","category":"research","tags":"Programming","date":"2020-04-05T22:35:47.063Z","draft":false,"deleted":false,"published":"Sun Apr 5th 2020, 6:35 PM","html":"<p>Expanded color subsystem, and finished configuring the build system. It should work OK when installed as a desktop shortcut. I have to figure out some way to make catpea useful.</p>"},{"id":"research-0048","title":"It Took Me A Moment To Figure Out How To Structure Colors Shades For User Interface In The The Problem Was I Needed More Color...","category":"research","tags":"Bootstrap Programming","date":"2020-04-05T16:56:55.639Z","draft":false,"deleted":false,"published":"Sun Apr 5th 2020, 12:56 PM","html":"<p>It took me a moment to figure out how to structure colors/shades for User Interface in the <a href=\"http://catpea.com/daw\">CATPEA DAW</a>. The problem was I needed more colors, but I don&apos;t want to go against <a href=\"https://getbootstrap.com/\">Bootstrap</a>&apos;s way of doing things. So, where they have a color scheme like this: primary-color, secondary-color, muted-color, warning-color. I added primary-color-dark, secondary-color-dark, muted-color-dark, warning-color-dark and primary-color-light, secondary-color-light, muted-color-light, warning-color-light. So when two of bootstrap colors start biting each other for example button and box (that the button is in) I can make the button lighter by saying button color: primary-color-light, so I tripled color count, in such a way that all the users of the <a href=\"http://catpea.com/theme\">Theme</a> just need to remember &quot;Oh, yeah, all the colors have a dark and light variation now. Hmm.&quot; so <a href=\"http://catpea.com/daw\">CATPEA DAW</a> UI is back to semi-normal now, and I updated the <a href=\"http://catpea.com/theme\">Theme</a> page to show off this upgrade.</p>"},{"id":"poetry-0024","title":"All Things Special","category":"poetry","tags":"Poem Quarantine","date":"2020-04-05T01:04:04.832Z","draft":false,"deleted":false,"published":"Sat Apr 4th 2020, 9:04 PM","html":"<p>Captain&apos;s Log: Day Nineteen of Quarantine.</p><p>Tomorrow, day twenty may have rhyme a plenty,</p><p>but it won&apos;t rhyme with quarantine, and that was unforeseen.</p><p>I waited all day to write,</p><p>to see if something interesting may bite.</p><p>I wanted to draw and paint, and dance and prance,</p><p>but ended up discovering a new <a href=\"https://www.youtube.com/watch?v=k6_QUhUPrF4\">poem about taking chance</a>.</p><p>I ended up programming, music and art,</p><p>I aimed to do something relaxing, but smart.</p><p>Such are meow days, and had been forever and more,</p><p>searching for all things special and all the things I adore.</p><p>Now, I am finishing today&apos;s poem, one foot already in bed,</p><p>Though I already had my salad, I wonder if I should make some bread.</p><p>That&apos;s sounds about right,</p><p>I&apos;ll waddle downstairs and grab a bite.</p><p>Goodnight.</p>"},{"id":"research-0047","title":"Whoopsie I Crashed The Website Generator With Long Winded Code Explanations With Samples All Fixed Now I Always Worry Github...","category":"research","tags":"Programming","date":"2020-04-04T19:47:42.610Z","draft":false,"deleted":false,"published":"Sat Apr 4th 2020, 3:47 PM","html":"<p>Whoopsie, I crashed the website generator with long winded code explanations with samples. All fixed now. I always worry github will shut me down, I don&apos;t think they like Code Mavericks like me. If something ever happens like that, I&apos;ll switch within a day or two, catpea.com domain name will stay the same.</p>"},{"id":"research-0046","title":"Ewwwwwww I Switched From To Node Sass Got Old I Guess I Wasnt Really Paying Too Much Attention To Sass A Ui Programming L...","category":"research","tags":"Programming","date":"2020-04-04T19:04:39.833Z","draft":false,"deleted":false,"published":"Sat Apr 4th 2020, 3:04 PM","html":"<p>Ewwwwwww! I switched from <a href=\"https://github.com/sass/node-sass\">node-sass</a> to <a href=\"https://sass-lang.com\">Sass</a>, node-sass got old, I guess.</p><p>I wasn&apos;t really paying too much attention to SASS (a UI programming language) because I think CSS should be shaped with JS, as these are native browser</p><p>technologies. But since <a href=\"https://getbootstrap.com/\">Bootstrap</a> is forcing me into <a href=\"https://sass-lang.com\">Sass</a>, I might as well make use of the language, and... I guess its functions as well.</p><p>Since this is a new addition to the system, there is both a learning curve, and bugs.</p><p>So I&apos;ve been trying to execute color.adjust(#6b717f, $red: 15); these are the big fancy new functions, but I&apos;ve been getting errors for days.</p><p>Well, now that I switched to <a href=\"https://sass-lang.com\">Sass</a> (from node-sass) there were changes, but I still got an error.</p><p>It turns out they have a new module system, and before I make use of the color function I have to execute @use &apos;sass:color&apos;; on top of the program file.</p><p>That&apos;s how it is done in all programming languages, but since I upgraded, I had to learn few new things about the new version of the language.</p><p>Now, this does not mean that I approve of the existence of the <a href=\"https://sass-lang.com/documentation/at-rules/control/if\">SASS Programming Language</a> in my code. But it is OK.</p><p>As the first, thing here, I created a custom function, this is written in JavaScript, and it is integrated with SASS. The function measures readability between a background color and a foreground color, and it is interesting... Because even though everyone says &quot;if readability is more than 4.5 you are peachy&quot;,</p><p>When working with themes, when kind of knowing colors, the 4.5 threshold can be lowered down to 1.5 even.</p><p>The big deal here is being able to say, keep darkening/lightening that color until it passes the readability test.</p><p>Here is an image of a recent test of using my <a href=\"https://www.w3.org/TR/WCAG20-TECHS/G18.html\">wcag-contrast</a>(foreground, background) function until a color is readable.</p><p>Note how text in the first column it not readable as the background and text-color converge in the middle.</p><p>And now look at the second column, where SMART coloring is taking place.</p><p>I know it is still dark, I kept the color change threshold very low on purpose, to make the overall UI graphics nice. The point is that the text is keeping up with the background, it is keeping juuuuuuust a wee bit above, un-readability.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0046-smart-color.png\" alt=\"Smart Color\"></p><p>Automatic Coloring</p><p>As a side-note, programming-wise this is not really impressive, it is like 5 lines of code, so pro-programmers would yawn at this, but it is a big deal for me, because I am getting really precise and delicate control over colors in my Dark Theme here, that it is only 5 lines of code, is great for me, I can just type in a bit of code and be done with worrying about color readability for some UI component or button/label combo. I like this. And I like being given the opportunity to ponder if I want something to grow brighter (like a label on a button) or darker, like in the case of a number-label on a table of data (like a row number in Excel).</p>"},{"id":"poetry-0023","title":"Teacher","category":"poetry","tags":"Poem Quarantine","date":"2020-04-03T23:59:02.881Z","draft":false,"deleted":false,"published":"Fri Apr 3rd 2020, 7:59 PM","html":"<p>Captain&apos;s Log: Day Eighteen of Quarantine.</p><p>Researching, learning, computers being mean.</p><p>It must be Friday, the eve of Eighteen,</p><p>I peeked outside and I think the trees are turning green.</p><p>But the squirrels, again, they act so weird,</p><p>smart little kitties worried that everyone disappeared.</p><p>Speaking of weird, programming is such a fun game,</p><p>I am convinced it is unhealthy, but I think that&apos;s a shame.</p><p>My computer programs kept me company since I was nine,</p><p>I was so little, and already learning the command line.</p><p>Alas, the time doth fly,</p><p>as we grow older we must take to the sky.</p><p>We have to learn beyond what is at our fingertips,</p><p>and set aims for all those leaderships.</p><p>We should pamper our talents, can&apos;t leave them behind,</p><p>as we grow older they&apos;ll play a very important role in our peace of mind.</p><p>My readers, we are each charged with becoming Teachers,</p><p>share our knowledge, become Reason&apos;s own preachers.</p><p>The Future is only as bright as Her Humanity,</p><p>we are Her dignity, Her keepers of sanity.</p><p>So, search for <a href=\"http://catpea.com/warrior\">video tutorials</a>,</p><p>maybe open a book,</p><p>and take a look.</p>"},{"id":"research-0045","title":"Zoinks I Started Work On A Graphical Theme For Applications I Called It It Provides Extensions For And Components Based On...","category":"research","tags":"Programming","date":"2020-04-03T23:25:54.011Z","draft":false,"deleted":false,"published":"Fri Apr 3rd 2020, 7:25 PM","html":"<p>Zoinks! I started work on a Graphical Theme for Applications, I called it <a href=\"http://catpea.com/theme\">Theme</a>. It provides extensions for <a href=\"https://getbootstrap.com/\">Bootstrap</a> and components based on <a href=\"http://catpea.com/daw\">CATPEA DAW</a>. I&apos;ll use it for my research here, and try to keep it tidy and inline with Bootstrap&apos;s Programming conventions so that I can think about getting into <a href=\"https://expo.getbootstrap.com/\">Bootstrap Expo</a> and later <a href=\"https://themes.getbootstrap.com/\">Bootstrap Themes</a>. I don&apos;t really want to create some stressful situation about sales, tech-support, and bug fixes; but I do like following <a href=\"https://getbootstrap.com/\">Bootstrap</a> conventions (it helps me keep code un-confusing) and I like learning about all this. Here&apos;s early: <a href=\"http://catpea.com/theme\">Theme</a>.</p>"},{"id":"research-0044","title":"Yes I Am 99 9 Sure That The Sound Machine Will Work The User Interface Is A Lot Simpler Than I Could Almost Call It A Symboli...","category":"research","tags":"GUI Programming","date":"2020-04-03T17:25:35.682Z","draft":false,"deleted":false,"published":"Fri Apr 3rd 2020, 1:25 PM","html":"<p>Yes, I am 99.9% sure that the Sound Machine will work.</p><p>The user interface is a lot simpler than <a href=\"https://lmms.io/\">LMMS</a> I could almost call it a SYMBOLIC SEQUENCER because it is so incredibly abstract.</p><p>I threw out a lot of ideas that people generally expect from a DAW, I am not even sure I am going to have a Piano Roll in here. What is the use of a piano roll when a typical beat sequencer can be given the most favorite and beautiful chords, it is not like musicians hit all the keys, they just hit that little selection that sounds nice.</p><p>The mechanics of a beat sequencer are superior to that of a piano roll, in many contexts. In a majority of related (webbrowser GUI music making) contexts (getting a neat song done quickly, not needing to learn to make music, not needing a real piano to make a song, working with a simple UI, enjoyment of creating music).</p><p>I am looking forward to creating a selection of instruments the user can use.</p><p>I will create a RANDOMIZE SYNTHESIZER SETTINGS button, this will make different instruments with a simple click of a button. Sure, it is great to have a little library, but is it needed when maybe a selection of 10 synthesizers with a randomize button is available? That makes for hundreds or thousands of instruments just leap out of thin air.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0044-sequencer.png\" alt=\"Sequencer\"></p><p>Song Structure and Sequencer</p>"},{"id":"research-0043","title":"Already Bumped Into An Artifact That Deals With Integrity Problems Basically When A New Part Of A Song Is Selected The Stuff T...","category":"research","tags":"Programming","date":"2020-04-03T14:15:43.386Z","draft":false,"deleted":false,"published":"Fri Apr 3rd 2020, 10:15 AM","html":"<p>Already bumped into an artifact that deals with integrity problems. Basically when a new part of a song is selected, the stuff that was selected in the old part needs to be cleared. So I created an unselections section in the data file. This is still reasonable, it is not a sign of trouble. But two or three anomalies like that like that could destroy a program like the <a href=\"http://catpea.com/daw\">CATPEA DAW</a>. But so far so good looks like it will all work.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0043-unselections.png\" alt=\"Unselections\"></p><p>Selections Trigger Unselections</p>"},{"id":"research-0042","title":"Yup So But Also Github Developers Didnt Code Octicons Right It Is Not Done In The Standard Way And It May Be That Under Ce...","category":"research","tags":"Programming","date":"2020-04-02T22:11:51.381Z","draft":false,"deleted":false,"published":"Thu Apr 2nd 2020, 6:11 PM","html":"<p>Yup, so <a href=\"https://www.githubstatus.com/\">github was having problems</a> but also, github developers didn&apos;t code octicons right, it is not done in the standard way, and it may be that under certain conditions the database of octicons that I import into my code will get wiped, they have processing instructions in there that run every time their library is imported, technically it should run once as it is cached, but under Svelte something goes wrong and the library returns empty data. I standardized it, and it works now, I am going to redo their system, I&apos;ll probably let them know that I did it, but that will be the end of it. I like these icons because there is a cute <a href=\"https://octicons.github.com/icon/squirrel/\">squirrel</a>.</p>"},{"id":"research-0041","title":"Things In Square Brackets Are Supposed To Be Links But The System Is Crashing Before I Get A Chance To Replace The Square Brack...","category":"research","tags":"Programming","date":"2020-04-02T20:14:32.068Z","draft":false,"deleted":false,"published":"Thu Apr 2nd 2020, 4:14 PM","html":"<p>Things in square brackets are supposed to be links, but the system is crashing before I get a chance to replace the square bracket notation, it will take me a moment to figure out why <a href=\"https://sapper.svelte.dev/\">Sapper</a> is failing. I did finish writing the poem for today, so that&apos;s nice. I just found out that on top of everything else <a href=\"https://www.githubstatus.com/\">github is having problems</a>: &quot;Update - We are investigating reports of service unavailability.&quot;</p>"},{"id":"poetry-0022","title":"Workout Video","category":"poetry","tags":"Poem Quarantine","date":"2020-04-02T20:04:32.068Z","draft":false,"deleted":false,"published":"Thu Apr 2nd 2020, 4:04 PM","html":"<p>Captain&apos;s Log: Day Seventeen of Quarantine.</p><p>Found two bugs in code, and got stuck in between.</p><p>I was supposed to be working on a Sound Machine,</p><p>but spent the noon formatting the code to keep it clean.</p><p>I can&apos;t believe, there is a bug in my code,</p><p>its probably in octicons, because I am using node.</p><p>Worst of all, I can&apos;t see it fail until I publish,</p><p>because sapper likes static as not to be sluggish.</p><p>So here I am, finally dressed up like Superman,</p><p>Debugging code, blind, like a veritable caveman.</p><p>I did a bit of soul searching,</p><p>then followed with some researching.</p><p>Now, I am sitting here, contemplating if I need a cape,</p><p>wondering if I should follow up with an Audiotape.</p><p>I could finish up getting in shape,</p><p>and completely change the workout landscape.</p><p>I am serious about making a workout tape,</p><p>I really want to get in shape.</p><p>What if the workout required wearing a tail?</p><p>Would it become like super holy grail?</p><p>I would walk the street and people would pale,</p><p>&quot;Sir! Why have you done this?</p><p>You, are a Whale!!!&quot;</p>"},{"id":"research-0040","title":"Yah It Is An Internal Bug I Have Little To Do With It Could Be Or That It Is Worth Solving Because It Is A Learning Experie...","category":"research","tags":"Programming","date":"2020-04-02T20:04:32.068Z","draft":false,"deleted":false,"published":"Thu Apr 2nd 2020, 4:04 PM","html":"<p>Yah, it is an internal bug I have little to do with, it could be <a href=\"https://rollupjs.org/guide/en/\">Rollup</a> or that <a href=\"https://github.com/primer/octicons/commit/875bc333ce4dc6a460a116dfd315a56dbb23120f#diff-c93a11fe3afdd3ccfbe1f152a8cf7b20L1\">Octicons require a json file</a>, it is worth solving because it is a learning experience, I get a moment of time to look through the system I am working with, mostly <a href=\"https://svelte.dev/\">Svelte</a>, <a href=\"https://sapper.svelte.dev/\">Sapper</a> and <a href=\"https://rollupjs.org/guide/en/\">Rollup</a>. The code for <a href=\"https://octicons.github.com/\">Octicons</a> which is made by github is highly questionable, I should make a copy and just re-write it. There is some <a href=\"https://www.w3.org/Graphics/SVG/WG/wiki/SVG_FAQ\">SVG</a> work coming up, since Octicons are in SVG, I may just do that then.</p>"},{"id":"research-0039","title":"I Found Some Trouble In The Website Generation Configuration It Was Preventing Parts Of The Program From Operating I Am Going...","category":"research","tags":"Programming","date":"2020-04-02T16:05:22.263Z","draft":false,"deleted":false,"published":"Thu Apr 2nd 2020, 12:05 PM","html":"<p>I found some trouble in the website generation configuration, it was preventing parts of the program from operating. I am going to be testing it for a bit more.</p>"},{"id":"research-0038","title":"Is Now A Desktop Application Mobile Devices Are Too Slow For Making Music This Is A New Program With New Stuff In It I Wont...","category":"research","tags":"Programming","date":"2020-04-02T15:01:03.450Z","draft":false,"deleted":false,"published":"Thu Apr 2nd 2020, 11:01 AM","html":"<p><a href=\"http://catpea.com/daw\">CATPEA DAW</a> is now a Desktop Application, Mobile Devices are too slow for making music, this is a new program with new stuff in it, I won&apos;t be changing anything else, I like having all these random gadgets here.</p><p>And it is still too early to know if <a href=\"http://catpea.com/daw\">CATPEA DAW</a> can work, there is no guarantee that what I am doing can actually result in a functional program. I went out of my way to create a Data Structure Driven program with minimal data manipulation functions embedded in the UI only.</p><p>A lot of programmers would hate this, the best of them would want me to create well named ACTIONS like &apos;selectTrack&apos; or &apos;enableNote&apos; but that just adds to the weight of the program, it destroys it. Programs that are WRITTEN-OUT like the best of these programmers want are BLOATED, HUGE, almost broken by design.</p><p>And what I am creating is a program that exploits only that which is possible, and no more. I am creating a self editing data structure with self-updating graphics. If this works out, I&apos;ll be able to create programs without programming. It would be more like data shaping and expressing, and not programming. It would beat the heck out of other applications. There is no code here, there is nothing to break.</p><p>The trade-off is that a program like this can&apos;t receive specific features, UNLESS, they are possible as dictated by the data-structure and its shaping.</p><p>If this was a project for a company, for a client and client requested a feature incompatible with the tree, one would have to say &quot;That, is not possible&quot;. To rewrite a program like this in standard code with Data Flows, Functions, Actions, Plugins, and such would take years.</p><p>Isn&apos;t this interesting? &#xB7; Alas, let us first see if I can have all I need to make music withut needing functions.</p>"},{"id":"research-0037","title":"Added A Very Early Preview Of Sound Machine I Aim To Create A Workout Song Generator Builder But I Dont Want To Just Create A...","category":"research","tags":"Programming","date":"2020-04-01T21:29:48.923Z","draft":false,"deleted":false,"published":"Wed Apr 1st 2020, 5:29 PM","html":"<p>Added a very early preview of Sound Machine. I aim to create a Workout Song Generator/Builder, but I don&apos;t want to just create a Workout Song Generator/Builder and code it. I want to explore areas in and around it, by asking &quot;What are some related programs that take little code to finish?&quot;. There is a possibility that Sound Machine can be a useful music Builder/Generator. If you have a Desktop machine take a look at what it would look like as its own page <a href=\"http://catpea.com/daw\">CATPEA DAW</a> it is a very raw mockup I have the Sound Machine in two places just to see what it would be like to have that little index on the left. Here is a screenshot:</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0037-daw.jpg\" alt=\"Daw\"></p><p>Digital Audio Workstation</p>"},{"id":"poetry-0021","title":"Missing Underpants","category":"poetry","tags":"Poem Quarantine","date":"2020-04-01T16:35:20.987Z","draft":false,"deleted":false,"published":"Wed Apr 1st 2020, 12:35 PM","html":"<p>Captain&apos;s Log: Day Sixteen of Quarantine.</p><p>Keeping it serious like Wolverine.</p><p>I have decided not to rhyme,</p><p>I really haven&apos;t got the time.</p><p>I must leave the thieving Squirrels behind,</p><p>yes, really, I don&apos;t mind.</p><p>Today, is a new day, I am completely serious,</p><p>I am going to ignore everything hilarious.</p><p>I am not even joking, I&apos;ll ignore those furriers,</p><p>I won&apos;t even pay attention to their funny scurries.</p><p>I will sit here quiet,</p><p>tending to my amazing diet...</p><p>A stray thought bubbles to my idle mind,</p><p>Oh, no, I hope people won&apos;t go blind!</p><p>I think I am going to YouTube my workout dance,</p><p>Now, where the heck did I put my underpants?</p>"},{"id":"research-0036","title":"Added The Salamander Piano Sampler Gadget...","category":"research","tags":"Programming","date":"2020-04-01T01:14:25.924Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 9:14 PM","html":"<p>Added the Salamander Piano Sampler Gadget.</p>"},{"id":"research-0035","title":"I Had To Rotate Labels On The Instruments Everything Goes Cdefgab Instead Of Abcdefg Sigh I Cant Believe This Is Part Of The...","category":"research","tags":"Programming","date":"2020-04-01T00:32:07.540Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 8:32 PM","html":"<p>I had to rotate labels on the instruments everything goes CDEFGAB instead of ABCDEFG. Sigh, I can&apos;t believe this is part of the <a href=\"https://en.wikipedia.org/wiki/Scientific_pitch_notation\">Scientific Pitch Notation</a> specification, music people are strange sometimes.</p>"},{"id":"research-0034","title":"Lots Of Little Bug Fixes.","category":"research","tags":"Programming","date":"2020-04-01T00:30:07.540Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 8:30 PM","html":"<p>Lots Of Little Bug Fixes. I made some instrument upgrades and a few code bugs snuck in.</p>"},{"id":"research-0033","title":"Added Preset To The Beat Sequencer To Test Support For Multiple Instruments I Also Added Salamander Piano Which Is Based On...","category":"research","tags":"Programming","date":"2020-03-31T23:43:12.938Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 7:43 PM","html":"<p>Added <a href=\"https://github.com/fantasyui-com/catpea-com/blob/master/src/components/BeatSequencer.svelte\">Inner City, Good Life</a> preset to the Beat Sequencer to test support for multiple instruments. I also added Salamander Piano, which is based on <a href=\"https://usa.yamaha.com/products/musical_instruments/pianos/grand_pianos/cx_series/cx-series.html\">Yamaha C5 Grand Piano</a>, a real Piano, it sounds nice <img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0033-megaphone.svg\" alt=\"Megaphone\">. Go to Shebang Slash Beat Sequencer, check some of those boxes to make the piano go. I set it as the default instrument.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0033-piano.png\" alt=\"Piano\"></p><p>Piano Fun</p>"},{"id":"research-0032","title":"Cleaned Up The It Is Actually Simpler Than It Looks Https Github Com Fantasyui Com Catpea Com Blob Master Src Components Be...","category":"research","tags":"Programming","date":"2020-03-31T19:24:44.147Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 3:24 PM","html":"<p>Cleaned up the <a href=\"https://github.com/fantasyui-com/catpea-com/blob/master/src/components/BeatSequencer.svelte\">Beat Sequencer Source Code</a> it is actually simpler than it looks.</p>"},{"id":"poetry-0020","title":"Squirty Squirrels","category":"poetry","tags":"Poem Quarantine Squirrel","date":"2020-03-31T16:20:21.586Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 12:20 PM","html":"<p>Captain&apos;s Log: Day Fifteen of Quarantine,</p><p>Squirrels continue being mean.</p><p>They just aren&apos;t very keen, on the idea,</p><p>that their theft gave them diarrhea.</p><p>I know not what to do,</p><p>Darn Squirrels! that Trailmix was not for you!</p><p>Maybe someday we&apos;ll move on,</p><p>come a sunny day, carry on.</p><p>But today, is not that day,</p><p>it&apos;s just Tuesday.</p><p>This is getting out of control,</p><p>I don&apos;t want to be a poet anymore!</p><p>I just wanted to feed the creatures I adore.</p><p>Not write strange rhymes out the front door.</p><p>I must stop rhyming,</p><p>this is not the right timing.</p><p>I feel like I&apos;ve lost control,</p><p>spiraling down a Squirrel Hole.</p><p>I swear I am not like this in real life... I can change!</p>"},{"id":"research-0031","title":"I Have Added Slide Open Slide Closed Animation To The Drawer In Shebang Slash Beat Sequencer When Opening One Of The Drawers I...","category":"research","tags":"Bootstrap GUI Programming","date":"2020-03-31T15:36:24.127Z","draft":false,"deleted":false,"published":"Tue Mar 31st 2020, 11:36 AM","html":"<p>I have added slide-open/slide-closed animation to the drawer in Shebang Slash Beat Sequencer, when opening one of the drawers, instead of contents appearing instantly they slide in vertically. I am not a fan of animation of this kind in GUI world, but everybody seems to be doing it, and if I am to develop a Bootstrap Theme for possible sales, I need to make sure all my designs cooperate nicely with <a href=\"https://svelte.dev/examples#transition\">Svelte&apos;s Transition Directives</a>.</p>"},{"id":"research-0030","title":"Ive Been Looking At The Submissions In Curated By One Of The Original Developers And I Feel Like The Warrior Book Needs Bett...","category":"research","tags":"Programming","date":"2020-03-30T22:15:38.600Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 6:15 PM","html":"<p>I&apos;ve been looking at the submissions in <a href=\"https://expo.getbootstrap.com/\">Bootstrap Expo</a> curated by one of the original <a href=\"https://getbootstrap.com/\">Bootstrap</a> developers. And I feel like the Warrior Book needs better design, and I think maybe the Workout Song Generation may benefit from being its own application. In next few weeks, perhaps, I would like to practice art general design and typography for a bit to create something as beautiful as that <a href=\"http://hellohappy.org/beautiful-web-type\">Beautiful Web Type</a> demo.</p>"},{"id":"research-0029","title":"Added Stop Play Buttons To The Beat Sequencer It Just Seems Right Overall Adding Extras Is A Bad Idea But In Larger Programs...","category":"research","tags":"Programming","date":"2020-03-30T22:07:28.661Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 6:07 PM","html":"<p>Added Stop/Play buttons to the Beat Sequencer, it just seems right. Overall, adding extras is a bad idea, but in larger programs, if there are too many extras one can add a Advanced Mode. It would work here too, but a couple of extra buttons is OK.</p>"},{"id":"research-0028","title":"The Future Well It Takes About 50 Lines Of Code To Make Music To Make Mp 3 Files With Mostly Randomly Generated Fresh Sounding...","category":"research","tags":"Programming","date":"2020-03-30T20:16:36.830Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 4:16 PM","html":"<p>THE FUTURE: Well, it takes about 50 lines of code to make music, to make MP3 files with mostly randomly generated fresh sounding music. There is no server requirement, everything happens in the browser crunching math in the user&apos;s CPU. Let us make future now, not tomorrow. I will now aim to create a Workout Song generator Widget/Gadget, that upon straining the CPU a bit will pop out files that can be played on the phone during workout. From Soundboard, to Beat Sequencer, to Song Maker. You might have noticed that the Beat Sequencer started sounding too complicated for a bit, &quot;BPM&quot;, &quot;Parts&quot;, &quot;Beats&quot;, &quot;Octave&quot;, &quot;Note&quot;, &quot;Scientific Notation&quot;, this is one lesson I want to take away from the Sequencer, the song generator will have to be massively abstract, it will have a setting for Softness rather than Samples and Presets, it will say Advanced Workout, Intermediate Workout, instead of BPM and Beats. I&apos;ll abstract away all the music-y stuff. Yah.</p>"},{"id":"research-0027","title":"Huge Problem Here Is Cpu Speed My Older Phone Tablet Cant Keep Pace Too Much Cpu Processing Is Required To Make Music Live N...","category":"research","tags":"Programming","date":"2020-03-30T19:53:37.293Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 3:53 PM","html":"<p>Huge problem here is CPU speed. My older phone/tablet can&apos;t keep pace, too much CPU processing is required to make music live. Now, there is a way around this, kind of. It should be possible to make a song file and then play it. As far as modern technologies go, CHEAP MOBILE DEVICES are not ready to make music. There is a million ways around this, but each and every one of those comes with drawbacks. This technology works on fast desktops, and that is what I will recommend that people use.</p>"},{"id":"research-0026","title":"Shebang Slash Soundboard Is Complete Keeping Things Simple Is How Good Software Gets Done Good Now I Need To Add More Presets...","category":"research","tags":"Programming","date":"2020-03-30T19:47:37.293Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 3:47 PM","html":"<p>Shebang Slash Soundboard is complete. Keeping things simple, is how good software gets done good. Now I need to add more presets, that should be fun. The preset data format looks like binary code, here is the Closed Hat for Billie Jean Meow Mix: {label:&apos;Closed Hat&apos;, device:&apos;lofi&apos;, octave:6, note:&apos;C&apos;, data:expandNotation(&apos;1010 1010 1010 1010 1010 1010 1010 1010&apos;)} I came up with this, there is a bunch of repetitive stuff in data files, so I cooked up this 0/1 thing and a function that expands it into the data that the program ends up using.</p>"},{"id":"research-0025","title":"Renamed The Lofi Soundboard To Shebang Slash Soundboard...","category":"research","tags":"Programming","date":"2020-03-30T19:05:41.707Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 3:05 PM","html":"<p>Renamed the LOFI Soundboard to Shebang Slash Soundboard</p>"},{"id":"research-0024","title":"Shebang Slash Soundboard Has A Very Simple But Powerful Start Loading Progress Bar Done Setup This Type Of Programming Has...","category":"research","tags":"Programming","date":"2020-03-30T19:03:41.707Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 3:03 PM","html":"<p>Shebang Slash Soundboard has a very simple but powerful Start, Loading, Progress-Bar, Done, setup. This type of programming has only been available for 2 years. It is a combination of Svelte, ES6, SCSS, Rollup, Sapper and Bootstrap.</p>"},{"id":"research-0023","title":"Github The Company Hosting The Site And The Site It Self Is Becoming Sluggish So I Am Opening A New Experiment I Am Going To...","category":"research","tags":"Programming","date":"2020-03-30T15:54:36.578Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 11:54 AM","html":"<p>Github, the company hosting the site, and the site it self is becoming sluggish, so I am opening a new experiment. I am going to add control over loading resources. For example the Shebang Slash soundboard will come with a Start or Load button, the .mp3 samples that it loads will only start loading into the browser when Start/Load is pressed. &#xB7; Eventually I would like to make a website for creating workout music, so stuff like resource control will come in really handy dandy. If CATPEA goes down it is because GitHub broke some promise, I&apos;ll be back up within a couple of days.</p>"},{"id":"research-0022","title":"Drawer Component","category":"research","tags":"Bootstrap Programming","date":"2020-03-30T14:55:21.933Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 10:55 AM","html":"<p>I named the panel I&apos;ve been poking at <a href=\"https://github.com/fantasyui-com/catpea-com/tree/master/src/style/drawer\">drawer</a>. You can take a look at the graphical configuration in CSS language <a href=\"https://github.com/fantasyui-com/catpea-com/blob/master/src/style/drawer/drawer.scss\">here</a>. I am learning to make components for <a href=\"https://getbootstrap.com/\">Bootstrap</a> this has been a hobby of mine for many years now. It feels nice to be making progress here. I still need to create a configuration section that stores all the sizing/color information, with descriptions and such. The <a href=\"https://github.com/fantasyui-com/catpea-com/tree/master/src/style/drawer\">drawer page</a> shows examples of how to use the Drawer, that language is called HTML. <a href=\"https://getbootstrap.com/\">Bootstrap</a> developers would frown on my work thus far because the drawer component can almost be made in another way, they actually have similar things. But I am thinking about creating components for a <a href=\"https://www.google.com/search?q=Digital+Audio+Workstation&amp;tbm=isch\">Digital Audio Workstation (DAW)</a> like <a href=\"https://www.ableton.com/en/live/\">Ableton</a>, right now the drawer is not impressive, but it will evolve beyond what Bootstrap can do. Already I am thinking that I should not use colors, but rather transparent shadows, so whatever color is in the background the drawer will inherit it automatically. <a href=\"https://getbootstrap.com/\">Bootstrap</a> creates flat/raised things, and my additions may end up being graphically sunken. Plus, <a href=\"https://getbootstrap.com/\">Bootstrap</a> creates structure, and I use it for layout and containers. They don&apos;t really create content that is specific for some purpose (like my DAW), they limit themselves to general purpose things. They do sell themes, and if I ever completed this project, they may accept mine into their store. I have much more to learn, and I still have to get used to their way of doing things.</p>"},{"id":"poetry-0019","title":"Lawn Flurries","category":"poetry","tags":"Poem Quarantine","date":"2020-03-30T13:11:22.278Z","draft":false,"deleted":false,"published":"Mon Mar 30th 2020, 9:11 AM","html":"<p>Captain&apos;s Log: Day Fourteen of Quarantine,</p><p>All the local squirrels, now hold me in high esteem.</p><p>They feel munchies to extreme,</p><p>but the trailmix they stole is gone,</p><p>flurries of the box still scattered on my lawn.</p><p>Squirrels, now crazed, and withdrawn.</p><p>Peanuts on their mind,</p><p>because mail delivery was ill timed.</p><p>Why am I like this?</p>"},{"id":"research-0021","title":"Added A Collapsible Panel To The Shebang Slash Beat Sequencer It Looks Good Works Ok I Will Need To Do A Lot Of Configuration...","category":"research","tags":"Programming","date":"2020-03-30T00:37:57.352Z","draft":false,"deleted":false,"published":"Sun Mar 29th 2020, 8:37 PM","html":"<p>Added a collapsible panel to the Shebang Slash Beat Sequencer. It looks good, works OK. I will need to do a lot of configuration work before I can use it throughout. But this is the right path, this is where I will <img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0021-squirrel.svg\" alt=\"Squirrel\"> away all the complexity, it will be a simple UI, but also contain all kinds of features a click away.</p>"},{"id":"research-0020","title":"Yah I Need New Gui Technologies The Browser Stuff Is Old And Brittle I Am Looking To And Just At A Glance I Can See I Need...","category":"research","tags":"GUI Programming","date":"2020-03-29T20:10:34.833Z","draft":false,"deleted":false,"published":"Sun Mar 29th 2020, 4:10 PM","html":"<p>Yah, I need new GUI technologies, the browser stuff is old and brittle. I am looking to <a href=\"https://www.google.com/search?q=zbrush+gui&amp;tbm=isch\">ZBrush</a> and <a href=\"https://www.google.com/search?q=photoshop+gui&amp;tbm=isch\">Photoshop</a>. Just at a glance I can see I need more spacing, more dark, and above all collapsible panels. Working on nicer preset selector.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0020-gui1.png\" alt=\"Gui 1\"></p><p>GUI Ideas</p>"},{"id":"poetry-0018","title":"Must Dance","category":"poetry","tags":"Poem Quarantine","date":"2020-03-29T13:14:44.761Z","draft":false,"deleted":false,"published":"Sun Mar 29th 2020, 9:14 AM","html":"<p>Captain&apos;s Log: Day Thirteen of Quarantine;</p><p>still staring at my screen,</p><p>hanging on for dear life to my spleen</p><p>as I drink another coffee bean,</p><p>trying, trying not to create a scene,</p><p>dancing dressed red outside my window;</p><p>during quarantine.</p>"},{"id":"research-0019","title":"Well Ive Noticed The Ui Is Not Loading On My Cheap Mobile Tablet And The Dropdowns I Use For Everything Look Ugly Plus They...","category":"research","tags":"GUI Programming","date":"2020-03-29T13:14:44.761Z","draft":false,"deleted":false,"published":"Sun Mar 29th 2020, 9:14 AM","html":"<p>Well, I&apos;ve noticed the UI is not loading on my cheap mobile tablet. And the dropdowns I use for everything look ugly, plus they are hard to consistently style across different browsers and devices. UI needs a new strategy. Now, I will leave the Shebang Slash Sequencer in, I won&apos;t make radical changes to it. But, time has come to think about a new GUI technology.</p>"},{"id":"poetry-0017","title":"The Birds Are Going Wild Outside My Window","category":"poetry","tags":"Quarantine Strange","date":"2020-03-29T11:14:44.761Z","draft":false,"deleted":false,"published":"Sun Mar 29th 2020, 7:14 AM","html":"<p>The birds are going wild outside my window.</p><p>Probably because of all the Plump Squirrels I&apos;ve been feeding.</p><p>Dammit.</p>"},{"id":"poetry-0016","title":"Ragrets","category":"poetry","tags":"Poem Quarantine","date":"2020-03-28T22:31:17.209Z","draft":false,"deleted":false,"published":"Sat Mar 28th 2020, 6:31 PM","html":"<p>Captain&apos;s Log, Day Twelve of Quarantine. I ordered some trailmix from the internet, mailman dropped it off by the door and all the local Squirrels I&apos;ve been feeding came over, ripped the box open, and ate it. How rude, I probably shoudn&apos;t have been feeding them all this time.</p>"},{"id":"research-0018","title":"I Continue My Work On The Little Shebang Slash Beat Sequencer","category":"research","tags":"Programming","date":"2020-03-28T22:31:17.209Z","draft":false,"deleted":false,"published":"Sat Mar 28th 2020, 6:31 PM","html":"<p>I continue my work on the little Shebang Slash Beat Sequencer, I am searching for an easy UI configuration, that is also fully featured (can edit a huge song), and has a huge area for configuring things beyond Octave and Note. The area that opens up below when user clicks a line number will be used for sound synthesis configuration that could be as many as 10 dropdowns. I don&apos;t like horizontal scrolling, this is what this test is about. But there is something wrong with Vertical Scrolling, like here in the <a href=\"https://www.youtube.com/watch?v=gdSslkrN1kk\">Mod Trackers</a>, it just feels too awkward to compose a song downwards. On the other hand I don&apos;t want to recreate the <a href=\"https://www.ableton.com/en/live/\">Ableton</a> UI, editing music this way is too slow. I&apos;ll probably keep creating these little UI widgets, but begin connecting them together under a common beat. This way the end result is a dashboard of easy to use musical instruments, and probably some fat squirrels.</p>"},{"id":"poetry-0015","title":"The Beat Sequencer","category":"poetry","tags":"Audio Quarantine","date":"2020-03-27T13:12:01.513Z","draft":false,"deleted":false,"published":"Fri Mar 27th 2020, 9:12 AM","html":"<p>Captains Log, Star-date Day Eleven. I connected the Beat Sequencer to Sound. Click on any of the tiny boxes and when the loop comes around the sound will fire. Tip: put a drum every four squares, and something that makes a Tsk every other square. Music is really-really simple, like language, music evolved with us, all it takes is sticks and places to hit them with. Actually we don&apos;t even need sticks <a href=\"https://youtu.be/V76psBrEypg?t=611\">Tuvan Singing</a></p>"},{"id":"poetry-0014","title":"Shebang Genre","category":"poetry","tags":"Audio Quarantine","date":"2020-03-26T23:56:25.371Z","draft":false,"deleted":false,"published":"Thu Mar 26th 2020, 7:56 PM","html":"<p>Quarantine Day Ten. My arms grew so powerful from all the rest that I mistakenly struck myself several times. I busied myself today relearning how to handle all my amazing strength. Renamed Hash Bang to <a href=\"https://en.wikipedia.org/wiki/Shebang_(Unix)\">Shebang</a>, as it is the most commonly used variant. Begun working on a beat sequencer, and a song maker. The idea here is that Chords, Bass, Melodies can all be handled by the <a href=\"https://github.com/Tonejs/Tone.js/wiki/Arpeggiator\">Arpeggiator</a>, but the beat is a bit more complex, and needs a little tool. The tool I have up today uses re-styled checkboxes, a perfect fit for the sequencer.</p>"},{"id":"poetry-0013","title":"Soundboard","category":"poetry","tags":"Audio Quarantine","date":"2020-03-25T23:33:22.740Z","draft":false,"deleted":false,"published":"Wed Mar 25th 2020, 7:33 PM","html":"<p>Captain&apos;s Log: Ninth Day of Quarantine: I found one more chicken, am ready for dinner. I created a small <a href=\"https://en.wikipedia.org/wiki/Soundboard_(computer_program)\">Soundboard</a> for what is basically a tiny collection of LOFI Hip-Hop sounds. A tiny collection will do, because we have the the synthesizer taking care of everything else. I added some Hip sounds to the THE WARRIOR Album Single and it does sound very well. Realistically it is difficult to call it music at this point, I have all the components but there were bugs along the way. <a href=\"https://sapper.svelte.dev/docs#Server-side_rendering\">Svelte Sapper</a> is complicated to visualize, it pre-creates some things, meaning before I publish to the website, Sapper will create a pre-ran version of the site. When a visitor visits, the pre-ran (pre-generated static version) will then be upgraded to a real version, and replaced by now running live version. It is the correct technology, and it didn&apos;t get me, but it does take a moment to figure out when a bug jumps out of nowhere.</p>"},{"id":"poetry-0012","title":"The Warrior Album Single","category":"poetry","tags":"Audio Quarantine","date":"2020-03-24T21:11:29.310Z","draft":false,"deleted":false,"published":"Tue Mar 24th 2020, 5:11 PM","html":"<p>Captain&apos;s Log Supplemental: Day Eight and Half... of Quarantine. I almost finished eating my 30 day supply of Chicken, my muscles have tripled in size, and I have the strength of 300. I begun releasing a New Album entitled <strong>THE WARRIOR</strong> Inspired by <a href=\"https://www.youtube.com/results?search_query=Tron+Legacy\">TRON</a> and <a href=\"https://www.youtube.com/watch?v=mVxLhy1v-xU\">LOFI Hip-Hop</a>.</p>"},{"id":"poetry-0011","title":"Sciurine Song MP3","category":"poetry","tags":"Audio Quarantine","date":"2020-03-24T15:18:57.286Z","draft":false,"deleted":false,"published":"Tue Mar 24th 2020, 11:18 AM","html":"","audio":"http://catpea.com/sciurine.mp3"},{"id":"poetry-0010","title":"Sciurine Instrumental Section","category":"poetry","tags":"Audio Quarantine","date":"2020-03-24T13:36:42.106Z","draft":false,"deleted":false,"published":"Tue Mar 24th 2020, 9:36 AM","html":"<p>Captain&apos;s Log: Eighth day of the quarantine. I have extended the Sciurine Instrumental Section with a Beautiful Thin Saw (a Sciurine Favorite) and a powerful Electric Cello backing a <a href=\"https://github.com/Tonejs/Presets/blob/gh-pages/instrument/Synth/TreeTrunk.json\">Tree Trunk</a> Synth. As nothing like this has ever been heard on Planet Earth before, the song has risen all the way to the very top of Shire Lyre Squire Squirrel Choir charts and is expected to stay there permanently, forever.</p>"},{"id":"poetry-0009","title":"Tremolo Effect To The Sciurines In Memphis Song","category":"poetry","tags":"Audio Quarantine","date":"2020-03-24T00:46:35.352Z","draft":false,"deleted":false,"published":"Mon Mar 23rd 2020, 8:46 PM","html":"<p>On the Seventh Day of Quarantine I Added Tremolo (<a href=\"https://en.wikipedia.org/wiki/Low-frequency_oscillation\">LFO</a> effect) to the Sciurines in Memphis song (it is used in the second movement [middle of the song]), and made our imaginary band a sick medieval logo. All my generative music uses <a href=\"https://en.wikipedia.org/wiki/Scientific_pitch_notation\">Scientific Pitch Notation</a>, take that Mozart. It looks like the CPU requirements are too high for mobile devices, small price to pay for a taste of Medieval <a href=\"https://www.dictionary.com/browse/sciurine\">Sciurine</a> Pop. <a href=\"https://www.quora.com/On-GitHub-what-is-the-significance-of-the-Ship-It-squirrel?share=1\">Ship it!</a></p>"},{"id":"poetry-0008","title":"Added High Fidelity Mode For Dehydration In Memphis","category":"poetry","tags":"Audio Quarantine","date":"2020-03-23T20:32:49.019Z","draft":false,"deleted":false,"published":"Mon Mar 23rd 2020, 4:32 PM","html":"<p>Added High Fidelity mode for Dehydration in Memphis, it should be possible to [almost] play it on mobile now (need a speedy CPU), though it is kind of not the point. The real value in the HD toggle is hearing the actual Synthesizer without any HD filters.</p>"},{"id":"poetry-0007","title":"Added Membrane Synth Drums To The Dehydration In Memphis","category":"poetry","tags":"Audio Quarantine","date":"2020-03-23T13:41:42.846Z","draft":false,"deleted":false,"published":"Mon Mar 23rd 2020, 9:41 AM","html":"<p>Added membrane synth (Drums) to the Dehydration in Memphis Generative Album (It sounds like the <a href=\"https://en.wikipedia.org/wiki/Terminator_(character)\">T-800</a> is collaborating with the <a href=\"http://www.scp-wiki.net/scp-2050\">Sciurine Poor-Fellows</a>, and he&apos;s good.)</p>"},{"id":"poetry-0006","title":"Autogenerative Music Widget","category":"poetry","tags":"Audio Quarantine","date":"2020-03-22T20:14:25.929Z","draft":false,"deleted":false,"published":"Sun Mar 22nd 2020, 4:14 PM","html":"<p>Day Six of Quarantine: Created a New Autogenerative Music Widget and disguised it as an immature <a href=\"https://www.dictionary.com/browse/sciurine\">Sciurine</a> Urine joke. The technology is extremely advanced. I am for the first time in forever connecting virtual synthesizers through a <a href=\"https://tonejs.github.io/docs/13.8.25/Reverb\">Reverb Convolver</a>. This reshapes the Synthesized Sounds, the synthesizer waveform, into a more realistic sounding instrument. Reverb just about does it, if Commodore 64 came with a decent reverb it would sound amazing, nothing like chiptunes. I have gotten used to breaking up my Generative Music into movements, and the initial song comes with 24 measures, where evey eight measures I do something interesting with the higher pitched instruments. For the most part I fell like using A Basic <a href=\"https://github.com/Tonejs/Tone.js/wiki/Arpeggiator\">Arpeggiator</a> for everything, I am yet to test it with real world sound samples (digital sound recordings as opposed to synthesizer based sounds.)</p>"},{"id":"poetry-0005","title":"Day Five Of Quarantine...","category":"poetry","tags":"Philosophy Quarantine","date":"2020-03-21T20:14:25.929Z","draft":false,"deleted":false,"published":"Sat Mar 21st 2020, 4:14 PM","html":"<p>Day Five of Quarantine...</p>"},{"id":"research-0017","title":"Updated Warrior Book And Videos","category":"research","tags":"Book","date":"2020-03-21T20:14:25.929Z","draft":false,"deleted":false,"published":"Sat Mar 21st 2020, 4:14 PM","html":"<p>Updated Warrior Book and Videos on catpea.com</p>"},{"id":"poetry-0004","title":"Day Four Of Quarantine...","category":"poetry","tags":"Philosophy Quarantine","date":"2020-03-20T20:14:25.929Z","draft":false,"deleted":false,"published":"Fri Mar 20th 2020, 4:14 PM","html":"<p>Day Four of Quarantine...</p>"},{"id":"poetry-0003","title":"Day Three Of Quarantine...","category":"poetry","tags":"Philosophy Quarantine","date":"2020-03-19T20:14:25.929Z","draft":false,"deleted":false,"published":"Thu Mar 19th 2020, 4:14 PM","html":"<p>Day Three of Quarantine...</p>"},{"id":"poetry-0002","title":"Day Two Of Quarantine...","category":"poetry","tags":"Philosophy Quarantine","date":"2020-03-18T20:14:25.929Z","draft":false,"deleted":false,"published":"Wed Mar 18th 2020, 4:14 PM","html":"<p>Day Two of Quarantine...</p>"},{"id":"poetry-0001","title":"Day One Of Quarantine...","category":"poetry","tags":"Philosophy Quarantine","date":"2020-03-17T20:14:25.929Z","draft":false,"deleted":false,"published":"Tue Mar 17th 2020, 4:14 PM","html":"<p>Day One of Quarantine.</p>"},{"id":"research-0016","title":"Updated Neumorphism","category":"research","tags":"Programming","date":"2020-02-05T00:33:31.100Z","draft":false,"deleted":false,"published":"Tue Feb 4th 2020, 7:33 PM","html":"<p>Updated the <a href=\"https://fantasyui-com.github.io/neumorphism/\">Neumorphism</a> tool with support for mobile/tablet and light source direction.</p>"},{"id":"research-0015","title":"Created A Tool For Updating The Book","category":"research","tags":"GUI Programming","date":"2020-02-03T01:48:18.732Z","draft":false,"deleted":false,"published":"Sun Feb 2nd 2020, 8:48 PM","html":"<p>Created a tool for updating the book and Cat Pea GUI <a href=\"https://fantasyui-com.github.io/neumorphism/\">Neumorphism</a></p>"},{"id":"research-0014","title":"Hee Haw What A Ride I Split The User Interface Components Used In From And Created A Creatively Named Stand Alone Project...","category":"research","tags":"Programming","date":"2020-01-31T04:07:32.063Z","draft":false,"deleted":false,"published":"Thu Jan 30th 2020, 11:07 PM","html":"<p>Hee Haw, what a ride, I split the user Interface components used in <a href=\"http://catpea.com/warrior\">The Warrior Book</a> from <a href=\"https://github.com/fantasyui-com/catpea-com\">Cat Pea Code</a> and created a creatively named stand-alone project: <a href=\"https://fantasyui-com.github.io/book-gui/?path=/story/widgets--illustration\">book-gui</a></p>"},{"id":"research-0013","title":"Added To The Main Menu It Is A Complicated Effort As The Book Was Converted To A Pure Data File And Now Needs Components To R...","category":"research","tags":"Programming","date":"2020-01-28T03:34:30.737Z","draft":false,"deleted":false,"published":"Mon Jan 27th 2020, 10:34 PM","html":"<p>Added <a href=\"http://catpea.com/warrior\">The Warrior Book</a> to the main menu. It is a complicated effort as the book was converted to a pure data file, and now needs components to render the data. It made the book very portable, but there are a couple of broken internal links, and perhaps a bug or two.</p>"},{"id":"research-0012","title":"The Squirrel Expert System","category":"research","tags":"Programming Squirrel","date":"2020-01-25T01:01:25.484Z","draft":false,"deleted":false,"published":"Fri Jan 24th 2020, 8:01 PM","html":"<p>The Squirrel Expert System can hide topics that the user already discussed. Squirrel&apos;s mind can be configured via Preferences pane. Added warning to anomalous IQ settings. Added secondary directives.</p>"},{"id":"research-0011","title":"Added Squirrel AI!","category":"research","tags":"Programming Squirrel","date":"2020-01-24T14:39:17.606Z","draft":false,"deleted":false,"published":"Fri Jan 24th 2020, 9:39 AM","html":"<p>Added Squirrel AI.</p>"},{"id":"research-0010","title":"Added Squirrel Icons Squirrel Svg...","category":"research","tags":"Programming Squirrel","date":"2020-01-24T02:11:52.327Z","draft":false,"deleted":false,"published":"Thu Jan 23rd 2020, 9:11 PM","html":"<p>Added Squirrel</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0010-squirrel.png\" alt=\"Squirrel\"></p>"},{"id":"research-0009","title":"Improved News Readability...","category":"research","tags":"Programming","date":"2020-01-24T02:06:48.327Z","draft":false,"deleted":false,"published":"Thu Jan 23rd 2020, 9:06 PM","html":"<p>Improved news readability.</p>"},{"id":"research-0008","title":"Added Prev Next Navigation To Random Videos","category":"research","tags":"Programming","date":"2020-01-24T01:34:33.923Z","draft":false,"deleted":false,"published":"Thu Jan 23rd 2020, 8:34 PM","html":"<p>Added prev/next navigation to random videos.</p>"},{"id":"research-0007","title":"Svelte Research","category":"research","tags":"Programming","date":"2020-01-24T01:16:31.658Z","draft":false,"deleted":false,"published":"Thu Jan 23rd 2020, 8:16 PM","html":"<p>Continued exploring potential for component re-usability. <a href=\"https://svelte.dev/\">Svelte&apos;s</a> <a href=\"https://sapper.svelte.dev/\">Sapper</a> is following WebComponents where templating is concerned (I can reference same slot multiple times), CSS module isolation works great, metaprogramming HTML with {#if}{:else}{/if} is fine. It does beat <a href=\"https://markojs.com/\">Marko</a>, <a href=\"https://reactjs.org/\">React</a> and <a href=\"https://vuejs.org/\">Vue</a>.</p>"},{"id":"research-0006","title":"Added Autopause To Random Video Player","category":"research","tags":"Programming","date":"2020-01-24T00:51:10.250Z","draft":false,"deleted":false,"published":"Thu Jan 23rd 2020, 7:51 PM","html":"<p>Added Autopause to Random Video player, improved its randomness.</p>"},{"id":"research-0005","title":"Made The Little News Squirrels Shake","category":"research","tags":"Programming","date":"2020-01-23T01:46:22.215Z","draft":false,"deleted":false,"published":"Wed Jan 22nd 2020, 8:46 PM","html":"<p>Made the little news squirrels shake when a user pokes at them.</p>"},{"id":"research-0004","title":"Testing Component Composition By Generalizing Bodybuilding Advice Preferences Pane Into A Employing The Container In Https...","category":"research","tags":"Programming","date":"2020-01-23T01:07:38.773Z","draft":false,"deleted":false,"published":"Wed Jan 22nd 2020, 8:07 PM","html":"<p>Testing component composition by generalizing Bodybuilding Advice Preferences Pane into a <a href=\"https://github.com/fantasyui-com/catpea-com/blob/0b3dd8426cc0cdcf9ade924293489c3f63996fd1/src/containers/PreferenceCard.svelte#L46\">generic reusable container</a>. Employing the container in <a href=\"https://github.com/fantasyui-com/catpea-com/blob/0b3dd8426cc0cdcf9ade924293489c3f63996fd1/src/components/News.svelte#L45\">News component</a>.</p>"},{"id":"research-0003","title":"Improved The Randomness Of Bodybuilding Advice","category":"research","tags":"Programming","date":"2020-01-22T03:38:19.680Z","draft":false,"deleted":false,"published":"Tue Jan 21st 2020, 10:38 PM","html":"<p>Improved the randomness of Bodybuilding Advice. Items begin repeating after about 84 selections. I added a tiny little sub-progress bar to show when the system will reset, re-shuffle, and begin parading the newly re-shuffled list.</p>"},{"id":"research-0002","title":"Added Preferences Pane To Bodybuilding Advice Component","category":"research","tags":"Programming","date":"2020-01-22T03:23:19.680Z","draft":false,"deleted":false,"published":"Tue Jan 21st 2020, 10:23 PM","html":"<p>Added Preferences Pane to Bodybuilding Advice on <a href=\"http://catpea.com\">Cat Pea</a>.</p><p>Bodybuilding Advice is meant to serve as a starting point for more complex components.</p>"},{"id":"research-0001","title":"I Love The Squirrel Octicon","category":"research","tags":"Programming","date":"2020-01-22T03:22:19.680Z","draft":false,"deleted":false,"published":"Tue Jan 21st 2020, 10:22 PM","html":"<p>Testing <a href=\"https://octicons.github.com/\">octicons</a>. I love the squirrel icon.</p><p><img loading=\"lazy\" class=\"img-fluid rounded shadow mt-5 mb-2\" src=\"image/research-0001-squirrel.png\" alt=\"Squirrel\"></p>"}]